#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x0 (0x28 - 0x28)
// Class Pal.FixedPoint64MathLibrary
class UFixedPoint64MathLibrary : public UBlueprintFunctionLibrary
{
public:

	static class UClass* StaticClass();
	static class UFixedPoint64MathLibrary* GetDefaultObj();

	struct FFixedPoint64 Subtract_FixedPoint64Integer(const struct FFixedPoint64& A, int64 B);
	struct FFixedPoint64 Subtract_FixedPoint64Float(const struct FFixedPoint64& A, float B);
	struct FFixedPoint64 Subtract_FixedPoint64FixedPoint64(const struct FFixedPoint64& A, const struct FFixedPoint64& B);
	bool NotEqual_FixedPoint64Integer(const struct FFixedPoint64& A, int64 B);
	bool NotEqual_FixedPoint64Float(const struct FFixedPoint64& A, float B);
	bool NotEqual_FixedPoint64FixedPoint64(const struct FFixedPoint64& A, const struct FFixedPoint64& B);
	struct FFixedPoint64 Multiply_FixedPoint64Integer(const struct FFixedPoint64& A, int64 B);
	struct FFixedPoint64 Multiply_FixedPoint64Float(const struct FFixedPoint64& A, float B);
	struct FFixedPoint64 Multiply_FixedPoint64FixedPoint64(const struct FFixedPoint64& A, const struct FFixedPoint64& B);
	bool LessEqual_FixedPoint64Integer(const struct FFixedPoint64& A, int64 B);
	bool LessEqual_FixedPoint64Float(const struct FFixedPoint64& A, float B);
	bool LessEqual_FixedPoint64FixedPoint64(const struct FFixedPoint64& A, const struct FFixedPoint64& B);
	bool Less_FixedPoint64Integer(const struct FFixedPoint64& A, int64 B);
	bool Less_FixedPoint64Float(const struct FFixedPoint64& A, float B);
	bool Less_FixedPoint64FixedPoint64(const struct FFixedPoint64& A, const struct FFixedPoint64& B);
	bool GreaterEqual_FixedPoint64Integer(const struct FFixedPoint64& A, int64 B);
	bool GreaterEqual_FixedPoint64Float(const struct FFixedPoint64& A, float B);
	bool GreaterEqual_FixedPoint64FixedPoint64(const struct FFixedPoint64& A, const struct FFixedPoint64& B);
	bool Greater_FixedPoint64Integer(const struct FFixedPoint64& A, int64 B);
	bool Greater_FixedPoint64Float(const struct FFixedPoint64& A, float B);
	bool Greater_FixedPoint64FixedPoint64(const struct FFixedPoint64& A, const struct FFixedPoint64& B);
	bool EqualEqual_FixedPoint64Integer(const struct FFixedPoint64& A, int64 B);
	bool EqualEqual_FixedPoint64Float(const struct FFixedPoint64& A, float B);
	bool EqualEqual_FixedPoint64FixedPoint64(const struct FFixedPoint64& A, const struct FFixedPoint64& B);
	struct FFixedPoint64 Divide_FixedPoint64Integer(const struct FFixedPoint64& A, int64 B);
	struct FFixedPoint64 Divide_FixedPoint64Float(const struct FFixedPoint64& A, float B);
	struct FFixedPoint64 Divide_FixedPoint64FixedPoint64(const struct FFixedPoint64& A, const struct FFixedPoint64& B);
	struct FFixedPoint64 Convert_IntToFixedPoint64(int32 Value);
	struct FFixedPoint64 Convert_Int64ToFixedPoint64(int64 Value);
	struct FFixedPoint64 Convert_FloatToFixedPoint64(float Value);
	int64 Convert_FixedPoint64ToInt64(const struct FFixedPoint64& Value);
	int32 Convert_FixedPoint64ToInt(const struct FFixedPoint64& Value);
	float Convert_FixedPoint64ToFloat(const struct FFixedPoint64& Value);
	struct FFixedPoint64 Add_FixedPoint64Integer(const struct FFixedPoint64& A, int64 B);
	struct FFixedPoint64 Add_FixedPoint64Float(const struct FFixedPoint64& A, float B);
	struct FFixedPoint64 Add_FixedPoint64FixedPoint64(const struct FFixedPoint64& A, const struct FFixedPoint64& B);
};

// 0x0 (0x28 - 0x28)
// Class Pal.FixedPointMathLibrary
class UFixedPointMathLibrary : public UBlueprintFunctionLibrary
{
public:

	static class UClass* StaticClass();
	static class UFixedPointMathLibrary* GetDefaultObj();

	struct FFixedPoint Subtract_FixedPointInteger(const struct FFixedPoint& A, int32 B);
	struct FFixedPoint Subtract_FixedPointFloat(const struct FFixedPoint& A, float B);
	struct FFixedPoint Subtract_FixedPointFixedPoint(const struct FFixedPoint& A, const struct FFixedPoint& B);
	bool NotEqual_FixedPointInteger(const struct FFixedPoint& A, int32 B);
	bool NotEqual_FixedPointFloat(const struct FFixedPoint& A, float B);
	bool NotEqual_FixedPointFixedPoint(const struct FFixedPoint& A, const struct FFixedPoint& B);
	struct FFixedPoint Multiply_FixedPointInteger(const struct FFixedPoint& A, int32 B);
	struct FFixedPoint Multiply_FixedPointFloat(const struct FFixedPoint& A, float B);
	struct FFixedPoint Multiply_FixedPointFixedPoint(const struct FFixedPoint& A, const struct FFixedPoint& B);
	bool LessEqual_FixedPointInteger(const struct FFixedPoint& A, int32 B);
	bool LessEqual_FixedPointFloat(const struct FFixedPoint& A, float B);
	bool LessEqual_FixedPointFixedPoint(const struct FFixedPoint& A, const struct FFixedPoint& B);
	bool Less_FixedPointInteger(const struct FFixedPoint& A, int32 B);
	bool Less_FixedPointFloat(const struct FFixedPoint& A, float B);
	bool Less_FixedPointFixedPoint(const struct FFixedPoint& A, const struct FFixedPoint& B);
	bool GreaterEqual_FixedPointInteger(const struct FFixedPoint& A, int32 B);
	bool GreaterEqual_FixedPointFloat(const struct FFixedPoint& A, float B);
	bool GreaterEqual_FixedPointFixedPoint(const struct FFixedPoint& A, const struct FFixedPoint& B);
	bool Greater_FixedPointInteger(const struct FFixedPoint& A, int32 B);
	bool Greater_FixedPointFloat(const struct FFixedPoint& A, float B);
	bool Greater_FixedPointFixedPoint(const struct FFixedPoint& A, const struct FFixedPoint& B);
	bool EqualEqual_FixedPointInteger(const struct FFixedPoint& A, int32 B);
	bool EqualEqual_FixedPointFloat(const struct FFixedPoint& A, float B);
	bool EqualEqual_FixedPointFixedPoint(const struct FFixedPoint& A, const struct FFixedPoint& B);
	struct FFixedPoint Divide_FixedPointInteger(const struct FFixedPoint& A, int32 B);
	struct FFixedPoint Divide_FixedPointFloat(const struct FFixedPoint& A, float B);
	struct FFixedPoint Divide_FixedPointFixedPoint(const struct FFixedPoint& A, const struct FFixedPoint& B);
	struct FFixedPoint Convert_IntToFixedPoint(int32 Value);
	struct FFixedPoint Convert_FloatToFixedPoint(float Value);
	int32 Convert_FixedPointToInt(const struct FFixedPoint& Value);
	float Convert_FixedPointToFloat(const struct FFixedPoint& Value);
	struct FFixedPoint Add_FixedPointInteger(const struct FFixedPoint& A, int32 B);
	struct FFixedPoint Add_FixedPointFloat(const struct FFixedPoint& A, float B);
	struct FFixedPoint Add_FixedPointFixedPoint(const struct FFixedPoint& A, const struct FFixedPoint& B);
};

// 0xD0 (0xF8 - 0x28)
// Class Pal.PalAbilityPassiveSkill
class UPalAbilityPassiveSkill : public UObject
{
public:
	FDelegateProperty_                           IsRestrictedDelegate;                              // 0x28(0x10)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         IsReserving;                                       // 0x38(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIsRestricted;                                     // 0x39(0x1)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bRequireWorkerWorkingPassiveSkill;                 // 0x3A(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bIsWorking;                                        // 0x3B(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_1FAB[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FPalPassiveAbilitySkills>      PassiveSkills;                                     // 0x40(0x10)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPrivate)
	TMap<struct FPalDataTableRowName_PassiveSkillData, struct FPalPassiveAbilitySkillStatus> SkillStatus;                                       // 0x50(0x50)(Edit, EditConst, NativeAccessSpecifierPrivate)
	int32                                        CurrentRank;                                       // 0xA0(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_1FAF[0x54];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UPalAbilityPassiveSkill* GetDefaultObj();

	void OnWorkerAssignChanged(class UPalCharacterParameterComponent* Parameter);
	void OnUpdateOtomoHolder(class APalCharacter* Character);
	void OnUpdateInventoryContainer(class UPalItemContainer* Container);
	void OnRideInactivated();
	void OnRideActivated();
	void OnReserveInactivated();
	void OnReserveActivated();
	void OnInactivatedAsWorker();
	void OnInactivatedAsOtomoHolder();
	void OnInactivatedAsOtomo();
	void OnActivatedAsWorker();
	void OnActivatedAsOtomoHolder();
	void OnActivatedAsOtomo();
	void ObserveWorking();
	bool IsRestricted__DelegateSignature(class AActor* Trainer);
	bool IsRestricted();
	void Initialize(TArray<struct FPalPassiveAbilitySkills>& _PassiveSkills);
	void InactivateWorkingSkill();
	class APalPlayerController* GetTrainerController();
	class APalCharacter* GetTrainerActor();
	class ACharacter* GetTrainer();
	TArray<class FName> GetPassiveSkillList();
	class APalCharacter* GetOwner();
	int32 GetOtomoRank();
};

// 0x18 (0xB8 - 0xA0)
// Class Pal.PalAbilitySkillParameterComponent
class UPalAbilitySkillParameterComponent : public UActorComponent
{
public:
	TArray<struct FPalPassiveAbilitySkills>      AbilitySkills;                                     // 0xA0(0x10)(ZeroConstructor, NativeAccessSpecifierPrivate)
	class UPalAbilityPassiveSkill*               PassiveSkill;                                      // 0xB0(0x8)(Edit, ZeroConstructor, DisableEditOnTemplate, EditConst, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UPalAbilitySkillParameterComponent* GetDefaultObj();

	void OnRideInactivated();
	void OnRideActivated();
	void OnOwnerCharacterSpawned(const struct FPalInstanceID& ID);
	void OnInitializedCharacter(class APalCharacter* OwnerCharacter);
	void OnInactivatedAsWorker();
	void OnInactivatedAsPartner();
	void OnInactivatedAsOtomoHolder();
	void OnActivatedAsWorker();
	void OnActivatedAsPartner();
	void OnActivatedAsOtomoHolder();
};

// 0x0 (0x28 - 0x28)
// Class Pal.ActionDynamicParameterUtility
class UActionDynamicParameterUtility : public UBlueprintFunctionLibrary
{
public:

	static class UClass* StaticClass();
	static class UActionDynamicParameterUtility* GetDefaultObj();

	void SetBlackboard(struct FActionDynamicParameter& DynamicParameterRef, struct FPalNetArchive& Blackboard);
};

// 0x110 (0x138 - 0x28)
// Class Pal.PalActionBase
class UPalActionBase : public UObject
{
public:
	FMulticastInlineDelegateProperty_            OnActionEndDelegate;                               // 0x28(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	bool                                         bIsEndAction;                                      // 0x38(0x1)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bCanDeleteInstance;                                // 0x39(0x1)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bCanInterruptWaza;                                 // 0x3A(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIsChangeWorkAnimPlayRate;                         // 0x3B(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIsChangeWalkableFloorAngle;                       // 0x3C(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_20F6[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        ActionWalkableFloorAngle;                          // 0x40(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIsDisableNavWalk;                                 // 0x44(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIsReflectForClient;                               // 0x45(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_20F8[0xA];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FActionDynamicParameter               DynamicParameter;                                  // 0x50(0xE0)(NativeAccessSpecifierPrivate)
	uint8                                        Pad_20F9[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UPalActionBase* GetDefaultObj();

	void TickAction(float DeltaTime);
	void SetAnimRateScale(class FName FlagName, float AnimRateScale);
	void SendNotify(class FName NotifyName);
	void OnUpdatePassiveSkill(enum class EPalPassiveSkillEffectType EffectType, float Value);
	void OnEndPassiveSkill(enum class EPalPassiveSkillEffectType EffectType);
	void OnEndAction();
	void OnChangeCurrentWorkSuitability();
	void OnBreakAction();
	void OnBeginAction();
	bool IsInServer();
	bool IsInLocalControlled();
	bool IsEndAction();
	struct FVector GetTargetLocation();
	class FString GetSimpleName();
	struct FRandomStream GetRandomStream();
	int32 GetGeneralPurposeIndex();
	struct FPalNetArchive GetBlackboard();
	struct FVector GetActionVelocity();
	class AActor* GetActionTarget();
	class UPalIndividualCharacterParameter* GetActionIndividualCharacterParameter();
	class APalCharacter* GetActionCharacter();
	bool CanStepCancel();
	bool CanNextActionCancel();
	bool CanGainSP();
	bool CanDeleteInstance();
	void AnimEventSpawn();
	void AnimEventOther();
	void AnimEventAttack();
	void ActionEndDelegate__DelegateSignature();
};

// 0xB0 (0x150 - 0xA0)
// Class Pal.PalActionComponent
class UPalActionComponent : public UActorComponent
{
public:
	TMap<enum class EPalActionType, TSubclassOf<class UPalActionBase>> ActionMap;                                         // 0xA0(0x50)(Edit, BlueprintVisible, BlueprintReadOnly, UObjectWrapper, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnAllActionFinishDelegate;                         // 0xF0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnActionBeginDelegate;                             // 0x100(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnActionNotifyDelegate;                            // 0x110(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UPalActionBase*                        CurrentAction;                                     // 0x120(0x8)(Edit, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class UPalActionBase*>                ActionQueue;                                       // 0x128(0x10)(Edit, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, NativeAccessSpecifierPrivate)
	TArray<class UPalActionBase*>                TerminateWaitActionList;                           // 0x138(0x10)(Edit, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, NativeAccessSpecifierPrivate)
	uint8                                        Pad_2293[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UPalActionComponent* GetDefaultObj();

	class UPalActionBase* PlayActionParameter(const struct FActionDynamicParameter& Param, TSubclassOf<class UPalActionBase> ActionClass);
	class UPalActionBase* PlayActionLocationByType(const struct FVector& Location, enum class EPalActionType Type);
	class UPalActionBase* PlayActionLocation(const struct FVector& Location, TSubclassOf<class UPalActionBase> ActionClass);
	class UPalActionBase* PlayActionByTypeParameter(const struct FActionDynamicParameter& Param, enum class EPalActionType Type);
	class UPalActionBase* PlayActionByType(class AActor* ActionTarget, enum class EPalActionType Type);
	void PlayAction_ToServer(const struct FActionDynamicParameter& Param, TSubclassOf<class UPalActionBase> ActionClass, int32 IssuerID);
	void PlayAction_ToALL(const struct FActionDynamicParameter& Param, TSubclassOf<class UPalActionBase> ActionClass, int32 IssuerID);
	class UPalActionBase* PlayAction_LocalOnly(const struct FActionDynamicParameter& Param, TSubclassOf<class UPalActionBase> ActionClass);
	class UPalActionBase* PlayAction_Internal(const struct FActionDynamicParameter& Param, TSubclassOf<class UPalActionBase> ActionClass);
	class UPalActionBase* PlayAction(class AActor* ActionTarget, TSubclassOf<class UPalActionBase> ActionClass);
	void OnOwnerEndPlay(class AActor* Actor, enum class EEndPlayReason ReasonType);
	void OnCompleteCharacter(class APalCharacter* InCharacter);
	enum class EPalActionType GetCurrentActionType();
	class UPalActionBase* GetCurrentAction();
	void CancelAllAction_Internal();
	void CancelAllAction();
	void CancelActionByType(enum class EPalActionType Type);
	void CancelAction_Internal(const struct FGuid& ActionID);
	void CancelAction(class UPalActionBase* Action);
	void BeginPlay();
	void AllActionFinishDelegate__DelegateSignature(class UPalActionComponent* ActionComponent);
	void ActionStartDelegate__DelegateSignature(class UPalActionBase* Action);
	void ActionNotify__DelegateSignature(class UPalActionBase* Action, class FName NotifyName);
	bool ActionIsEmpty();
};

// 0x0 (0x290 - 0x290)
// Class Pal.PalActionDummyTargetActor
class APalActionDummyTargetActor : public AActor
{
public:

	static class UClass* StaticClass();
	static class APalActionDummyTargetActor* GetDefaultObj();

};

// 0x40 (0x70 - 0x30)
// Class Pal.PalWorldSubsystem
class UPalWorldSubsystem : public UWorldSubsystem
{
public:
	uint8                                        Pad_22C0[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	bool                                         bShouldCreate;                                     // 0x38(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_22C3[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<TSubclassOf<class UWorldSubsystem>>   PrerequisiteWorldSubsystemList;                    // 0x40(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, UObjectWrapper, NativeAccessSpecifierPublic)
	uint8                                        Pad_22C5[0x20];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UPalWorldSubsystem* GetDefaultObj();

};

// 0x10 (0x80 - 0x70)
// Class Pal.PalActionDummyTargetManager
class UPalActionDummyTargetManager : public UPalWorldSubsystem
{
public:
	TArray<class APalActionDummyTargetActor*>    ActionDummyTargetCache;                            // 0x70(0x10)(ZeroConstructor, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UPalActionDummyTargetManager* GetDefaultObj();

};

// 0x18 (0x150 - 0x138)
// Class Pal.PalActionOneShotAnimation
class UPalActionOneShotAnimation : public UPalActionBase
{
public:
	uint8                                        Pad_22D3[0x18];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UPalActionOneShotAnimation* GetDefaultObj();

	void OnEndMontage(class UAnimMontage* Montage, bool bInterrupted);
};

// 0x38 (0x170 - 0x138)
// Class Pal.PalActionSpawnItem
class UPalActionSpawnItem : public UPalActionBase
{
public:
	class FName                                  SpawnSocketName;                                   // 0x138(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                               SpawnLocationOffset;                               // 0x140(0x18)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FRotator                              SpawnItemRotator;                                  // 0x158(0x18)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UPalActionSpawnItem* GetDefaultObj();

	void WriteBlackboard(struct FPalNetArchive& BlackboardRef, struct FPalStaticItemIdAndNum& ItemInfo);
	void SpawnItemInServer();
	void ReadBlackboard(struct FPalStaticItemIdAndNum* ItemInfo);
};

// 0x28 (0x160 - 0x138)
// Class Pal.PalActionTransportItem
class UPalActionTransportItem : public UPalActionBase
{
public:
	class FName                                  ItemAttachSocketName;                              // 0x138(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class AActor*                                ItemActor;                                         // 0x140(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_2346[0x18];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UPalActionTransportItem* GetDefaultObj();

	void WriteBlackboard(struct FPalNetArchive& BlackboardRef, class FName StaticItemId);
	void StartSetupItemActor(class FName StaticItemId);
	void ReadBlackboard(class FName* StaticItemId);
};

// 0x18 (0x150 - 0x138)
// Class Pal.PalActionWazaBase
class UPalActionWazaBase : public UPalActionBase
{
public:
	enum class EPalWazaID                        WazaID;                                            // 0x138(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_2364[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UPalSoundPlayer*                       SoundPlayer;                                       // 0x140(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bApplyFullStomachCost;                             // 0x148(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_2368[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UPalActionWazaBase* GetDefaultObj();

	void StopAkSound();
	void PlayAkSound(class UAkAudioEvent* AudioEvent);
	enum class EPalWazaID GetWazaID();
	class APalPlayerCharacter* GetRiderPlayer();
};

// 0x8 (0x140 - 0x138)
// Class Pal.PalAction_BeLiftup
class UPalAction_BeLiftup : public UPalActionBase
{
public:
	uint8                                        Pad_238A[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UPalAction_BeLiftup* GetDefaultObj();

	void OnStartLifting();
	void OnStartInterpTransform();
	void OnEndInterpTransform();
	void OnDeadOwner_ServerInternal(const struct FPalDeadInfo& DeadInfo);
	void OnAttachedForBP();
};

// 0x18 (0x150 - 0x138)
// Class Pal.PalAction_BeThrown
class UPalAction_BeThrown : public UPalActionBase
{
public:
	class UAnimMontage*                          PlayingMontage;                                    // 0x138(0x8)(BlueprintVisible, ZeroConstructor, Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UNiagaraComponent*                     NiagaraComponent;                                  // 0x140(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_23A7[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UPalAction_BeThrown* GetDefaultObj();

	void PlayThrownMontage();
	void PlayThrownFX();
};

// 0x20 (0x48 - 0x28)
// Class Pal.PalStatusBase
class UPalStatusBase : public UObject
{
public:
	bool                                         bIsEndStatus;                                      // 0x28(0x1)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_23E1[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FStatusDynamicParameter               DynamicParameter;                                  // 0x2C(0xC)(Edit, BlueprintVisible, BlueprintReadOnly, Net, DisableEditOnTemplate, EditConst, NoDestructor, NativeAccessSpecifierPublic)
	enum class EPalStatusID                      StatusId;                                          // 0x38(0x1)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_23E2[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        Duration;                                          // 0x3C(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bIsNerverEnd;                                      // 0x40(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_23E4[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UPalStatusBase* GetDefaultObj();

	void TickStatus(float DeltaTime);
	void SetHalfDurationTimer();
	void OnEndStatus();
	void OnBreakStatus();
	void OnBeginStatus();
	void OnBeginSomeStatus();
	bool IsEndStatus();
	class AActor* GetOwner();
};

// 0x18 (0x60 - 0x48)
// Class Pal.PalAction_DrownCheckBase
class UPalAction_DrownCheckBase : public UPalStatusBase
{
public:
	uint8                                        Pad_23EC[0x18];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UPalAction_DrownCheckBase* GetDefaultObj();

};

// 0x48 (0x180 - 0x138)
// Class Pal.PalAction_FeedItemToCharacter
class UPalAction_FeedItemToCharacter : public UPalActionBase
{
public:
	uint8                                        Pad_240E[0x10];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        TurnSpeed;                                         // 0x148(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_240F[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UPalAIActionFed*                       TargetCharacterAction;                             // 0x150(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_2410[0x28];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UPalAction_FeedItemToCharacter* GetDefaultObj();

	void TimeoutStartTargetCharacterApproachAction();
	void SimpleDelegate__DelegateSignature();
	void PlayMontageFeeding();
	void OnNotifiedMontage_OnReachFeeding();
	void OnFinishPlayMontageFeeding();
	void OnCancelByInputGuard();
};

// 0x8 (0x140 - 0x138)
// Class Pal.PalAction_Liftup
class UPalAction_Liftup : public UPalActionBase
{
public:
	float                                        AttachRelativeLocationOffsetZ;                     // 0x138(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bIsAttachToLeftHand;                               // 0x13C(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_2423[0x3];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UPalAction_Liftup* GetDefaultObj();

	void StartRagdollForTargetCharacter();
	void StartInterpTransformForAttachCharacter();
	void PlayWeaponChangeAnime();
	void PlayTargetBeLiftupAction(class APalCharacter* TargetCharacter);
	void PlayStartLiftupMontage();
	void OnTriggerPlayerInteract();
	void OnCompleteStartLiftupMontage();
	void AttachLiftedCharacter();
};

// 0x8 (0x140 - 0x138)
// Class Pal.PalAction_LiftupThrow
class UPalAction_LiftupThrow : public UPalActionBase
{
public:
	float                                        AttachRelativeLocationOffsetZ;                     // 0x138(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bIsAttachToLeftHand;                               // 0x13C(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_2431[0x3];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UPalAction_LiftupThrow* GetDefaultObj();

	void PlayWeaponChangeAnime();
	void PlayPlayerThrowMontage();
	void LaunchLiftObject();
};

// 0x18 (0x150 - 0x138)
// Class Pal.PalAction_SleepPlayerBed
class UPalAction_SleepPlayerBed : public UPalActionBase
{
public:
	FMulticastInlineDelegateProperty_            OnGetupTriggerDelegate;                            // 0x138(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                        Pad_244B[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UPalAction_SleepPlayerBed* GetDefaultObj();

	void OnGetupTriggerDelegate__DelegateSignature();
	void OnGetupPlayerBedFromModel();
	bool IsSleepLooping();
	void GetupBroadcast();
};

// 0x8 (0x3F0 - 0x3E8)
// Class Pal.PalActivatableWidget
class UPalActivatableWidget : public UCommonActivatableWidget
{
public:
	enum class EPalWidgetInputMode               InputConfig;                                       // 0x3E8(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EMouseCaptureMode                 GameMouseCaptureMode;                              // 0x3E9(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_2451[0x6];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UPalActivatableWidget* GetDefaultObj();

};

// 0x48 (0x70 - 0x28)
// Class Pal.PalActiveSkill
class UPalActiveSkill : public UObject
{
public:
	FMulticastInlineDelegateProperty_            OnCoolTimeUpdate;                                  // 0x28(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnCoolStart;                                       // 0x38(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnCoolFinish;                                      // 0x48(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	bool                                         IsCooling;                                         // 0x58(0x1)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2477[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        ReuseCoolTimer;                                    // 0x5C(0x4)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EPalWazaID                        WazaType;                                          // 0x60(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         IsStopTimer;                                       // 0x61(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_247A[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        DatabaseCoolTime;                                  // 0x64(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bIsTransient;                                      // 0x68(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_247B[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UPalActiveSkill* GetDefaultObj();

	void OnRep_UpdateCoolTime();
	void OnRep_ChangeCTState();
	void OnCoolTimeUpdateDelegate__DelegateSignature(float CoolRate);
	void OnCoolStateChange__DelegateSignature();
	bool IsCoolTimeFinish();
};

// 0x70 (0x98 - 0x28)
// Class Pal.PalActiveSkillSlot
class UPalActiveSkillSlot : public UObject
{
public:
	class AActor*                                SelfActor;                                         // 0x28(0x8)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TMap<int32, class UPalActiveSkill*>          SkillMap;                                          // 0x30(0x50)(Transient, NativeAccessSpecifierPrivate)
	bool                                         IsEndInit;                                         // 0x80(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_24F4[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FFloatContainer                       CoolDownSpeedRateMap;                              // 0x88(0x10)(Transient, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UPalActiveSkillSlot* GetDefaultObj();

	void UpdateCoolTime(float DeltaTime);
	void StopCoolTime(int32 SlotID);
	void SetTransient(int32 SlotID, bool IsTransient);
	void SetSkill(int32 SlotID, enum class EPalWazaID WazaType);
	void SetCoolTimeRate(class FName Key, float Rate);
	void RestartCoolTime(int32 SlotID);
	void RemoveSkill(int32 SlotID);
	void OnChangeEquipWaza(class UPalIndividualCharacterParameter* IndividualParameter);
	bool IsValidSkill(int32 SlotID);
	bool IsTransient(int32 SlotID);
	bool IsNearMaxRange(int32 SlotID, class AActor* TargetActor);
	bool IsFarMinRange(int32 SlotID, class AActor* TargetActor);
	bool IsCoolTimeFinish(int32 SlotID);
	void InitObject(class AActor* ActorSelf);
	enum class EPalWazaID GetWazaType(int32 SlotID);
	TMap<int32, class UPalActiveSkill*> GetSkillMap();
	TArray<int32> GetEnableSlotIDs();
	float GetCoolTimeRate(int32 SlotID);
	float GetCoolTime(int32 SlotID);
	int32 FindMostEffectiveSlotID(class AActor* TargetActor);
	int32 ChoiceEnableSlotIDByRandom();
	bool CanUse(int32 SlotID, class AActor* TargetActor);
};

// 0x0 (0x290 - 0x290)
// Class Pal.PalActorChannel
class UPalActorChannel : public UActorChannel
{
public:

	static class UClass* StaticClass();
	static class UPalActorChannel* GetDefaultObj();

};

// 0xA0 (0x130 - 0x90)
// Class Pal.PalAIActionBase
class UPalAIActionBase : public UPawnAction_BlueprintBase
{
public:
	bool                                         bIsAutoStopBehaviorTree;                           // 0x90(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EPalAIActionCategory              AiActionCategory;                                  // 0x91(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_256A[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FPalAIActionDynamicParameter          DynamicParameter;                                  // 0x98(0x50)(BlueprintVisible, Transient, NoDestructor, NativeAccessSpecifierPublic)
	enum class EAIRequestPriority                DefaultPriority;                                   // 0xE8(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_256C[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	FMulticastInlineDelegateProperty_            OnStartActionDelegate;                             // 0xF0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnPauseActionDelegate;                             // 0x100(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnResumeActionDelegate;                            // 0x110(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnFinishActionDelegate;                            // 0x120(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UPalAIActionBase* GetDefaultObj();

	void SetWalkSpeed_ForAIAction(enum class EPalMovementSpeedType MoveSpeedType);
	class UPalAIActionBase* SetAIActionClassParameter(TSubclassOf<class UPalAIActionBase> NewActionClass, const struct FPalAIActionDynamicParameter& Parameter);
	bool PushChildAction(class UPawnAction* Action);
	void OnChildActionFinished(class UPawnAction* Action, enum class EPawnActionResult WithResult);
	void OnActionDelegate__DelegateSignature(class UPalAIActionBase* Action);
	void OnActionByDelegate__DelegateSignature(class UPalAIActionBase* Action, class UPawnAction* byAction);
	bool IsPaused();
	bool IsActive();
	class FString GetSimpleName();
	enum class EAIRequestPriority GetRequestPriority();
	class APalAIController* GetPalAIController();
	class UPawnActionsComponent* GetOwnerComponent();
	class AController* GetController();
	class UPalCharacterParameterComponent* GetCharacterParameter();
	class APalCharacter* GetCharacter();
	class UPalAIActionComponent* GetAIActionComponent();
	class UPalActionComponent* GetActionComponent();
	class UPawnAction* CreateActionInstanceFixName(class UObject* WorldContextObject, TSubclassOf<class UPawnAction> ActionClass, class FName ActionName);
	void ActionAbort(class APawn* ControlledPawn);
};

// 0x10 (0x140 - 0x130)
// Class Pal.PalAIActionBaseCampBase
class UPalAIActionBaseCampBase : public UPalAIActionBase
{
public:
	uint8                                        Pad_25C1[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        WalkSpeedDefault;                                  // 0x138(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_25C2[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UPalAIActionBaseCampBase* GetDefaultObj();

	void StartCombatAction(TSubclassOf<class UPalAIActionCombatBase> CombatActionClass);
	void OnUpdateFullStomach(float Current, float Last);
	void OnTriggerInteract(class AActor* OtherActor, enum class EPalInteractiveObjectIndicatorType IndicatorType);
	void OnClosedWorkerRadialMenu(class UPalHUDDispatchParameterBase* Parameter);
	void NotifyOrderCommand(enum class EPalMapBaseCampWorkerOrderType OrderType);
	void InterruptActionToRecoverHungry(const struct FPalMonsterControllerBaseCampHungryParameter& Parameter);
	struct FGuid GetBaseCampIdBelongTo();
	class UPalBaseCampModel* GetBaseCampBelongTo();
	void FinishCombatAction();
	void ChangeChildAction(class UPalAIActionBaseCampChildBase* Action);
	void ChangeActionToWorker();
	void ChangeActionToFighter();
};

// 0x8 (0x138 - 0x130)
// Class Pal.PalAIActionBaseCampChildBase
class UPalAIActionBaseCampChildBase : public UPalAIActionBase
{
public:
	TWeakObjectPtr<class UPalAIActionBaseCampBase> BaseCampParentAction;                              // 0x130(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UPalAIActionBaseCampChildBase* GetDefaultObj();

};

// 0x8 (0x138 - 0x130)
// Class Pal.PalAIActionBaseCampCage
class UPalAIActionBaseCampCage : public UPalAIActionBase
{
public:
	uint8                                        Pad_25EE[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UPalAIActionBaseCampCage* GetDefaultObj();

};

// 0x58 (0x188 - 0x130)
// Class Pal.PalAIActionBaseCampDefenseBase
class UPalAIActionBaseCampDefenseBase : public UPalAIActionBase
{
public:
	uint8                                        Pad_25F9[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class AActor*                                TargetActor;                                       // 0x138(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class APalCharacter*                         SelfActor;                                         // 0x140(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UPalAICombatModule*                    CombatModule;                                      // 0x148(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EPalWorkType                      CurrentWorkType;                                   // 0x150(0x1)(Edit, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_2600[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FPalWorkAssignHandleId                CurrentWorkAssignId;                               // 0x154(0x18)(Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EPalWorkDefenseCombatType         DefenseCombatType;                                 // 0x16C(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_2602[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TSubclassOf<class UPalActionBase>            DefenseActionClass;                                // 0x170(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UPalActionBase>            DefenseWaitActionClass;                            // 0x178(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class UPalMapObjectDefenseBulletLauncherModel> WeakDefenseModel;                                  // 0x180(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UPalAIActionBaseCampDefenseBase* GetDefaultObj();

	class APalAIController* GetControllerRef();
};

// 0x8 (0x190 - 0x188)
// Class Pal.PalAIActionBaseCampDefenseGunner
class UPalAIActionBaseCampDefenseGunner : public UPalAIActionBaseCampDefenseBase
{
public:
	uint8                                        Pad_260F[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UPalAIActionBaseCampDefenseGunner* GetDefaultObj();

	void StopTrigger();
	void OnShootBullet();
};

// 0x0 (0x188 - 0x188)
// Class Pal.PalAIActionBaseCampDefenseWait
class UPalAIActionBaseCampDefenseWait : public UPalAIActionBaseCampDefenseBase
{
public:

	static class UClass* StaticClass();
	static class UPalAIActionBaseCampDefenseWait* GetDefaultObj();

};

// 0x30 (0x160 - 0x130)
// Class Pal.PalAIActionBaseCampDodgeWork
class UPalAIActionBaseCampDodgeWork : public UPalAIActionBase
{
public:
	float                                        WalkAroundArrivalRange;                            // 0x130(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        WalkAroundNextDistance;                            // 0x134(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FFloatInterval                        WalkAroundRandomTime;                              // 0x138(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_2616[0x20];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UPalAIActionBaseCampDodgeWork* GetDefaultObj();

};

// 0x0 (0x140 - 0x140)
// Class Pal.PalAIActionBaseCampFighter
class UPalAIActionBaseCampFighter : public UPalAIActionBaseCampBase
{
public:

	static class UClass* StaticClass();
	static class UPalAIActionBaseCampFighter* GetDefaultObj();

	bool TryGetDefenseMapObjectModel(class UPalMapObjectDefenseModelBase** OutModel);
	void RegisterAssignDefenseModelId(struct FGuid& InDefenseMapObjectModelId);
	void ChangeActionWait();
};

// 0x8 (0x140 - 0x138)
// Class Pal.PalAIActionBaseCampFighterChildBase
class UPalAIActionBaseCampFighterChildBase : public UPalAIActionBaseCampChildBase
{
public:
	TWeakObjectPtr<class UPalAIActionBaseCampFighter> WeakParentFighterActionCache;                      // 0x138(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UPalAIActionBaseCampFighterChildBase* GetDefaultObj();

	class UPalAIActionBaseCampFighter* GetParentFighterAction();
};

// 0x48 (0x178 - 0x130)
// Class Pal.PalAIActionCombatBase
class UPalAIActionCombatBase : public UPalAIActionBase
{
public:
	uint8                                        Pad_269E[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	FMulticastInlineDelegateProperty_            OnCombatFinish;                                    // 0x138(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class AActor*                                TargetActor;                                       // 0x148(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class APalCharacter*                         SelfActor;                                         // 0x150(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UPalAICombatModule*                    CombatModule;                                      // 0x158(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         NextIsWaza;                                        // 0x160(0x1)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_26A5[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        NextWazaSlotIndex;                                 // 0x164(0x4)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UPalActionBase>            NextActionClass;                                   // 0x168(0x8)(BlueprintVisible, ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        InterruptSkillSlotID;                              // 0x170(0x4)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bInterruptSkill;                                   // 0x174(0x1)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_26A9[0x3];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UPalAIActionCombatBase* GetDefaultObj();

	void StartNextAction_Event(class UPalActionComponent* ActionComponent);
	void SkillSlotSetUp();
	void SetTargetAndNextAction(class AActor* Target);
	bool PreTickFinishCheck();
	void PlayActionWhenDarknessStatus();
	void OnDeadDeledate_Event(const struct FPalDeadInfo& DeadInfo);
	void MoveToTarget();
	bool LineTraceTarget();
	void InterruptAction(int32 SkillSlotID);
	class UPalStaticCharacterParameterComponent* GetStaticParamCompRef();
	class UPalActiveSkillSlot* GetSkillSlotRef();
	class UPalCharacterParameterComponent* GetParamCompRef();
	class APalAIController* GetControllerRef();
	class UPalActionComponent* GetActorActionComponentRef();
	void CombatFinishDelegate__DelegateSignature();
	void ChangeNextAction();
};

// 0x0 (0x178 - 0x178)
// Class Pal.PalAIActionBaseCampFighterCombat
class UPalAIActionBaseCampFighterCombat : public UPalAIActionCombatBase
{
public:

	static class UClass* StaticClass();
	static class UPalAIActionBaseCampFighterCombat* GetDefaultObj();

};

// 0x10 (0x188 - 0x178)
// Class Pal.PalAIActionBaseCampFighterCombatGunner
class UPalAIActionBaseCampFighterCombatGunner : public UPalAIActionCombatBase
{
public:
	float                                        FaceAngleRange;                                    // 0x178(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class UPalMapObjectDefenseBulletLauncherModel> WeakDefenseModel;                                  // 0x17C(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_26F5[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UPalAIActionBaseCampFighterCombatGunner* GetDefaultObj();

};

// 0x0 (0x140 - 0x140)
// Class Pal.PalAIActionBaseCampFighterWait
class UPalAIActionBaseCampFighterWait : public UPalAIActionBaseCampFighterChildBase
{
public:

	static class UClass* StaticClass();
	static class UPalAIActionBaseCampFighterWait* GetDefaultObj();

	bool TrySearchEnemy();
	bool TryGetWaitLocation(struct FVector* Location);
};

// 0x10 (0x150 - 0x140)
// Class Pal.PalAIActionBaseCampInUsingAmusement
class UPalAIActionBaseCampInUsingAmusement : public UPalAIActionBaseCampBase
{
public:
	uint8                                        Pad_271D[0x10];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UPalAIActionBaseCampInUsingAmusement* GetDefaultObj();

	float GetUsingTime();
};

// 0x48 (0x188 - 0x140)
// Class Pal.PalAIActionBaseCampRecoverHungry
class UPalAIActionBaseCampRecoverHungry : public UPalAIActionBaseCampBase
{
public:
	uint8                                        Pad_2730[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FGuid                                 WantFoodHUDId;                                     // 0x148(0x10)(Edit, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UPalUserWidgetWorldHUD>    WantFoodHUDClass;                                  // 0x158(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                               WantFoodHUDOffset;                                 // 0x160(0x18)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FPalMonsterControllerBaseCampHungryParameter HungeryParameter;                                  // 0x178(0xC)(Edit, BlueprintVisible, DisableEditOnTemplate, Transient, EditConst, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_2731[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UPalAIActionBaseCampRecoverHungry* GetDefaultObj();

	void ChangeActionEat();
	void ChangeActionApproach();
};

// 0x8 (0x140 - 0x138)
// Class Pal.PalAIActionBaseCampRecoverHungryChildBase
class UPalAIActionBaseCampRecoverHungryChildBase : public UPalAIActionBaseCampChildBase
{
public:
	uint8                                        Pad_2753[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UPalAIActionBaseCampRecoverHungryChildBase* GetDefaultObj();

	bool TryGetTargetMapObjectConcreteModel(class UPalMapObjectConcreteModelBase** OutTargetModel);
	void ToggleShowWantFoodHUD(bool bShow);
	bool IsExistEnoughFoodInTarget();
	bool IsAvailableDistance();
	struct FVector GetTargetLocation();
	class UPalAIActionBaseCampRecoverHungry* GetParentRecoverHungryAction();
	void GetHungryParameter(struct FPalMonsterControllerBaseCampHungryParameter* HungeryParameter);
};

// 0x8 (0x148 - 0x140)
// Class Pal.PalAIActionBaseCampRecoverHungryApproachToFoodBox
class UPalAIActionBaseCampRecoverHungryApproachToFoodBox : public UPalAIActionBaseCampRecoverHungryChildBase
{
public:
	uint8                                        Pad_2760[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UPalAIActionBaseCampRecoverHungryApproachToFoodBox* GetDefaultObj();

};

// 0x30 (0x170 - 0x140)
// Class Pal.PalAIActionBaseCampRecoverHungryEat
class UPalAIActionBaseCampRecoverHungryEat : public UPalAIActionBaseCampRecoverHungryChildBase
{
public:
	float                                        EatTime;                                           // 0x140(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        TurnSpeed;                                         // 0x144(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_2764[0x28];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UPalAIActionBaseCampRecoverHungryEat* GetDefaultObj();

	void OnFinishEatingTime();
};

// 0x8 (0x148 - 0x140)
// Class Pal.PalAIActionBaseCampRecoverHungryProductFood
class UPalAIActionBaseCampRecoverHungryProductFood : public UPalAIActionBaseCampRecoverHungryChildBase
{
public:
	uint8                                        Pad_2772[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UPalAIActionBaseCampRecoverHungryProductFood* GetDefaultObj();

};

// 0x8 (0x138 - 0x130)
// Class Pal.PalAIActionBaseCampReturnBack
class UPalAIActionBaseCampReturnBack : public UPalAIActionBase
{
public:
	uint8                                        Pad_2774[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UPalAIActionBaseCampReturnBack* GetDefaultObj();

};

// 0x10 (0x150 - 0x140)
// Class Pal.PalAIActionBaseCampSleep
class UPalAIActionBaseCampSleep : public UPalAIActionBaseCampBase
{
public:
	uint8                                        Pad_2777[0x10];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UPalAIActionBaseCampSleep* GetDefaultObj();

};

// 0x60 (0x1A0 - 0x140)
// Class Pal.PalAIActionBaseCampSleepActively
class UPalAIActionBaseCampSleepActively : public UPalAIActionBaseCampBase
{
public:
	uint8                                        Pad_2783[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FGuid                                 ReservedBedModelInstanceId;                        // 0x148(0x10)(Edit, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	enum class EPalAIActionBaseCampSleepActivelyMode Mode;                                              // 0x158(0x1)(Edit, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_2787[0x47];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UPalAIActionBaseCampSleepActively* GetDefaultObj();

	void SetParameter(struct FPalAIActionBaseCampSleepActivelyParameter& Parameter);
};

// 0x10 (0x140 - 0x130)
// Class Pal.PalAIActionBaseCampSpawningForWorker
class UPalAIActionBaseCampSpawningForWorker : public UPalAIActionBase
{
public:
	FMulticastInlineDelegateProperty_            OnLandedWorldStaticDelegate;                       // 0x130(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UPalAIActionBaseCampSpawningForWorker* GetDefaultObj();

	void SimpleMulticastDelegate__DelegateSignature();
	void OnLanded(struct FHitResult& Hit);
};

// 0x30 (0x160 - 0x130)
// Class Pal.PalAIActionBaseCampTrantrum
class UPalAIActionBaseCampTrantrum : public UPalAIActionBase
{
public:
	float                                        Duration;                                          // 0x130(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        RadiusAttackTo;                                    // 0x134(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FInt32Interval                        AttackNumRange;                                    // 0x138(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        TurnSpeedToAttack;                                 // 0x140(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGuid                                 AttackTargetMapObjectInstanceId;                   // 0x144(0x10)(Edit, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_2795[0xC];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UPalAIActionBaseCampTrantrum* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class Pal.PalAIActionBaseCampUtility
class UPalAIActionBaseCampUtility : public UBlueprintFunctionLibrary
{
public:

	static class UClass* StaticClass();
	static class UPalAIActionBaseCampUtility* GetDefaultObj();

	enum class EAIRequestPriority GetRequestSoftScriptPriority(enum class EPalRequestSoftScriptPriorityAdd AddPriority);
};

// 0x0 (0x130 - 0x130)
// Class Pal.PalAIActionCollectItemToStorage
class UPalAIActionCollectItemToStorage : public UPalAIActionBase
{
public:

	static class UClass* StaticClass();
	static class UPalAIActionCollectItemToStorage* GetDefaultObj();

};

// 0x0 (0x178 - 0x178)
// Class Pal.PalAIActionCombat_BaseCamp
class UPalAIActionCombat_BaseCamp : public UPalAIActionCombatBase
{
public:

	static class UClass* StaticClass();
	static class UPalAIActionCombat_BaseCamp* GetDefaultObj();

};

// 0x0 (0x178 - 0x178)
// Class Pal.PalAIActionCombat_Standard
class UPalAIActionCombat_Standard : public UPalAIActionCombatBase
{
public:

	static class UClass* StaticClass();
	static class UPalAIActionCombat_Standard* GetDefaultObj();

};

// 0x10 (0xF0 - 0xE0)
// Class Pal.PalAIActionComponent
class UPalAIActionComponent : public UPawnActionsComponent
{
public:
	TArray<class UPalAIActionCompositeBase*>     ActionCompositeRoots;                              // 0xE0(0x10)(Edit, ZeroConstructor, DisableEditOnTemplate, EditConst, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UPalAIActionComponent* GetDefaultObj();

	void TerminateCurrentActionByClass(TSubclassOf<class UPalAIActionBase> ActionClass);
	void SetWalkSpeed_ForAIAction(enum class EPalMovementSpeedType MoveSpeedType);
	void SetRootComposite(class UPalAIActionCompositeBase* NewCompositeAction, enum class EAIRequestPriority Priority);
	class UPalAIActionBase* SetActionClassParameter(TSubclassOf<class UPalAIActionBase> NewActionClass, const struct FPalAIActionDynamicParameter& Parameter);
	void SetAction(class UPawnAction* NewAction, enum class EAIRequestPriority Priority, class UObject* Instigator);
	bool IsActionEmpty();
	bool HasAction(TSubclassOf<class UPawnAction>& CheckClass, enum class EAIRequestPriority CheckPriority);
	class UPawnAction* GetCurrentTopParentAction_BP();
	enum class EPalAIActionCategory GetCurrentAIActionCategory();
	class UPawnAction* GetCurrentAction_BP();
	class UPalAIActionCompositeBase* GetCompositeRoot(enum class EAIRequestPriority Priority);
	void CacheControlledPawn_BP();
	void AllCancelPushedAction(class UObject* Instigator);
	void AllCancelActionPriorThanSoftScript(class UObject* Instigator);
	void AllCancelAction_Logic_HardScript_Reaction(class UObject* Instigator);
};

// 0x20 (0x48 - 0x28)
// Class Pal.PalAIActionCompositeBase
class UPalAIActionCompositeBase : public UObject
{
public:
	uint8                                        Pad_282C[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UPalAIActionCompositeBase*             Child;                                             // 0x30(0x8)(ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_282D[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UPalAIActionComponent*                 OwnerComponent;                                    // 0x40(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UPalAIActionCompositeBase* GetDefaultObj();

	void SetChildActionComposite(class UPalAIActionCompositeBase* Composite);
	void SetChildAction(class UPalAIActionBase* Action, class UObject* Instigator);
	bool IsPaused();
	class APawn* GetPawn();
	class UPalAIActionComponent* GetOwnerComponent();
	class AController* GetController();
	class UPalAIActionCompositeBase* GetChild();
	class UPalCharacterParameterComponent* GetCharacterParameter();
	class UPalActionComponent* GetActionComponent();
};

// 0x50 (0x98 - 0x48)
// Class Pal.PalAIActionCompositeBaseCamp
class UPalAIActionCompositeBaseCamp : public UPalAIActionCompositeBase
{
public:
	float                                        WalkSpeedDefault;                                  // 0x48(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_2844[0x4C];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UPalAIActionCompositeBaseCamp* GetDefaultObj();

	void NotifyOrderCommand(enum class EPalMapBaseCampWorkerOrderType OrderType);
	void InterruptActionToSleep();
	void InterruptActionToRecoverHungry(struct FPalMonsterControllerBaseCampHungryParameter& Parameter);
	void ChangeActionToWorker();
	void ChangeActionToFighter();
};

// 0x0 (0x28 - 0x28)
// Class Pal.PalAIActionCompositeOrderCommandInterface
class IPalAIActionCompositeOrderCommandInterface : public IInterface
{
public:

	static class UClass* StaticClass();
	static class IPalAIActionCompositeOrderCommandInterface* GetDefaultObj();

};

// 0x8 (0x50 - 0x48)
// Class Pal.PalAIActionCompositeActionDummy
class UPalAIActionCompositeActionDummy : public UPalAIActionCompositeBase
{
public:
	uint8                                        Pad_285A[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UPalAIActionCompositeActionDummy* GetDefaultObj();

	void OnResumeAction(class UPalAIActionBase* Action);
	void OnPauseAction(class UPalAIActionBase* Action, class UPawnAction* PausedBy);
	void OnFinishAction(class UPalAIActionBase* Action);
};

// 0x40 (0x88 - 0x48)
// Class Pal.PalAIActionCompositeWorker
class UPalAIActionCompositeWorker : public UPalAIActionCompositeBase
{
public:
	TSubclassOf<class UPalAIActionBase>          WaitActionClass;                                   // 0x48(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UPalAIActionBase>          ApproachActionClass;                               // 0x50(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UPalAIActionBase>          WaitForWorkableActionClass;                        // 0x58(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UPalAIActionBase>          WorkingActionClass;                                // 0x60(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UPalAIActionBase>          CurrentActionClass;                                // 0x68(0x8)(Edit, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                  SpeedFlagName;                                     // 0x70(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        DefaultWalkSpeed;                                  // 0x78(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_286D[0xC];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UPalAIActionCompositeWorker* GetDefaultObj();

	void UnregisterFixAssignWork();
	bool TryFindNextWork();
	void RegisterFixedAssignWorkAttack(struct FGuid& MapObjectModelInstanceId);
	void RegisterFixedAssignWork(struct FGuid& WorkId);
	void OnTickInWaitAction(float DeltaTime);
	void OnStartAction(class UPalAIActionBase* Action);
	bool IsTargetWorkable();
	bool IsTargetAssignable();
	bool IsAssignedToTarget();
	void ChangeActionWorking();
	void ChangeActionWaitForWorkable();
	void ChangeActionWait();
	void ChangeActionApproachToWorkArea();
};

// 0x8 (0x138 - 0x130)
// Class Pal.PalAIActionWorkerChildBase
class UPalAIActionWorkerChildBase : public UPalAIActionBase
{
public:
	uint8                                        Pad_2884[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UPalAIActionWorkerChildBase* GetDefaultObj();

	void LookToTarget(float TurnSpeed, float DeltaTime);
	bool IsTargetWorkable();
	bool IsTargetAssignable();
	bool IsAssignedToTarget();
	struct FVector GetWorkLookAtLocation();
	class UPalAIActionCompositeWorker* GetParent();
};

// 0x18 (0xA0 - 0x88)
// Class Pal.PalAIActionCompositeWorkerBaseCamp
class UPalAIActionCompositeWorkerBaseCamp : public UPalAIActionCompositeWorker
{
public:
	uint8                                        Pad_2886[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TSubclassOf<class UPalAIActionCombatBase>    CombatActionClass;                                 // 0x90(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UPalAIActionBaseCampDefenseBase> DefenseActionClass;                                // 0x98(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UPalAIActionCompositeWorkerBaseCamp* GetDefaultObj();

};

// 0x8 (0x30 - 0x28)
// Class Pal.PalAIActionCompositeWorkerModuleBase
class UPalAIActionCompositeWorkerModuleBase : public UObject
{
public:
	class UPalAIActionCompositeWorker*           Owner;                                             // 0x28(0x8)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UPalAIActionCompositeWorkerModuleBase* GetDefaultObj();

};

// 0x0 (0x30 - 0x30)
// Class Pal.PalAIActionCompositeWorkerModuleNormal
class UPalAIActionCompositeWorkerModuleNormal : public UPalAIActionCompositeWorkerModuleBase
{
public:

	static class UClass* StaticClass();
	static class UPalAIActionCompositeWorkerModuleNormal* GetDefaultObj();

};

// 0x0 (0x30 - 0x30)
// Class Pal.PalAIActionCompositeWorkerModuleBaseCamp
class UPalAIActionCompositeWorkerModuleBaseCamp : public UPalAIActionCompositeWorkerModuleBase
{
public:

	static class UClass* StaticClass();
	static class UPalAIActionCompositeWorkerModuleBaseCamp* GetDefaultObj();

	struct FGuid GetBaseCampIdBelongTo();
	class UPalBaseCampModel* GetBaseCampBelongTo();
};

// 0xB8 (0x1E8 - 0x130)
// Class Pal.PalAIActionCoopAssaultrifleMode
class UPalAIActionCoopAssaultrifleMode : public UPalAIActionBase
{
public:
	float                                        SearchEnemyRadius;                                 // 0x130(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        SearchLocationRadiusMax;                           // 0x134(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        SearchLocationRadiusStep;                          // 0x138(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        SearchLocationDegStep;                             // 0x13C(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        SearchingLocationRadius;                           // 0x140(0x4)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_28F2[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class APalCharacter*                         TargetCharacter;                                   // 0x148(0x8)(Edit, ZeroConstructor, EditConst, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class APalCharacter*                         ReticleTarget;                                     // 0x150(0x8)(Edit, ZeroConstructor, EditConst, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FVector                               AimStartPoint;                                     // 0x158(0x18)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_28F4[0x78];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UPalAIActionCoopAssaultrifleMode* GetDefaultObj();

	void Update(float DeltaTime);
	void SetAimStartPoint(struct FVector& OffsetLocation);
	void SearchForTargetAndShootingLocation();
	void ProgressSeraching(float DeltaTime);
	void Progress_VerifyShootableEnemy();
	void Progress_CollectShootableLocation();
	void OnUpdateShootingLocation(class APalCharacter* Target, struct FVector& ShootLocation);
	void OnRoadBlocked();
	bool IsSearching();
	bool HasReached(struct FVector& Goal);
	class APalCharacter* GetTrainer();
	void GetTargetEnemies(TArray<class APalCharacter*>* Enemies);
	class APalCharacter* GetTargetCharacter();
	class APalCharacter* GetReticleTarget();
	void GetCandidateLocations(float Radius, float DegStep, TArray<struct FPalCoopSkillAssaultrifleModeCandidateLocation>* Results);
	bool FindLocationToShootEnemy(class APalCharacter* Target, struct FPalCoopSkillAssaultrifleModeCandidateLocation* OutLocation);
	void ClearTargetCharacter();
};

// 0x18 (0x148 - 0x130)
// Class Pal.PalAIActionFed
class UPalAIActionFed : public UPalAIActionBase
{
public:
	uint8                                        Pad_28FF[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class APalCharacter*                         ApproachTarget;                                    // 0x138(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_2900[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UPalAIActionFed* GetDefaultObj();

};

// 0x8 (0x50 - 0x48)
// Class Pal.PalAIActionFunnelCharacterDefault
class UPalAIActionFunnelCharacterDefault : public UPalAIActionCompositeBase
{
public:
	uint8                                        Pad_2910[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UPalAIActionFunnelCharacterDefault* GetDefaultObj();

	bool ShouldSetSkillAction();
	void SetSkillAction();
	void SetOtomoFollowAction();
	void OnTick_BP(float DeltaTime);
	void CreateSkillActionModule(TSubclassOf<class UPalFunnelSkillModule> FunnelSkillModuleClass);
};

// 0x8 (0x138 - 0x130)
// Class Pal.PalAIActionFunnelSkillBase
class UPalAIActionFunnelSkillBase : public UPalAIActionBase
{
public:
	class UPalFunnelSkillModule*                 Module;                                            // 0x130(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UPalAIActionFunnelSkillBase* GetDefaultObj();

	void SetModule(class UPalFunnelSkillModule* InModule);
};

// 0x10 (0x140 - 0x130)
// Class Pal.PalAIActionLiftup
class UPalAIActionLiftup : public UPalAIActionBase
{
public:
	uint8                                        Pad_2922[0x10];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UPalAIActionLiftup* GetDefaultObj();

	void OnLanded();
	void CallOnLanded(struct FHitResult& Hit);
};

// 0x8 (0x50 - 0x48)
// Class Pal.PalAIActionOtomoDefault
class UPalAIActionOtomoDefault : public UPalAIActionCompositeBase
{
public:
	uint8                                        Pad_292A[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UPalAIActionOtomoDefault* GetDefaultObj();

	bool ShouldSetCombatAction();
	void SetOtomoWorkActionFixedAssign(class AActor* HitActor);
	void SetOtomoWorkAction();
	void SetOtomoFollowAction();
	void SetOtomoCombatAction();
	void SetOtomoBaseCampAction();
};

// 0x28 (0x160 - 0x138)
// Class Pal.PalAIActionWorkerApproachToWorkArea
class UPalAIActionWorkerApproachToWorkArea : public UPalAIActionWorkerChildBase
{
public:
	uint8                                        Pad_293B[0x28];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UPalAIActionWorkerApproachToWorkArea* GetDefaultObj();

	void OnReceiveMoveCompleted(const struct FAIRequestID& AIRequestID, enum class EPathFollowingResult Result);
};

// 0x10 (0x140 - 0x130)
// Class Pal.PalAIActionWorkerReaction
class UPalAIActionWorkerReaction : public UPalAIActionBase
{
public:
	class APalCharacter*                         LookTargetCharacter;                               // 0x130(0x8)(Edit, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_294C[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UPalAIActionWorkerReaction* GetDefaultObj();

};

// 0x0 (0x138 - 0x138)
// Class Pal.PalAIActionWorkerWait
class UPalAIActionWorkerWait : public UPalAIActionWorkerChildBase
{
public:

	static class UClass* StaticClass();
	static class UPalAIActionWorkerWait* GetDefaultObj();

	void ReturnToDefaultPosition();
	void OnTickForWait(float DeltaTime);
	enum class EPathFollowingRequestResult MoveToLocation(struct FVector& ToLocation);
	bool CalcWalkAroundDestination(float Radius, struct FVector* OutDestination);
};

// 0x18 (0x150 - 0x138)
// Class Pal.PalAIActionWorkerWaitForWorkable
class UPalAIActionWorkerWaitForWorkable : public UPalAIActionWorkerChildBase
{
public:
	uint8                                        Pad_296C[0x18];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UPalAIActionWorkerWaitForWorkable* GetDefaultObj();

};

// 0x20 (0x158 - 0x138)
// Class Pal.PalAIActionWorkerWorking
class UPalAIActionWorkerWorking : public UPalAIActionWorkerChildBase
{
public:
	enum class EPalWorkType                      CurrentWorkType;                                   // 0x138(0x1)(Edit, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_2972[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        TurnSpeedToTarget;                                 // 0x13C(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_2973[0x18];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UPalAIActionWorkerWorking* GetDefaultObj();

};

// 0x18 (0x148 - 0x130)
// Class Pal.PalAIAction_LeaveBase
class UPalAIAction_LeaveBase : public UPalAIActionBase
{
public:
	class AActor*                                TargetActor;                                       // 0x130(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class APalCharacter*                         SelfActor;                                         // 0x138(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UPalCharacterMovementComponent*        Movement;                                          // 0x140(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UPalAIAction_LeaveBase* GetDefaultObj();

	void InitializeObject(class AActor* CombatTarget, class APalCharacter* SelfCharactor);
};

// 0x0 (0x28 - 0x28)
// Class Pal.PalAIBlackboardBase
class UPalAIBlackboardBase : public UObject
{
public:

	static class UClass* StaticClass();
	static class UPalAIBlackboardBase* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class Pal.PalAICombatModule
class UPalAICombatModule : public UObject
{
public:

	static class UClass* StaticClass();
	static class UPalAICombatModule* GetDefaultObj();

	void UpdateBattleState();
	void Setup();
	void OnBattleFinish();
	bool IsReachable_NavMesh_ForActor(class AActor* Target);
	bool IsReachable_NavMesh(const struct FVector& TargetPos);
	bool IsBattleMode();
	class AActor* GetTargetActor();
	bool AIMoveToTargetActor(class AActor* Target);
};

// 0x8 (0x30 - 0x28)
// Class Pal.PalAICombatModule_BaseCamp
class UPalAICombatModule_BaseCamp : public UPalAICombatModule
{
public:
	TWeakObjectPtr<class UPalAIActionBaseCampFighter> ParentFighterAction;                               // 0x28(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UPalAICombatModule_BaseCamp* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class Pal.PalAICombatModule_EnemyNormal
class UPalAICombatModule_EnemyNormal : public UPalAICombatModule
{
public:

	static class UClass* StaticClass();
	static class UPalAICombatModule_EnemyNormal* GetDefaultObj();

};

// 0x18 (0x40 - 0x28)
// Class Pal.PalAICombatModule_Invader
class UPalAICombatModule_Invader : public UPalAICombatModule
{
public:
	uint8                                        Pad_29A0[0x18];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UPalAICombatModule_Invader* GetDefaultObj();

	void OnBattleFinish_forDelegate(class AActor* Actor);
};

// 0x0 (0x28 - 0x28)
// Class Pal.PalAICombatModule_Otomo
class UPalAICombatModule_Otomo : public UPalAICombatModule
{
public:

	static class UClass* StaticClass();
	static class UPalAICombatModule_Otomo* GetDefaultObj();

};

// 0x28 (0x50 - 0x28)
// Class Pal.PalAICombatModule_Wild
class UPalAICombatModule_Wild : public UPalAICombatModule
{
public:
	uint8                                        Pad_29C0[0x28];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UPalAICombatModule_Wild* GetDefaultObj();

	void OnBattleFinish_forDelegate(class AActor* Actor);
	bool JudgeReturnCombatStartPosition();
};

// 0x168 (0x520 - 0x3B8)
// Class Pal.PalAIController
class APalAIController : public AAIController
{
public:
	TArray<class AActor*>                        TargetPlayers;                                     // 0x3B8(0x10)(BlueprintVisible, ZeroConstructor, Transient, NativeAccessSpecifierPublic)
	TArray<class AActor*>                        TargetNPCs;                                        // 0x3C8(0x10)(BlueprintVisible, ZeroConstructor, Transient, NativeAccessSpecifierPublic)
	TSubclassOf<class UPalAICombatModule>        CombatModuleClass;                                 // 0x3D8(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPalActiveSkillSlot*                   SkillSlot;                                         // 0x3E0(0x8)(BlueprintVisible, ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                DebugOrganizationName;                             // 0x3E8(0x10)(ZeroConstructor, Transient, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class APalCharacter*                         R1AttackTarget;                                    // 0x3F8(0x8)(BlueprintVisible, ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        MinAIActionComponentTickInterval;                  // 0x400(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_2A5F[0xC];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	bool                                         bIsActive;                                         // 0x410(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         IsSquadBehaviour;                                  // 0x411(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         IsNotSleepWildLife;                                // 0x412(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_2A60[0x5];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UPalSquad*                             MySquad;                                           // 0x418(0x8)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UPalHate*                              HateSystem;                                        // 0x420(0x8)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UPalAIActionComponent*                 AIActionComponent;                                 // 0x428(0x8)(Edit, ExportObject, ZeroConstructor, Transient, EditConst, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UPalAIBlackboardBase*                  PalAIBlackboard;                                   // 0x430(0x8)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_2A62[0x88];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	bool                                         bOverwriteBlockDetectionParams;                    // 0x4C0(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_2A63[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FPalPathFollowingBlockDetectionParams BlockDetectionParams;                              // 0x4C4(0xC)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPrivate)
	TSubclassOf<class UPalAIBlackboardBase>      PalBlackboardClass;                                // 0x4D0(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_2A64[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FTimerHandle                          DeadBodyDeleteTimerHandle;                         // 0x4E0(0x8)(Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         IsDeadBodyTimeDelate;                              // 0x4E8(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         IsSelfTimeDelate_FromSpawnTime;                    // 0x4E9(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_2A65[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FTimerHandle                          SelfDeleteTimerHandle;                             // 0x4F0(0x8)(Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_2A67[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	bool                                         bShouldCheckStuckByTick;                           // 0x4FC(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_2A68[0x23];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class APalAIController* GetDefaultObj();

	void WaitForSeconds(float Time);
	void SimpleMoveToActorWithLineTraceGround(class AActor* GoalActor);
	void ShowHateArrow();
	void ShowActionDebug();
	void SetInitialValue(bool IsSquad, bool NotSleep);
	void SetActiveAI(bool Active);
	void RPCDummy();
	enum class EPathFollowingRequestResult PalMoveToLocation(struct FVector& Dest, float AcceptanceRadius, bool bStopOnOverlap, bool bUsePathfinding, bool bProjectDestinationToNavigation, bool bCanStrafe, TSubclassOf<class UNavigationQueryFilter> FilterClass, bool bAllowPartialPaths);
	void OnDeadTimerStart(const struct FPalDeadInfo& Info);
	void OnChangedActiveCharacter(bool bActive);
	void OnChangeChangeImportance(enum class EPalCharacterImportanceType Next);
	void NotifyTalkStart(class APalPlayerCharacter* TalkPlayer);
	void NotifyTalkEnd(class APalPlayerCharacter* TalkPlayer);
	void MoveToLocation_ErrorSupportMove(const struct FVector& GoalLocation);
	void MoveToDirectly(const struct FVector& GoalLocation);
	bool IsOnNavMesh_TargetLocation(const struct FVector& TargetLocation);
	bool IsOnNavMesh();
	bool IsLeader();
	bool IsExistPathForLocation_ForBP_HeightRangeCheck(const struct FVector& Location, float AcceptanceRadius, float UpOffset, float DownOffset, struct FVector* OutGoalLocation);
	bool IsExistPathForLocation_ForBP(const struct FVector& Location, float AcceptanceRadius);
	bool IsActiveAI();
	class APalCharacter* GetSquadLeader();
	class UPalSquad* GetSquad();
	class UPalAIBlackboardBase* GetMyPalBlackboard();
	class UPalAIBlackboardBase* GetLeaderPalBlackboard();
	bool GetIsSquadBehaviour();
	bool GetIsnotSleepWildLife();
	class UPalHate* GetHateSystem();
	class UPalAIActionComponent* GetAIActionComponent();
	bool FindReachablePathLocation(const TArray<struct FVector>& RequestLocationArray, struct FVector* OutGoalLocation);
	bool FindNearestNavmeshPointFromSelf(struct FVector* OutLocation);
	void DeleteSelfDeadBody();
	void CreatePalBlackboard();
	class AActor* CopyTargetFromOtherAI(class AActor* FromAcotr);
	void AddTargetPlayer_ForEnemy(class AActor* PlayerOrPal);
	void AddTargetNPC(class AActor* NPC);
};

// 0x10 (0x38 - 0x28)
// Class Pal.PalAIControllerBaseCampStatus
class UPalAIControllerBaseCampStatus : public UObject
{
public:
	uint8                                        Pad_2A7B[0x10];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UPalAIControllerBaseCampStatus* GetDefaultObj();

	struct FGuid GetBaseCampId();
	class UPalBaseCampModel* GetBaseCamp();
};

// 0x0 (0x28 - 0x28)
// Class Pal.PalAIControllerWorkerModule
class UPalAIControllerWorkerModule : public UObject
{
public:

	static class UClass* StaticClass();
	static class UPalAIControllerWorkerModule* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class Pal.PalAIControllerWorkerModuleNormal
class UPalAIControllerWorkerModuleNormal : public UPalAIControllerWorkerModule
{
public:

	static class UClass* StaticClass();
	static class UPalAIControllerWorkerModuleNormal* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class Pal.PalAIControllerWorkerModuleBaseCamp
class UPalAIControllerWorkerModuleBaseCamp : public UPalAIControllerWorkerModule
{
public:

	static class UClass* StaticClass();
	static class UPalAIControllerWorkerModuleBaseCamp* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class Pal.PalAIControllerWorkerInterface
class IPalAIControllerWorkerInterface : public IInterface
{
public:

	static class UClass* StaticClass();
	static class IPalAIControllerWorkerInterface* GetDefaultObj();

	TSubclassOf<class UPalAIControllerWorkerModule> GetWorkerModuleClass();
};

// 0x0 (0xA0 - 0xA0)
// Class Pal.PalAIDamageReactionComponent
class UPalAIDamageReactionComponent : public UActorComponent
{
public:

	static class UClass* StaticClass();
	static class UPalAIDamageReactionComponent* GetDefaultObj();

	void FunctionTest();
};

// 0x8 (0x30 - 0x28)
// Class Pal.PalAIResponsePreset
class UPalAIResponsePreset : public UObject
{
public:
	enum class EPalAIResponseType                Discover_Player;                                   // 0x28(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EPalAIResponseType                Discover_Greater;                                  // 0x29(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EPalAIResponseType                Discover_Equal;                                    // 0x2A(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EPalAIResponseType                Discover_Smaller;                                  // 0x2B(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EPalAIResponseType                Damaged_Player;                                    // 0x2C(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EPalAIResponseType                Damaged_Greater;                                   // 0x2D(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EPalAIResponseType                Damaged_Equal;                                     // 0x2E(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EPalAIResponseType                Damaged_Smaller;                                   // 0x2F(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UPalAIResponsePreset* GetDefaultObj();

};

// 0x98 (0x138 - 0xA0)
// Class Pal.PalAISensorComponent
class UPalAISensorComponent : public UActorComponent
{
public:
	class AActor*                                SelfPawn;                                          // 0xA0(0x8)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        SightAngleThreshold;                               // 0xA8(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        SightDistance;                                     // 0xAC(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        HearingRate;                                       // 0xB0(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         HumanAndNoneWeapon;                                // 0xB4(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         IsIgnoreSoundReaction;                             // 0xB5(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_2AAE[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        RecentMaxSoundLevel;                               // 0xB8(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_2AB0[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        ResponsedMaxBiologicalGrade;                       // 0xC4(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UPalAIResponsePreset*                  AIResponsePreset;                                  // 0xC8(0x8)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UPalAISightResponse*                   AISightResponse;                                   // 0xD0(0x8)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FFlagContainer                        DisableSightFlag;                                  // 0xD8(0x50)(Edit, DisableEditOnTemplate, Transient, EditConst, NativeAccessSpecifierPrivate)
	FMulticastInlineDelegateProperty_            OnFReceiveSoundDelegate;                           // 0x128(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UPalAISensorComponent* GetDefaultObj();

	void SightCheckAllPlayer(TArray<class APalCharacter*>* InSightPlayers, float RangeRate);
	void SightCheckAllEdibleDeadNPC(TArray<class APalCharacter*>* InSightCharacters);
	void SightCheckAllAliveNPC(TArray<class APalCharacter*>* InSightCharacters);
	void Setup();
	void SetDisableSightFlag(class FName FlagName, bool IsDisable);
	void SetDebugAIResponse(TSubclassOf<class UPalAIResponsePreset> PresetClass);
	enum class EPalAIResponseType SelectResponseBySenses(enum class EPalAIResponseType CurrentBehavior, TArray<class APalCharacter*>& FindCharacters, bool IsDamaged, class APalCharacter** OutTargetCharacter);
	void ResetResponsedMaxBiologicalGrade();
	void ReceiveSoundDelegate__DelegateSignature(const struct FVector& EmitLocation);
	void ReceiveSound(int32 SoundRadius, const struct FVector& EmitLocation, class AActor* Emitter);
	void OnResponseSpecialLookat();
	class APalCharacter* MaximumStrengthEnemy(TArray<class APalCharacter*>& FindCharacters, enum class EPalBiologicalGradeComparedResult* Result);
	bool IsInSightKillerAndDeadBody(class AActor* Killer, class AActor* DeadBody);
	void EnableHearing();
	void DisableHearing();
	void DeadAutoRemoveDelegate(const struct FPalDeadInfo& DeadInfo);
};

// 0xB0 (0xD8 - 0x28)
// Class Pal.PalAISightResponsePreset
class UPalAISightResponsePreset : public UObject
{
public:
	TMap<enum class EPalAISightJudgementType, TSubclassOf<class UPalAIActionBase>> AIActionMap;                                       // 0x28(0x50)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, UObjectWrapper, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            AimedByPlayerDelegate;                             // 0x78(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMap<enum class EPalAISightJudgementType, FMulticastInlineDelegateProperty_> DelegateMap;                                       // 0x88(0x50)(Transient, ContainsInstancedReference, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UPalAISightResponsePreset* GetDefaultObj();

	void FindDelegate__DelegateSignature(class APalCharacter* SelfCharacter, class APalCharacter* FoundCharacter);
	void BlueprintDelegateSetup();
};

// 0x0 (0x28 - 0x28)
// Class Pal.PalAISightResponseTransitionableInterface
class IPalAISightResponseTransitionableInterface : public IInterface
{
public:

	static class UClass* StaticClass();
	static class IPalAISightResponseTransitionableInterface* GetDefaultObj();

	void GetTransitionableJudgementType(TArray<enum class EPalAISightJudgementType>* JudgeTypeList);
};

// 0x58 (0x80 - 0x28)
// Class Pal.PalAISightResponse
class UPalAISightResponse : public UObject
{
public:
	class UPalAISightResponsePreset*             SightResponsePreset;                               // 0x28(0x8)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_2AD4[0x50];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UPalAISightResponse* GetDefaultObj();

};

// 0x8 (0x490 - 0x488)
// Class Pal.PalAkComponent
class UPalAkComponent : public UAkComponent
{
public:
	bool                                         PersistAcrossLevelTransition;                      // 0x488(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_2AD5[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UPalAkComponent* GetDefaultObj();

};

// 0x30 (0x2C0 - 0x290)
// Class Pal.PalAmbientSoundAreaBase
class APalAmbientSoundAreaBase : public AActor
{
public:
	int32                                        AmbientPriority;                                   // 0x290(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_2ADE[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class UAkAudioEvent*>                 DayAmbientEvents;                                  // 0x298(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TArray<class UAkAudioEvent*>                 NightAmbientEvents;                                // 0x2A8(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	bool                                         bIsOverlappedLocalPlayer;                          // 0x2B8(0x1)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_2ADF[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class APalAmbientSoundAreaBase* GetDefaultObj();

	void OnEndOverlap(class UPrimitiveComponent* OverlappedComponent, class APalPlayerCharacter* PlayerCharacter);
	void OnBeginOverlap(class UPrimitiveComponent* OverlappedComponent, class APalPlayerCharacter* PlayerCharacter);
	class UPrimitiveComponent* GetAreaCollision();
	struct FPalAmbientSoundAreaData GetAmbientSoundAreaData();
};

// 0x18 (0x2A8 - 0x290)
// Class Pal.PalAmbientSoundLineBase
class APalAmbientSoundLineBase : public AActor
{
public:
	class UAkComponent*                          AkComponent;                                       // 0x290(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UBoxComponent*                         ActivateTrigger;                                   // 0x298(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPalAmbientSoundLineObject*            AmbinetSoundLineObject;                            // 0x2A0(0x8)(ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class APalAmbientSoundLineBase* GetDefaultObj();

};

// 0x28 (0x5A0 - 0x578)
// Class Pal.PalAmbientSoundLineComponent
class UPalAmbientSoundLineComponent : public UBoxComponent
{
public:
	class UAkAudioEvent*                         AmbientEvent;                                      // 0x578(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIsEnableAmbientSound;                             // 0x580(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2AEA[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UPalAmbientSoundLineObject*            AmbinetSoundLineObject;                            // 0x588(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAkComponent*                          AkComponent;                                       // 0x590(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_2AEC[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UPalAmbientSoundLineComponent* GetDefaultObj();

};

// 0x28 (0x50 - 0x28)
// Class Pal.PalAmbientSoundLineObject
class UPalAmbientSoundLineObject : public UObject
{
public:
	uint8                                        Pad_2AF9[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class USplineComponent*>              SplineComponents;                                  // 0x30(0x10)(ExportObject, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	class UBoxComponent*                         ActivateTrigger;                                   // 0x40(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAkComponent*                          AkComponent;                                       // 0x48(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UPalAmbientSoundLineObject* GetDefaultObj();

	void OnActivateTriggerOverlapBegin(class UPrimitiveComponent* OverlappedComp, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, struct FHitResult& SweepResult);
	void OnActivateTriggerLineOverlapEnd(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
};

// 0x2C8 (0x610 - 0x348)
// Class Pal.PalAnimInstance
class UPalAnimInstance : public UAnimInstance
{
public:
	FMulticastInlineDelegateProperty_            OnMontageNotifyBeginDelegate;                      // 0x348(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnMontageNotifyEndDelegate;                        // 0x358(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TArray<TSubclassOf<class UAnimInstance>>     ImplementationClassList;                           // 0x368(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, UObjectWrapper, NativeAccessSpecifierPublic)
	struct FGeneralAnimationParameter            GeneralAnimationParameter;                         // 0x378(0x168)(BlueprintVisible, BlueprintReadOnly, Transient, Protected, NativeAccessSpecifierProtected)
	bool                                         IsRotateYawInterpolation;                          // 0x4E0(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_2B71[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        RotateYawInterpolation_Acceleration;               // 0x4E4(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TMap<class FName, class UPalBoneInfo*>       BoneListFullBody;                                  // 0x4E8(0x50)(Transient, NativeAccessSpecifierPrivate)
	TMap<class FName, class UPalBoneInfo*>       BoneListOnlySpines;                                // 0x538(0x50)(Transient, NativeAccessSpecifierPrivate)
	TArray<struct FReserveMontage>               ReservedMontageList;                               // 0x588(0x10)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	uint8                                        Pad_2B76[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FFloatContainer                       AdditiveAnimationRate;                             // 0x5A0(0x10)(Transient, NativeAccessSpecifierPrivate)
	uint8                                        Pad_2B77[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FFlagContainer                        DisableUpperOverrideFlag;                          // 0x5B8(0x50)(Edit, Transient, DisableEditOnInstance, EditConst, NativeAccessSpecifierPrivate)
	uint8                                        Pad_2B78[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UPalAnimInstance* GetDefaultObj();

	void SetUpperOverrideDisableFlag(class FName FlagName, bool IsDisable);
	void SetAdditiveAnimationRate(class FName FlagName, float Rate);
	void OnNotifyEndReceived(class FName NotifyName, struct FBranchingPointNotifyPayload& BranchingPointNotifyPayload);
	void OnNotifyBeginReceived(class FName NotifyName, struct FBranchingPointNotifyPayload& BranchingPointNotifyPayload);
	void OnMontageNotifyEnd__DelegateSignature(class UAnimMontage* Montage, class FName NotifyName);
	void OnMontageNotifyBegin__DelegateSignature(class UAnimMontage* Montage, class FName NotifyName);
	void OnMontageEndedCallback(class UAnimMontage* Montage, bool bInterrupted);
	void Montage_PlayList(const TArray<struct FReserveMontage>& MontageList);
	class FName GetNearBoneInSpines(const struct FVector& FromPos);
	class FName GetNearBoneInFullBody(const struct FVector& FromPos);
	float GetCurrentMontagePlayTimeToEnd();
	struct FTransform GetBoneTransform(class FName BoneName);
	struct FQuat GetBoneRotationComponentSpace(class FName BoneName);
	struct FQuat GetBoneRotation(class FName BoneName);
	struct FVector GetBonePosition(class FName BoneName);
	class UPalBoneInfo* GetBoneInfo(class FName BoneName);
	void CalcLength(class FName Target, class FName NextBone, float TipLength);
	void BodyInstance_SetSimulate(class FName BoneName, bool SimulateActive);
	void AddSpinesListFromBoneList(class FName BoneName);
	void AddList(class FName BoneName);
};

// 0x8 (0x30 - 0x28)
// Class Pal.PalAnimNotifyDynamicParameterBase
class UPalAnimNotifyDynamicParameterBase : public UObject
{
public:
	uint8                                        Pad_2B80[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UPalAnimNotifyDynamicParameterBase* GetDefaultObj();

};

// 0x30 (0x60 - 0x30)
// Class Pal.PalAnimNotifyDynamicParameterAttackCollision
class UPalAnimNotifyDynamicParameterAttackCollision : public UPalAnimNotifyDynamicParameterBase
{
public:
	class UPalHitFilter*                         AttackFilter;                                      // 0x30(0x8)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UShapeComponent*>               TransientShapeComponents;                          // 0x38(0x10)(ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, NativeAccessSpecifierPublic)
	float                                        HitStopCount;                                      // 0x48(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2B86[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class USkeletalMeshComponent*                MyMesh;                                            // 0x50(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                MyActor;                                           // 0x58(0x8)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UPalAnimNotifyDynamicParameterAttackCollision* GetDefaultObj();

};

// 0x50 (0x80 - 0x30)
// Class Pal.PalAnimNotifyDynamicParameterAvoidTime
class UPalAnimNotifyDynamicParameterAvoidTime : public UPalAnimNotifyDynamicParameterBase
{
public:
	TMap<class UPrimitiveComponent*, enum class ECollisionResponse> AttackResponseMap;                                 // 0x30(0x50)(Transient, ContainsInstancedReference, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UPalAnimNotifyDynamicParameterAvoidTime* GetDefaultObj();

};

// 0x50 (0xF0 - 0xA0)
// Class Pal.PalAnimNotifyParameterComponent
class UPalAnimNotifyParameterComponent : public UActorComponent
{
public:
	TMap<class FString, class UPalAnimNotifyDynamicParameterBase*> DynamicParameterMap;                               // 0xA0(0x50)(Transient, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UPalAnimNotifyParameterComponent* GetDefaultObj();

};

// 0x30 (0x60 - 0x30)
// Class Pal.PalAnimNotifyState_AttackCollision
class UPalAnimNotifyState_AttackCollision : public UAnimNotifyState
{
public:
	class FName                                  AttachBoneName;                                    // 0x30(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIsEnableHitStop;                                  // 0x38(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2BB0[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        OverrideHitStopTime;                               // 0x3C(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPalHitFilter*                         AttackFilter;                                      // 0x40(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UShapeComponent*                       ShapeComponent;                                    // 0x48(0x8)(ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, Deprecated, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UShapeComponent*>               ShapeComponents;                                   // 0x50(0x10)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UPalAnimNotifyState_AttackCollision* GetDefaultObj();

	void OnHit(class UPrimitiveComponent* MyHitComponent, class AActor* HitActor, class UPrimitiveComponent* HitComponent, TArray<int32>& FoliageIndex, const struct FVector& HitLocation, int32 HitCount);
};

// 0xA0 (0xD0 - 0x30)
// Class Pal.PalAnimNotifyState_AvoidTime
class UPalAnimNotifyState_AvoidTime : public UAnimNotifyState
{
public:
	TMap<class UPrimitiveComponent*, enum class ECollisionResponse> AttackResponseMap;                                 // 0x30(0x50)(BlueprintReadOnly, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	TMap<class UPrimitiveComponent*, enum class ECollisionResponse> BulletResponseMap;                                 // 0x80(0x50)(BlueprintReadOnly, ContainsInstancedReference, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UPalAnimNotifyState_AvoidTime* GetDefaultObj();

};

// 0x50 (0xC8 - 0x78)
// Class Pal.PalAnimNotifyState_Effect
class UPalAnimNotifyState_Effect : public UAnimNotifyState_TimedNiagaraEffect
{
public:
	TMap<class FName, float>                     UserParameterMap;                                  // 0x78(0x50)(Edit, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UPalAnimNotifyState_Effect* GetDefaultObj();

};

// 0x8 (0x38 - 0x30)
// Class Pal.PalAnimNotifyState_FacialEye
class UPalAnimNotifyState_FacialEye : public UAnimNotifyState
{
public:
	enum class EPalFacialEyeType                 EyeType;                                           // 0x30(0x1)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         AutoDefaultWhenEnd;                                // 0x31(0x1)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2BCA[0x6];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UPalAnimNotifyState_FacialEye* GetDefaultObj();

};

// 0x8 (0x38 - 0x30)
// Class Pal.PalAnimNotifyState_FacialMouth
class UPalAnimNotifyState_FacialMouth : public UAnimNotifyState
{
public:
	enum class EPalFacialMouthType               MouthType;                                         // 0x30(0x1)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         AutoDefaultWhenEnd;                                // 0x31(0x1)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2BCE[0x6];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UPalAnimNotifyState_FacialMouth* GetDefaultObj();

};

// 0x8 (0x38 - 0x30)
// Class Pal.PalAnimNotifyState_FlyMeshHeight
class UPalAnimNotifyState_FlyMeshHeight : public UAnimNotifyState
{
public:
	bool                                         IsToLand;                                          // 0x30(0x1)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2BCF[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UPalAnimNotifyState_FlyMeshHeight* GetDefaultObj();

};

// 0x0 (0x30 - 0x30)
// Class Pal.PalAnimNotifyState_HidePalWeapon
class UPalAnimNotifyState_HidePalWeapon : public UAnimNotifyState
{
public:

	static class UClass* StaticClass();
	static class UPalAnimNotifyState_HidePalWeapon* GetDefaultObj();

};

// 0x0 (0x30 - 0x30)
// Class Pal.PalAnimNotifyState_LookAtDisable
class UPalAnimNotifyState_LookAtDisable : public UAnimNotifyState
{
public:

	static class UClass* StaticClass();
	static class UPalAnimNotifyState_LookAtDisable* GetDefaultObj();

};

// 0x20 (0x50 - 0x30)
// Class Pal.PalAnimNotifyState_MovementControl
class UPalAnimNotifyState_MovementControl : public UAnimNotifyState
{
public:
	float                                        MovementSpeedRate;                                 // 0x30(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        AirControlXYRate;                                  // 0x34(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        YawRotatorRate;                                    // 0x38(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        GravityRate;                                       // 0x3C(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        FixedGravityZ;                                     // 0x40(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        SlideAlpha;                                        // 0x44(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIsDisableMovement;                                // 0x48(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIsDisableJump;                                    // 0x49(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2BDD[0x6];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UPalAnimNotifyState_MovementControl* GetDefaultObj();

};

// 0x8 (0x38 - 0x30)
// Class Pal.PalAnimNotifyState_WeaponControl
class UPalAnimNotifyState_WeaponControl : public UAnimNotifyState
{
public:
	bool                                         bIsDisableShoot;                                   // 0x30(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIsDisableAim;                                     // 0x31(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIsDisableAttachLeftHand;                          // 0x32(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIsDisableReload;                                  // 0x33(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIsDisableChangeWeapon;                            // 0x34(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EPalShooterFlagContainerPriority  Priority;                                          // 0x35(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2BE0[0x2];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UPalAnimNotifyState_WeaponControl* GetDefaultObj();

};

// 0x8 (0x40 - 0x38)
// Class Pal.PalAnimNotify_FacialEye
class UPalAnimNotify_FacialEye : public UAnimNotify
{
public:
	enum class EPalFacialEyeType                 EyeType;                                           // 0x38(0x1)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2BE9[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UPalAnimNotify_FacialEye* GetDefaultObj();

};

// 0x8 (0x40 - 0x38)
// Class Pal.PalAnimNotify_FacialMouth
class UPalAnimNotify_FacialMouth : public UAnimNotify
{
public:
	enum class EPalFacialMouthType               MouthType;                                         // 0x38(0x1)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2BED[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UPalAnimNotify_FacialMouth* GetDefaultObj();

};

// 0x38 (0x70 - 0x38)
// Class Pal.PalAnimNotify_FootStep
class UPalAnimNotify_FootStep : public UAnimNotify
{
public:
	TSoftClassPtr<class UPalFootStepEffectAssetBase> DefaultEffectAssetClass;                           // 0x38(0x30)(Edit, BlueprintReadOnly, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPalFootStepEffectAssetBase*           EffectAssetCache;                                  // 0x68(0x8)(BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UPalAnimNotify_FootStep* GetDefaultObj();

	void SpawnFootStepEffect(class UObject* WorldObject, enum class EPalLandingType LandingType, enum class EPhysicalSurface PhysicalSurface, struct FVector& Location, struct FRotator& Rotation, class UPalStaticCharacterParameterComponent* StaticParam);
	void SpawnFootStepDecal(class AActor* Owner, enum class EPhysicalSurface PhysicalSurface, enum class EPalFootType FootType, const struct FVector& Location, const struct FVector& CurrentNormal, float LifeSpan, float FadeTime);
	bool GetFloorPosition(class AActor* Owner, const struct FTransform& FootTransform, struct FHitResult* HitResult);
};

// 0x50 (0x120 - 0xD0)
// Class Pal.PalAnimNotify_PlayNiagaraEffect
class UPalAnimNotify_PlayNiagaraEffect : public UAnimNotify_PlayNiagaraEffect
{
public:
	TMap<class FName, float>                     UserParameterMap;                                  // 0xD0(0x50)(Edit, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UPalAnimNotify_PlayNiagaraEffect* GetDefaultObj();

};

// 0x0 (0x38 - 0x38)
// Class Pal.PalAnimNotify_RequestJump
class UPalAnimNotify_RequestJump : public UAnimNotify
{
public:

	static class UClass* StaticClass();
	static class UPalAnimNotify_RequestJump* GetDefaultObj();

};

// 0x28 (0x60 - 0x38)
// Class Pal.PalAnimNotify_RequestRideShakeAnimation
class UPalAnimNotify_RequestRideShakeAnimation : public UAnimNotify
{
public:
	float                                        ApplyRate;                                         // 0x38(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        PlaySpeedRate;                                     // 0x3C(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIsAdjustAnimationSpeed;                           // 0x40(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2C19[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TWeakObjectPtr<class APalCharacter>          CacheCharacter;                                    // 0x44(0x8)(BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_2C1B[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<float>                                RateList;                                          // 0x50(0x10)(BlueprintReadOnly, ZeroConstructor, Transient, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UPalAnimNotify_RequestRideShakeAnimation* GetDefaultObj();

	void OnStartAim();
	void OnEndMotion(class UAnimMontage* Montage, bool bInterrupted);
};

// 0x8 (0x40 - 0x38)
// Class Pal.PalAnimNotify_SendActionEvent
class UPalAnimNotify_SendActionEvent : public UAnimNotify
{
public:
	enum class EPalCurrentActionNotifyType       NotifyType;                                        // 0x38(0x1)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2C1E[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UPalAnimNotify_SendActionEvent* GetDefaultObj();

};

// 0x38 (0x70 - 0x38)
// Class Pal.PalAnimNotify_SpawnActor
class UPalAnimNotify_SpawnActor : public UAnimNotify
{
public:
	TSubclassOf<class AActor>                    SpawnActorClass;                                   // 0x38(0x8)(Edit, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                               SpawnLocationOffset;                               // 0x40(0x18)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                              SpawnRotationOffset;                               // 0x58(0x18)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UPalAnimNotify_SpawnActor* GetDefaultObj();

};

// 0x0 (0x38 - 0x38)
// Class Pal.PalAnimNotify_StaminaMeleeAttack
class UPalAnimNotify_StaminaMeleeAttack : public UAnimNotify
{
public:

	static class UClass* StaticClass();
	static class UPalAnimNotify_StaminaMeleeAttack* GetDefaultObj();

};

// 0x8 (0x40 - 0x38)
// Class Pal.PalAnimNotify_WeaponNotify
class UPalAnimNotify_WeaponNotify : public UAnimNotify
{
public:
	enum class EWeaponNotifyType                 WeaponNotifyType;                                  // 0x38(0x1)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2C27[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UPalAnimNotify_WeaponNotify* GetDefaultObj();

};

// 0x38 (0x60 - 0x28)
// Class Pal.PalAssetStreamableManager
class UPalAssetStreamableManager : public UObject
{
public:
	uint8                                        Pad_2C28[0x38];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UPalAssetStreamableManager* GetDefaultObj();

};

// 0x130 (0x158 - 0x28)
// Class Pal.PalHitFilter
class UPalHitFilter : public UObject
{
public:
	uint8                                        Pad_2C4F[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        MaxHitNum;                                         // 0x30(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        HitInterval;                                       // 0x34(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UPalHitLocationCalculator> HitLocationCalculator;                             // 0x38(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIsIntersectionCollision;                          // 0x40(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2C53[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        IntersectionNum;                                   // 0x44(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	FMulticastInlineDelegateProperty_            OnHitDelegate;                                     // 0x48(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnOverlapEndDelegate;                              // 0x58(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                        Pad_2C54[0xF0];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UPalHitFilter* GetDefaultObj();

	void UnbindPrimitiveComponent(class UPrimitiveComponent* Component);
	void SetIntersectionNum(int32 Num);
	void SetAttacker(class AActor* Attacker);
	void ResetFilter();
	void OverlapEndDelegate__DelegateSignature(class UPrimitiveComponent* MyHitComponent, class AActor* OtherHitActor, class UPrimitiveComponent* OtherHitComponent);
	void OnHitDelegate__DelegateSignature(class UPrimitiveComponent* MyHitComponent, class AActor* OtherHitActor, class UPrimitiveComponent* OtherHitComponent, TArray<int32>& FoliageIndex, const struct FVector& HitLocation, int32 HitCount);
	void OnEndOverlap(class UPrimitiveComponent* OverlappedComp, class AActor* Other, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void OnBeginOverlap(class UPrimitiveComponent* HitComp, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, struct FHitResult& Hit);
	void BindPrimitiveComponent(class UPrimitiveComponent* Component);
};

// 0x40 (0x198 - 0x158)
// Class Pal.PalAttackFilter
class UPalAttackFilter : public UPalHitFilter
{
public:
	FMulticastInlineDelegateProperty_            OnAttackDelegate;                                  // 0x158(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	enum class EPalWazaID                        Waza;                                              // 0x168(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EPalBlowVelocityOwner             VelocityOwner;                                     // 0x169(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2C5C[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               NativeBlowVelocity;                                // 0x170(0x18)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        WazaPowerRate;                                     // 0x188(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2C5E[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class AActor*                                Attacker;                                          // 0x190(0x8)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UPalAttackFilter* GetDefaultObj();

};

// 0xA8 (0xD0 - 0x28)
// Class Pal.PalAudioSettingSystem
class UPalAudioSettingSystem : public UObject
{
public:
	uint8                                        Pad_2C81[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TMap<enum class EPalAudioBus, struct FFloatContainer> BusVolumeMap;                                      // 0x30(0x50)(Protected, NativeAccessSpecifierProtected)
	TMap<enum class EPalAudioBus, struct FPalAudioFadeParameter> BussFadeMap;                                       // 0x80(0x50)(Protected, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UPalAudioSettingSystem* GetDefaultObj();

	void Tick_BP(float DeltaTime);
	void StartAudioFade(enum class EPalAudioBus AudioBus, enum class EPalAudioFadeType FadeType, bool bImmediately);
	void SetAudioBusVolume(enum class EPalAudioBus AudioBus, class FName& Key, float Volume);
	void SetAudioBusMute(enum class EPalAudioBus AudioBus, bool IsMute);
	class FString PalAudioBusToString(enum class EPalAudioBus AudioBus);
	bool IsAudioBusMute(enum class EPalAudioBus AudioBus);
	void Initialize();
	float GetAudioBusVolume(enum class EPalAudioBus AudioBus);
};

// 0x0 (0x28 - 0x28)
// Class Pal.PalAudioUtility
class UPalAudioUtility : public UBlueprintFunctionLibrary
{
public:

	static class UClass* StaticClass();
	static class UPalAudioUtility* GetDefaultObj();

	void OnPlayerExitSpot(class UObject* WorldContextObject, class APalPlayerCharacter* Player, class APalSpotAreaBase* SpotArea);
	void OnPlayerExitBaseCamp(class UObject* WorldContextObject, class APalPlayerCharacter* Player, class UPalBaseCampModel* BaseCampModel);
	void OnPlayerExitAmbientArea(class UObject* WorldContextObject, class APalPlayerCharacter* Player, class APalAmbientSoundAreaBase* SpotArea);
	void OnPlayerEnterSpot(class UObject* WorldContextObject, class APalPlayerCharacter* Player, class APalSpotAreaBase* SpotArea);
	void OnPlayerEnterBaseCamp(class UObject* WorldContextObject, class APalPlayerCharacter* Player, class UPalBaseCampModel* BaseCampModel);
	void OnPlayerEnterAmbientArea(class UObject* WorldContextObject, class APalPlayerCharacter* Player, class APalAmbientSoundAreaBase* SpotArea);
};

// 0x10 (0x80 - 0x70)
// Class Pal.PalAudioWorldSubsystem
class UPalAudioWorldSubsystem : public UPalWorldSubsystem
{
public:
	int32                                        FadeDuration;                                      // 0x70(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_2CEA[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UPalSoundPlayer*                       SoundPlayer;                                       // 0x78(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UPalAudioWorldSubsystem* GetDefaultObj();

	void Tick_BP(float DeltaTime);
	void StopSound();
	void SetSwitch(const class FString& SwitchGroup, const class FString& SwitchState);
	void SetStateFlagByName(class FName StateGroup, bool Flg);
	void SetStateFlagByEnum(enum class EPalAudioStateGroup StateGroup, bool Flg);
	void SetStateByName(class FName StateGroup, class FName State);
	void SetStateByEnum(enum class EPalAudioStateGroup StateGroup, enum class EPalAudioState State);
	void SetSoundPlayerLocation(struct FVector& Location);
	void SetRTPCValueByName(class FName& Name, float Value, float InterpolSec);
	void SetRTPCValueByEnum(enum class EPalAudioRTPC RTPC, float Value, float InterpolSec);
	void SetOutputBusVolume(float Volume);
	void PostTriggerByString(const class FString& Trigger);
	void PostTriggerByEnum(enum class EPalAudioTrigger Trigger);
	int32 PlaySound(class UAkAudioEvent* AudioEvent, struct FPalSoundOptions& Options);
	void OnSpawnedLocalPlayerCharacter(class APawn* Pawn, class AController* Controller);
	void OnPlayerExitSpotArea(class APalPlayerCharacter* Player, class APalSpotAreaBase* SpotArea);
	void OnPlayerExitBaseCamp(class APalPlayerCharacter* Player, class UPalBaseCampModel* BaseCampModel);
	void OnPlayerExitAmbientArea(class APalPlayerCharacter* Player, class APalAmbientSoundAreaBase* AmbientSoundArea);
	void OnPlayerEnterSpotArea(class APalPlayerCharacter* Player, class APalSpotAreaBase* SpotArea);
	void OnPlayerEnterBaseCamp(class APalPlayerCharacter* Player, class UPalBaseCampModel* BaseCampModel);
	void OnPlayerEnterAmbientArea(class APalPlayerCharacter* Player, class APalAmbientSoundAreaBase* AmbientSoundArea);
	void OnEndOfEvent();
	void OnAkPostEventCallback(enum class EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo);
	void InitializeSystem(class AActor* AkOwnerActor);
	void GetSoundPlayerLocation(struct FVector* OutLocation);
	void FadeOutByPlayingId(int32 PlayingID);
	void BeginPlay();
};

// 0x10 (0x38 - 0x28)
// Class Pal.PalAutoDestroyActorHolder
class UPalAutoDestroyActorHolder : public UObject
{
public:
	TArray<TWeakObjectPtr<class AActor>>         HoldActors;                                        // 0x28(0x10)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UPalAutoDestroyActorHolder* GetDefaultObj();

	void AddActor(class AActor* TargetActor);
};

// 0x58 (0x2E8 - 0x290)
// Class Pal.PalBackWeaponBase
class APalBackWeaponBase : public AActor
{
public:
	bool                                         InFirstOrSecondSlot;                               // 0x290(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         IsEquipHand;                                       // 0x291(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_2D16[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FFlagContainer                        HiddenBackWeapon;                                  // 0x298(0x50)(Edit, DisableEditOnTemplate, Transient, EditConst, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class APalBackWeaponBase* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class Pal.PalBaseCampAssignableObjectInterface
class IPalBaseCampAssignableObjectInterface : public IInterface
{
public:

	static class UClass* StaticClass();
	static class IPalBaseCampAssignableObjectInterface* GetDefaultObj();

	TScriptInterface<class IPalMapObjectModelInterface> ToMapObjectModel();
	enum class EPalBaseCampAssignType GetAssignType();
};

// 0x0 (0x28 - 0x28)
// Class Pal.PalBaseCampWorkerDirectionBattleTypeUtility
class UPalBaseCampWorkerDirectionBattleTypeUtility : public UBlueprintFunctionLibrary
{
public:

	static class UClass* StaticClass();
	static class UPalBaseCampWorkerDirectionBattleTypeUtility* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class Pal.PalBaseCampModuleTransportItemRequirerInterface
class IPalBaseCampModuleTransportItemRequirerInterface : public IInterface
{
public:

	static class UClass* StaticClass();
	static class IPalBaseCampModuleTransportItemRequirerInterface* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class Pal.PalBaseCampModuleTransportItemDepotInterface
class IPalBaseCampModuleTransportItemDepotInterface : public IInterface
{
public:

	static class UClass* StaticClass();
	static class IPalBaseCampModuleTransportItemDepotInterface* GetDefaultObj();

};

// 0x78 (0xA0 - 0x28)
// Class Pal.PalBaseCampEnemyObserver
class UPalBaseCampEnemyObserver : public UObject
{
public:
	FMulticastInlineDelegateProperty_            OnFirstAppearEnemyDelegate;                        // 0x28(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnEmptyEnemyDelegate;                              // 0x38(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnPassedTimeAfterEmptyEnemyDelegate;               // 0x48(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	struct FGuid                                 BaseCampId;                                        // 0x58(0x10)(Edit, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class UPalIndividualCharacterHandle*> EnemyList;                                         // 0x68(0x10)(Edit, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, NativeAccessSpecifierPrivate)
	float                                        CampAreaRange;                                     // 0x78(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_2D46[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               CampLocation;                                      // 0x80(0x18)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_2D47[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UPalBaseCampEnemyObserver* GetDefaultObj();

	void OnEndPlayEnemy(class AActor* Actor, enum class EEndPlayReason EndPlayReason);
	void OnDeadEnemy(const struct FPalDeadInfo& DeadInfo);
	bool IsBattleMode();
	void BaseCampEnemyDelegate__DelegateSignature();
};

// 0x0 (0x28 - 0x28)
// Class Pal.PalBaseCampFunctionModuleBase
class UPalBaseCampFunctionModuleBase : public UObject
{
public:

	static class UClass* StaticClass();
	static class UPalBaseCampFunctionModuleBase* GetDefaultObj();

};

// 0x1D0 (0x240 - 0x70)
// Class Pal.PalBaseCampManager
class UPalBaseCampManager : public UPalWorldSubsystem
{
public:
	uint8                                        Pad_2D93[0x30];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	class FName                                  WorkerEventClassDirectoryPath;                     // 0xA0(0x8)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class AController>               BaseCampAIControllerClass;                         // 0xA8(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        WorkerCapacityNumDefault;                          // 0xB0(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_2D96[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FString                                WorkableBoundShapeName;                            // 0xB8(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        DisplayCapacityNum;                                // 0xC8(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_2D97[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FDataTableRowHandle                   WarningSanityValueTextId;                          // 0xD0(0x10)(Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_2D98[0x50];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	TMap<enum class EPalBaseCampWorkerEventType, class UPalBaseCampWorkerEventBase*> WorkerEventMap;                                    // 0x130(0x50)(Edit, DisableEditOnTemplate, Transient, EditConst, NativeAccessSpecifierPrivate)
	class UDataTable*                            WorkerEventMasterDataTable;                        // 0x180(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UDataTable*                            WorkerSickMasterDataTable;                         // 0x188(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                        WorkerEventTriggerTickMaxCount;                    // 0x190(0x4)(Edit, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_2D9A[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<TSubclassOf<class UPalAIActionBaseCampDefenseBase>> DefenseAIActionArray;                              // 0x198(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, UObjectWrapper, NativeAccessSpecifierPrivate)
	TArray<struct FPalBaseCampSignificanceInfo>  BaseCampSignificanceInfoList;                      // 0x1A8(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	float                                        UpdateIntervalSquaredDistanceFromPlayer;           // 0x1B8(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_2D9B[0x14];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	struct FTransform                            SpawnPointInBaseCampPointSubLocalTransform;        // 0x1D0(0x60)(Edit, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                        BaseCampTickInvokeMaxNumInOneTick;                 // 0x230(0x4)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_2D9C[0xC];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UPalBaseCampManager* GetDefaultObj();

	bool TryGetModel(struct FGuid& BaseCampId, class UPalBaseCampModel** OutModel);
	void RequestDismantalDistanceBaseCamp(struct FGuid& InstanceId);
	void OnUpdateLocationWork_ServerInternal(class UPalWorkBase* Work);
	void OnUnregisteredWork_ServerInternal(class UPalWorkBase* Work);
	void OnRegisteredNewWork_ServerInternal(class UPalWorkBase* Work);
	void OnCreateMapObjectModelInServer(class UPalMapObjectModel* CreatedModel, struct FVector& Location);
	class UPalBaseCampModel* GetNearestBaseCamp(struct FVector& Location);
	class UPalBaseCampModel* GetInRangedBaseCamp(struct FVector& Location, float Margin);
	void GetBaseCampIds(TArray<struct FGuid>* OutIds);
};

// 0x50 (0x78 - 0x28)
// Class Pal.PalBaseCampMapObjectCollection
class UPalBaseCampMapObjectCollection : public UObject
{
public:
	FMulticastInlineDelegateProperty_            OnRegisteredMapObjectInstance;                     // 0x28(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnAvailableConcreteModelDelegate;                  // 0x38(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnNotAvailableConcreteModelDelegate;               // 0x48(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TArray<struct FGuid>                         MapObjectInstanceIds;                              // 0x58(0x10)(Edit, Net, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, NativeAccessSpecifierPrivate)
	uint8                                        Pad_2DB3[0x10];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UPalBaseCampMapObjectCollection* GetDefaultObj();

	void OnNotAvailableConcreteModel(class UPalMapObjectConcreteModelBase* Model);
	void OnDisposeMapObject(class UPalMapObjectModel* Model, struct FPalMapObjectDisposeOptions& Options);
	void OnAvailableConcreteModel(class UPalMapObjectConcreteModelBase* Model);
	void MapObjectInstanceDelegate__DelegateSignature(class UPalMapObjectModel* Model);
	void MapObjectConcreteModelDelegate__DelegateSignature(class UPalMapObjectConcreteModelBase* Model);
};

// 0x1A8 (0x1D0 - 0x28)
// Class Pal.PalBaseCampModel
class UPalBaseCampModel : public UObject
{
public:
	FMulticastInlineDelegateProperty_            OnUpdateStatusDelegate;                            // 0x28(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnDisposeDelegate;                                 // 0x38(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                        Pad_2E30[0x10];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	struct FGuid                                 ID;                                                // 0x58(0x10)(Edit, Net, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                BaseCampName;                                      // 0x68(0x10)(Edit, Net, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EPalBaseCampState                 CurrentState;                                      // 0x78(0x1)(Edit, Net, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_2E31[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FTransform                            Transform;                                         // 0x80(0x60)(Edit, Net, DisableEditOnTemplate, Transient, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        AreaRange;                                         // 0xE0(0x4)(Edit, Net, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGuid                                 GroupIdBelongTo;                                   // 0xE4(0x10)(Edit, Net, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_2E32[0xC];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FTransform                            FastTravelLocalTransform;                          // 0x100(0x60)(Edit, Net, DisableEditOnTemplate, Transient, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UPalBaseCampWorkerDirector*            WorkerDirector;                                    // 0x160(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UPalBaseCampMapObjectCollection*       MapObjectCollection;                               // 0x168(0x8)(Edit, Net, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UPalBaseCampWorkCollection*            WorkCollection;                                    // 0x170(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UPalBaseCampEnemyObserver*             EnemyObserver;                                     // 0x178(0x8)(Edit, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UPalBaseCampFunctionModuleBase*> ModuleArray;                                       // 0x180(0x10)(Edit, Net, ZeroConstructor, Transient, EditConst, Protected, NativeAccessSpecifierProtected)
	TArray<struct FGuid>                         PlayerUIdsExistsInsideInServer;                    // 0x190(0x10)(Edit, Net, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, Protected, NativeAccessSpecifierProtected)
	struct FGuid                                 OwnerMapObjectInstanceId;                          // 0x1A0(0x10)(Edit, Net, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        Level_InGuildProperty;                             // 0x1B0(0x4)(Edit, Net, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGuid                                 LocationId;                                        // 0x1B4(0x10)(Edit, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FPalBaseCampSignificanceInfo          SignificanceInfo;                                  // 0x1C4(0x8)(Edit, DisableEditOnTemplate, Transient, EditConst, NoDestructor, NativeAccessSpecifierPrivate)
	float                                        ProgressTimeSinceLastTick;                         // 0x1CC(0x4)(Edit, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UPalBaseCampModel* GetDefaultObj();

	void UpdateLevel_ServerInternal(int32 PlayerId, int32 NewLevel);
	bool TryGetRandomPositionInside(struct FVector& Origin, float Radius, struct FVector* ToLocation);
	void SimpleDelegate__DelegateSignature(class UPalBaseCampModel* Model);
	void ReflectLevel_InGuildProperty_Internal(int32 NewLevel);
	void OnRep_Level_InGuildProperty(int32 OldLevel);
	void OnPassedTimeAfterEmptyEnemy();
	void OnFirstAppearEnemy();
	void OnDamageInCampActor(const struct FPalDamageResult& DamageResult);
	void OnAddNewWorker(class UPalIndividualCharacterHandle* AddCharacterHandle);
	class UPalBaseCampWorkCollection* GetWorkCollection();
	struct FTransform GetTransform();
	enum class EPalBaseCampState GetState();
	float GetRange();
	struct FGuid GetOwnerMapObjectInstanceId();
	int32 GetLevel();
	struct FGuid GetId();
	struct FGuid GetGroupIdBelongTo();
	class UPalBaseCampEnemyObserver* GetEnemyObserver();
	class FString GetBaseCampName();
	bool FindWorkAssignableObject(class UPalIndividualCharacterHandle* AssignIndividualHandle, struct FGuid& WorkId, bool bFixedAssign, class UPalWorkBase** FoundObject);
	bool FindNearestAssignableObject(class UPalIndividualCharacterHandle* AssignIndividualHandle, struct FTransform& Origin, float Range, bool bFixedAssign, TScriptInterface<class IPalBaseCampAssignableObjectInterface>* FoundObject);
	void BaseCampGuildPalStorageUpdateDelegate__DelegateSignature(class UPalBaseCampModel* Model, class UPalGuildPalStorage* GuildPalStorage);
};

// 0x0 (0x28 - 0x28)
// Class Pal.PalBaseCampEnergyGeneratorInterface
class IPalBaseCampEnergyGeneratorInterface : public IInterface
{
public:

	static class UClass* StaticClass();
	static class IPalBaseCampEnergyGeneratorInterface* GetDefaultObj();

};

// 0x10 (0x38 - 0x28)
// Class Pal.PalBaseCampModuleEnergy
class UPalBaseCampModuleEnergy : public UPalBaseCampFunctionModuleBase
{
public:
	TArray<class UPalBaseCampModuleEnergy_FunctionBase*> FunctionArray;                                     // 0x28(0x10)(Edit, Net, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, Protected, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UPalBaseCampModuleEnergy* GetDefaultObj();

};

// 0x38 (0x60 - 0x28)
// Class Pal.PalBaseCampModuleEnergy_FunctionBase
class UPalBaseCampModuleEnergy_FunctionBase : public UObject
{
public:
	FMulticastInlineDelegateProperty_            OnUpdateEnergyAmountDelegate;                      // 0x28(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TArray<struct FGuid>                         EnergyGeneratorConcreteModelIds;                   // 0x38(0x10)(Edit, Net, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, Protected, NativeAccessSpecifierProtected)
	TArray<struct FGuid>                         EnergyConsumerConcreteModelIds;                    // 0x48(0x10)(Edit, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, Protected, NativeAccessSpecifierProtected)
	enum class EPalBaseCampModuleEnergyState     CurrentState;                                      // 0x58(0x1)(Edit, Net, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_2E69[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        ProvideWaitRemainTime;                             // 0x5C(0x4)(Edit, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UPalBaseCampModuleEnergy_FunctionBase* GetDefaultObj();

	void UpdateEnergyAmountDelegate__DelegateSignature(class UPalBaseCampModuleEnergy_FunctionBase* Function);
	void InvokeOnUpdateEnergyAmount(class UPalMapObjectGenerateEnergyModel* Model);
};

// 0x0 (0x60 - 0x60)
// Class Pal.PalBaseCampModuleEnergy_Electric
class UPalBaseCampModuleEnergy_Electric : public UPalBaseCampModuleEnergy_FunctionBase
{
public:

	static class UClass* StaticClass();
	static class UPalBaseCampModuleEnergy_Electric* GetDefaultObj();

};

// 0x60 (0x88 - 0x28)
// Class Pal.PalBaseCampModuleFacilityReservation
class UPalBaseCampModuleFacilityReservation : public UPalBaseCampFunctionModuleBase
{
public:
	TMap<enum class EPalMapObjectWorkerAvailableFacilityType, struct FPalBaseCampFacilityUsageInfoSet> FacilityUsageInfoSetMap;                           // 0x28(0x50)(Edit, DisableEditOnTemplate, Transient, EditConst, NativeAccessSpecifierPrivate)
	TArray<struct FPalBaseCampFacilityCountPair> FacilityCounts;                                    // 0x78(0x10)(Edit, Net, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UPalBaseCampModuleFacilityReservation* GetDefaultObj();

	void OnStartUseFacility_ServerInternal(class UPalMapObjectConcreteModelBase* Model, class UPalIndividualCharacterHandle* IndividualHandle);
	void OnNotAvailableMapObjectInServer(class UPalMapObjectConcreteModelBase* ConcreteModel);
	void OnFinishUseFacility_ServerInternal(class UPalMapObjectConcreteModelBase* Model);
	void OnAvailableMapObjectInServer(class UPalMapObjectConcreteModelBase* ConcreteModel);
};

// 0x70 (0x98 - 0x28)
// Class Pal.PalBaseCampModuleItemStorage
class UPalBaseCampModuleItemStorage : public UPalBaseCampFunctionModuleBase
{
public:
	FMulticastInlineDelegateProperty_            OnUpdateAnyItemContainerDelegate;                  // 0x28(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TArray<struct FPalBaseCampItemContainerInfo> ContainerInfos;                                    // 0x38(0x10)(Edit, Net, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, NativeAccessSpecifierPrivate)
	TMap<struct FGuid, struct FPalBaseCampItemExistsInfo> RepairKitItemExistsInfos;                          // 0x48(0x50)(Edit, DisableEditOnTemplate, Transient, EditConst, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UPalBaseCampModuleItemStorage* GetDefaultObj();

	void OnUpdateItemContainer(class UPalMapObjectItemContainerModule* ItemContainerModule);
	void OnNotAvailableConcreteModel(class UPalMapObjectConcreteModelBase* ConcreteModel);
	void OnAvailableConcreteModel(class UPalMapObjectConcreteModelBase* ConcreteModel);
	void MulticastReturnSelfAndUpdatedContainerDelegate__DelegateSignature(class UPalBaseCampModuleItemStorage* Self, class UPalItemContainer* UpdatedContainer);
	void GetContainerIds(TArray<struct FPalContainerId>* OutContainerIds);
};

// 0x10 (0x38 - 0x28)
// Class Pal.PalBaseCampModuleMedical
class UPalBaseCampModuleMedical : public UPalBaseCampFunctionModuleBase
{
public:
	TArray<struct FGuid>                         ReviveWorkIds;                                     // 0x28(0x10)(Edit, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UPalBaseCampModuleMedical* GetDefaultObj();

	void OnReviveCharacter_ServerInternal(class UPalIndividualCharacterParameter* IndividualParameter);
	void OnRemovedWorkerInServer(class UPalIndividualCharacterHandle* IndividualHandle);
};

// 0x10 (0x38 - 0x28)
// Class Pal.PalBaseCampModuleObjectMaintenance
class UPalBaseCampModuleObjectMaintenance : public UPalBaseCampFunctionModuleBase
{
public:
	TArray<class UPalBaseCampModuleObjectMaintenance_WayBase*> MaintenanceWayDOs;                                 // 0x28(0x10)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UPalBaseCampModuleObjectMaintenance* GetDefaultObj();

	void OnRegisteredMapObject_ServerInternal(class UPalMapObjectModel* Model);
	void OnGrantedEffectToMapObject_ServerInternal(class UPalMapObjectModel* Model, class UPalMapObjectModelEffectBase* Effect);
	void OnDisposeMapObject_ServerInternal(class UPalMapObjectModel* Model, struct FPalMapObjectDisposeOptions& Options);
};

// 0x0 (0x28 - 0x28)
// Class Pal.PalBaseCampModuleObjectMaintenance_WayBase
class UPalBaseCampModuleObjectMaintenance_WayBase : public UObject
{
public:

	static class UClass* StaticClass();
	static class UPalBaseCampModuleObjectMaintenance_WayBase* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class Pal.PalBaseCampModuleObjectMaintenance_ExtinguishFire
class UPalBaseCampModuleObjectMaintenance_ExtinguishFire : public UPalBaseCampModuleObjectMaintenance_WayBase
{
public:

	static class UClass* StaticClass();
	static class UPalBaseCampModuleObjectMaintenance_ExtinguishFire* GetDefaultObj();

	void OnTriggerByReachAccumulateTriggerValue(class UPalMapObjectModelEffect_AccumulateTrigger* Effect_AccumulateTrigger, class UPalMapObjectModel* OwnerModel);
};

// 0x50 (0x78 - 0x28)
// Class Pal.PalBaseCampPassiveEffectBase
class UPalBaseCampPassiveEffectBase : public UObject
{
public:
	TMap<class FName, struct FPalBaseCampPassiveEffectMapObjectInfo> MapObjectInfoMapByMapObjectId;                     // 0x28(0x50)(Edit, DisableEditOnTemplate, Transient, EditConst, Protected, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UPalBaseCampPassiveEffectBase* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class Pal.PalBaseCampModulePassiveEffectWorkSpeedApplierInterface
class IPalBaseCampModulePassiveEffectWorkSpeedApplierInterface : public IInterface
{
public:

	static class UClass* StaticClass();
	static class IPalBaseCampModulePassiveEffectWorkSpeedApplierInterface* GetDefaultObj();

};

// 0x118 (0x140 - 0x28)
// Class Pal.PalBaseCampModulePassiveEffect
class UPalBaseCampModulePassiveEffect : public UPalBaseCampFunctionModuleBase
{
public:
	struct FPalFastBaseCampPassiveEffectRepInfoArray RepInfoArray;                                      // 0x28(0x118)(Edit, Net, DisableEditOnTemplate, Transient, EditConst, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UPalBaseCampModulePassiveEffect* GetDefaultObj();

	void OnNotAvailableMapObjectInServer(class UPalMapObjectConcreteModelBase* Model);
	void OnAvailableMapObjectInServer(class UPalMapObjectConcreteModelBase* Model);
};

// 0x58 (0xD0 - 0x78)
// Class Pal.PalBaseCampPassiveEffect_WorkSuitability
class UPalBaseCampPassiveEffect_WorkSuitability : public UPalBaseCampPassiveEffectBase
{
public:
	uint8                                        Pad_2ED7[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TMap<enum class EPalWorkSuitability, float>  WorkSpeedAdditionalRateMap;                        // 0x80(0x50)(Edit, DisableEditOnTemplate, Transient, EditConst, Protected, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UPalBaseCampPassiveEffect_WorkSuitability* GetDefaultObj();

};

// 0x20 (0x98 - 0x78)
// Class Pal.PalBaseCampPassiveEffect_WorkHard
class UPalBaseCampPassiveEffect_WorkHard : public UPalBaseCampPassiveEffectBase
{
public:
	uint8                                        Pad_2EDF[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	FMulticastInlineDelegateProperty_            OnUpdateWorkHardTypeDelegate;                      // 0x80(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	enum class EPalBaseCampPassiveEffectWorkHardType WorkHardType;                                      // 0x90(0x1)(Edit, Net, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_2EE0[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UPalBaseCampPassiveEffect_WorkHard* GetDefaultObj();

	void ReturnSelfDelegate__DelegateSignature(class UPalBaseCampPassiveEffect_WorkHard* Self);
	void OnRep_WorkHardType();
	enum class EPalBaseCampPassiveEffectWorkHardType GetWorkHardType();
};

// 0x0 (0x28 - 0x28)
// Class Pal.PalBaseCampModuleResourceCollectorTargetInterface
class IPalBaseCampModuleResourceCollectorTargetInterface : public IInterface
{
public:

	static class UClass* StaticClass();
	static class IPalBaseCampModuleResourceCollectorTargetInterface* GetDefaultObj();

};

// 0x50 (0x78 - 0x28)
// Class Pal.PalBaseCampModuleResourceCollector
class UPalBaseCampModuleResourceCollector : public UPalBaseCampFunctionModuleBase
{
public:
	TMap<struct FGuid, struct FPalBaseCampModuleResourceCollectWorkInfo> MapObjectWorkInfoMap;                              // 0x28(0x50)(Edit, DisableEditOnTemplate, Transient, EditConst, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UPalBaseCampModuleResourceCollector* GetDefaultObj();

	void OnRegisteredMapObjectModel(class UPalMapObjectModel* Model);
	void OnRegisteredFoliageModel_ServerInternal(class UPalFoliageInstance* Instance);
	void OnDestroyedMapObjectModel(class UPalMapObjectModel* Model, struct FPalMapObjectDisposeOptions& Options);
	void OnDestroyedFoliageInstance(class UPalFoliageInstance* Instance);
};

// 0xA0 (0xC8 - 0x28)
// Class Pal.PalBaseCampModuleTransportItemDirector
class UPalBaseCampModuleTransportItemDirector : public UPalBaseCampFunctionModuleBase
{
public:
	TMap<struct FGuid, struct FPalBaseCampModuleTransportItemStatus> TransportItemStatusMap;                            // 0x28(0x50)(Edit, DisableEditOnTemplate, Transient, EditConst, Protected, NativeAccessSpecifierProtected)
	TMap<struct FGuid, struct FPalBaseCampModuleTransportItemTarget> TransportTargetMap;                                // 0x78(0x50)(Edit, DisableEditOnTemplate, Transient, EditConst, Protected, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UPalBaseCampModuleTransportItemDirector* GetDefaultObj();

	void OnUpdateMapObjectContainer(class UPalMapObjectItemContainerModule* ContainerModule);
	void OnUnassignWorkTransportItemTarget(class UPalWorkBase* Work, struct FPalInstanceID& IndividualId);
	void OnUnassignWorkRequirement(class UPalWorkBase* Work, struct FPalInstanceID& IndividualId);
	void OnNotAvailableMapObjectConcreteModel(class UPalMapObjectConcreteModelBase* ConcreteModel);
	void OnAvailableMapObjectConcreteModel(class UPalMapObjectConcreteModelBase* ConcreteModel);
	void OnAssignWorkTransportItemTarget(class UPalWorkBase* Work, struct FPalInstanceID& IndividualId);
	void OnAssignWorkRequirement(class UPalWorkBase* Work, struct FPalInstanceID& IndividualId);
};

// 0x0 (0x28 - 0x28)
// Class Pal.PalGameStateReplicatorBase
class UPalGameStateReplicatorBase : public UObject
{
public:

	static class UClass* StaticClass();
	static class UPalGameStateReplicatorBase* GetDefaultObj();

};

// 0x198 (0x1C0 - 0x28)
// Class Pal.PalBaseCampReplicator
class UPalBaseCampReplicator : public UPalGameStateReplicatorBase
{
public:
	struct FFastPalBaseCampRepInfoArray          RepInfoArray;                                      // 0x28(0x148)(Edit, Net, DisableEditOnTemplate, Transient, EditConst, NativeAccessSpecifierPrivate)
	uint8                                        Pad_2F15[0x50];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UPalBaseCampReplicator* GetDefaultObj();

};

// 0x8 (0x30 - 0x28)
// Class Pal.PalBaseCampTaskChecker
class UPalBaseCampTaskChecker : public UObject
{
public:
	class UDataTable*                            TaskDataTable;                                     // 0x28(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UPalBaseCampTaskChecker* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class Pal.PalBaseCampUtility
class UPalBaseCampUtility : public UObject
{
public:

	static class UClass* StaticClass();
	static class UPalBaseCampUtility* GetDefaultObj();

};

// 0x98 (0xC0 - 0x28)
// Class Pal.PalBaseCampWorkCollection
class UPalBaseCampWorkCollection : public UObject
{
public:
	uint8                                        Pad_2F31[0x10];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	FMulticastInlineDelegateProperty_            OnUnassignWorkDelegate;                            // 0x38(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	struct FGuid                                 BaseCampId;                                        // 0x48(0x10)(Edit, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<struct FGuid>                         WorkIds;                                           // 0x58(0x10)(Edit, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, NativeAccessSpecifierPrivate)
	uint8                                        Pad_2F35[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TMap<struct FGuid, struct FPalBaseCampWorkCollectionStashInfo> CannotMoveToWorkInfoMap;                           // 0x70(0x50)(Edit, DisableEditOnTemplate, Transient, EditConst, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UPalBaseCampWorkCollection* GetDefaultObj();

	void WorkAssignUpdateDelegate__DelegateSignature(class UPalWorkBase* Work, struct FPalInstanceID& IndividualId);
	void WorkAssignRequirementDelegate__DelegateSignature(class UPalWorkBase* Work, struct FPalWorkAssignRequirementParameter& RequirementParameter);
	void OnUnassignWork_ServerInternal(class UPalWorkBase* Work, struct FPalInstanceID& IndividualId);
	void OnRequiredAssign_ServerInternal(class UPalWorkBase* Work, struct FPalWorkAssignRequirementParameter& RequirementParameter);
};

// 0x108 (0x130 - 0x28)
// Class Pal.PalBaseCampWorkerDirector
class UPalBaseCampWorkerDirector : public UObject
{
public:
	uint8                                        Pad_2F73[0x18];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	FMulticastInlineDelegateProperty_            OnAddNewWorkerDelegate;                            // 0x40(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnRemovedWorkerInServerDelegate;                   // 0x50(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	struct FGuid                                 BaseCampId;                                        // 0x60(0x10)(Edit, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FTransform                            SpawnTransform;                                    // 0x70(0x60)(Edit, DisableEditOnTemplate, Transient, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UPalIndividualCharacterContainer*      CharacterContainer;                                // 0xD0(0x8)(Edit, Net, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EPalMapBaseCampWorkerOrderType    CurrentOrderType;                                  // 0xD8(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EPalBaseCampWorkerDirectionBattleType CurrentBattleType;                                 // 0xD9(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, DisableEditOnTemplate, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_2F74[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UPalIndividualCharacterSlotsObserver*  SlotObserverForServer;                             // 0xE0(0x8)(ZeroConstructor, Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FPalBaseCampWorkAssignRequest> RequiredAssignWorks;                               // 0xE8(0x10)(Edit, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, Protected, NativeAccessSpecifierProtected)
	TArray<struct FPalInstanceID>                WaitingWorkerIndividualIds;                        // 0xF8(0x10)(Edit, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, Protected, NativeAccessSpecifierProtected)
	int32                                        WorkerEventTickCount;                              // 0x108(0x4)(Edit, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_2F75[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class UPalBaseCampWorkerTaskBase*>    WorkerTasks;                                       // 0x110(0x10)(Edit, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, NativeAccessSpecifierPrivate)
	uint8                                        Pad_2F76[0x1];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	enum class EPalBaseCampWorkerDirectorState   State;                                             // 0x121(0x1)(Edit, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_2F77[0xE];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UPalBaseCampWorkerDirector* GetDefaultObj();

	void RemovedWorkerDelegate__DelegateSignature(class UPalIndividualCharacterHandle* IndividualHandle);
	void OrderCommand(enum class EPalMapBaseCampWorkerOrderType OrderType);
	void OnUpdateOwnerBaseCampStatus_ServerInternal(class UPalBaseCampModel* OwnerBaseCamp);
	void OnSpawnedCharacterInServer(const struct FPalInstanceID& IndividualId);
	void OnRequiredAssignWork_ServerInternal(class UPalWorkBase* Work, struct FPalWorkAssignRequirementParameter& RequirementParameter);
	void OnRep_CharacterContainer();
	void OnRemovedNewCharacterInServer(struct FPalInstanceID& IndividualId);
	void OnReflectSlotCompleteInServer();
	void OnRaisedPhantomCharacterInServer(const struct FPalInstanceID& IndividualId, int32 PhantomId);
	void OnNotifiedUnassignWork_ServerInternal(class UPalWorkBase* Work, struct FPalInstanceID& IndividualId);
	void OnDeadWorkerInServer_Internal(class APalCharacter* DeadCharacter);
	void OnDeadWorkerInServer(const struct FPalDeadInfo& Info);
	void OnChangeWorldSettings_ServerInternal(struct FPalOptionWorldSettings& PrevSettings, struct FPalOptionWorldSettings& NewSettings);
	void OnAddedNewCharacterInServer(struct FPalInstanceID& IndividualId);
	void GetCharacterHandleSlots(TArray<class UPalIndividualCharacterSlot*>* OutSlots);
	class UPalIndividualCharacterSlot* FindSlotByHandle(class UPalIndividualCharacterHandle* Handle);
	void AddNewWorkerDelegate__DelegateSignature(class UPalIndividualCharacterHandle* NewCharacter);
};

// 0x68 (0x90 - 0x28)
// Class Pal.PalBaseCampWorkerEventBase
class UPalBaseCampWorkerEventBase : public UObject
{
public:
	struct FPalDataTableRowName_BaseCampWorkerEventData MasterDataId;                                      // 0x28(0x8)(Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EPalLogType                       LogType;                                           // 0x30(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_2F92[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FPalBaseCampWorkerEventMasterData     MasterData;                                        // 0x38(0x28)(Edit, DisableEditOnTemplate, Transient, EditConst, Protected, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UNiagaraSystem>         OverrideSleepFX;                                   // 0x60(0x30)(Edit, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UPalBaseCampWorkerEventBase* GetDefaultObj();

	bool IsTriggerEventBySanity(float SanityValue);
	bool IsTriggerEventByCharacter(class APalCharacter* Character);
	class FString Debug_CreateTextTriggerEventSanity();
	class FText CreateNotifyMessageText(class FText& LocalizedFormatText, class APalCharacter* Character);
};

// 0x0 (0x28 - 0x28)
// Class Pal.PalBaseCampWorkerEventUtility
class UPalBaseCampWorkerEventUtility : public UObject
{
public:

	static class UClass* StaticClass();
	static class UPalBaseCampWorkerEventUtility* GetDefaultObj();

};

// 0x0 (0x90 - 0x90)
// Class Pal.PalBaseCampWorkerEvent_DestroyBuilding
class UPalBaseCampWorkerEvent_DestroyBuilding : public UPalBaseCampWorkerEventBase
{
public:

	static class UClass* StaticClass();
	static class UPalBaseCampWorkerEvent_DestroyBuilding* GetDefaultObj();

};

// 0x10 (0xA0 - 0x90)
// Class Pal.PalBaseCampWorkerEvent_DodgeWork
class UPalBaseCampWorkerEvent_DodgeWork : public UPalBaseCampWorkerEventBase
{
public:
	TSubclassOf<class UPalAIActionBase>          ActionClass;                                       // 0x90(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        AIActionDuration;                                  // 0x98(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        TerminateSanityValueOver;                          // 0x9C(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UPalBaseCampWorkerEvent_DodgeWork* GetDefaultObj();

};

// 0x0 (0xA0 - 0xA0)
// Class Pal.PalBaseCampWorkerEvent_DodgeWork_Short
class UPalBaseCampWorkerEvent_DodgeWork_Short : public UPalBaseCampWorkerEvent_DodgeWork
{
public:

	static class UClass* StaticClass();
	static class UPalBaseCampWorkerEvent_DodgeWork_Short* GetDefaultObj();

};

// 0x10 (0xB0 - 0xA0)
// Class Pal.PalBaseCampWorkerEvent_DodgeWork_Sleep
class UPalBaseCampWorkerEvent_DodgeWork_Sleep : public UPalBaseCampWorkerEvent_DodgeWork
{
public:
	int32                                        SleepMinTime;                                      // 0xA0(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        SanityValueStillSleeping;                          // 0xA4(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FFloatInterval                        WalkTime_BeforeSleep;                              // 0xA8(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UPalBaseCampWorkerEvent_DodgeWork_Sleep* GetDefaultObj();

};

// 0x8 (0x98 - 0x90)
// Class Pal.PalBaseCampWorkerEvent_EatTooMuch
class UPalBaseCampWorkerEvent_EatTooMuch : public UPalBaseCampWorkerEventBase
{
public:
	float                                        RecoverSanityTo;                                   // 0x90(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        EatMaxNum;                                         // 0x94(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UPalBaseCampWorkerEvent_EatTooMuch* GetDefaultObj();

};

// 0x0 (0x90 - 0x90)
// Class Pal.PalBaseCampWorkerEvent_Escape
class UPalBaseCampWorkerEvent_Escape : public UPalBaseCampWorkerEventBase
{
public:

	static class UClass* StaticClass();
	static class UPalBaseCampWorkerEvent_Escape* GetDefaultObj();

};

// 0x0 (0x90 - 0x90)
// Class Pal.PalBaseCampWorkerEvent_FightWithFriend
class UPalBaseCampWorkerEvent_FightWithFriend : public UPalBaseCampWorkerEventBase
{
public:

	static class UClass* StaticClass();
	static class UPalBaseCampWorkerEvent_FightWithFriend* GetDefaultObj();

};

// 0x0 (0x90 - 0x90)
// Class Pal.PalBaseCampWorkerEvent_OverworkDeath
class UPalBaseCampWorkerEvent_OverworkDeath : public UPalBaseCampWorkerEventBase
{
public:

	static class UClass* StaticClass();
	static class UPalBaseCampWorkerEvent_OverworkDeath* GetDefaultObj();

};

// 0x0 (0x90 - 0x90)
// Class Pal.PalBaseCampWorkerEvent_Sick
class UPalBaseCampWorkerEvent_Sick : public UPalBaseCampWorkerEventBase
{
public:

	static class UClass* StaticClass();
	static class UPalBaseCampWorkerEvent_Sick* GetDefaultObj();

};

// 0x8 (0x98 - 0x90)
// Class Pal.PalBaseCampWorkerEvent_Tantrum
class UPalBaseCampWorkerEvent_Tantrum : public UPalBaseCampWorkerEventBase
{
public:
	TSubclassOf<class UPalAIActionBaseCampTrantrum> ActionClass;                                       // 0x90(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UPalBaseCampWorkerEvent_Tantrum* GetDefaultObj();

};

// 0x0 (0x90 - 0x90)
// Class Pal.PalBaseCampWorkerEvent_TurnFoodBox
class UPalBaseCampWorkerEvent_TurnFoodBox : public UPalBaseCampWorkerEventBase
{
public:

	static class UClass* StaticClass();
	static class UPalBaseCampWorkerEvent_TurnFoodBox* GetDefaultObj();

};

// 0x10 (0x38 - 0x28)
// Class Pal.PalBaseCampWorkerTaskBase
class UPalBaseCampWorkerTaskBase : public UObject
{
public:
	struct FGuid                                 OwnerBaseCampId;                                   // 0x28(0x10)(Edit, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UPalBaseCampWorkerTaskBase* GetDefaultObj();

};

// 0x10 (0x48 - 0x38)
// Class Pal.PalBaseCampWorkerTask_IgnitionTorchAtNight
class UPalBaseCampWorkerTask_IgnitionTorchAtNight : public UPalBaseCampWorkerTaskBase
{
public:
	TArray<struct FGuid>                         TorchInstanceIds;                                  // 0x38(0x10)(Edit, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UPalBaseCampWorkerTask_IgnitionTorchAtNight* GetDefaultObj();

	void OnNotAvailableMapObjectInServer(class UPalMapObjectConcreteModelBase* ConcreteModel);
	void OnAvailableMapObjectInServer(class UPalMapObjectConcreteModelBase* ConcreteModel);
};

// 0xA0 (0x110 - 0x70)
// Class Pal.PalBattleManager
class UPalBattleManager : public UPalWorldSubsystem
{
public:
	TMap<class AActor*, struct FActorArray>      EnemyListPerPlayer;                                // 0x70(0x50)(Edit, DisableEditOnTemplate, Transient, EditConst, NativeAccessSpecifierPrivate)
	uint8                                        Pad_3018[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TSubclassOf<class APalNPCSpawnerBase>        DebugSpawnerClass;                                 // 0xC8(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnFExclamationMarkDelegate;                        // 0xD0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnFQuestionMarkDelegate;                           // 0xE0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnFEmitSoundDelegate;                              // 0xF0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnFEmitSoundOnlyPalmiDelegate;                     // 0x100(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UPalBattleManager* GetDefaultObj();

	bool TargetIsPlayerOrPlayersOtomoPal(class AActor* TargetCharacter);
	void SoundReactionStart(class APalCharacter* SelfCharacter);
	void SetUpPlayerMap(class AActor* Player);
	void RemovePlayerMap(class AActor* Player);
	void RemoveEnemyActor_AllPlayer(class AActor* Enemy, enum class EPalPlayerBattleFinishType FinishType);
	void RemoveEnemyActor(class AActor* Player, class AActor* Enemy, enum class EPalPlayerBattleFinishType FinishType);
	void QuestionMarkDelegate__DelegateSignature(class APalCharacter* TargetCharacter);
	bool IsBattleModeAnyPlayer();
	class AActor* GetRandomActor(const TArray<class AActor*>& TargetList);
	class AActor* GetNearestActor(const TArray<class AActor*>& TargetList, const struct FVector& Location);
	bool GetConflictEnemies(class AActor* Player, TArray<class AActor*>* OutEnemyes, bool IgnoreOtomoStopByBall);
	void GetAllPlayerAndOtomo_ForEnemySelf(const TArray<class AActor*>& TargetPlayers, TArray<class AActor*>* OutCharacters);
	void ExclamationMarkDelegate__DelegateSignature(class APalCharacter* TargetCharacter);
	void EnemyNearPlayerListUpdate(class AActor* Enemy, float Distance);
	void EmitSoundOnlyPalmiDelegate__DelegateSignature(int32 SoundLevel);
	void EmitSoundDelegate__DelegateSignature(int32 SoundRadius, const struct FVector& EmitLocation, class AActor* Emitter);
	void EmitSound(class FName SoundRowName, class AActor* Emitter, const struct FVector& EmitLocation, float VolumeRate);
	void AddEnemyActor_PlayerOrOtomo(class AActor* PlayerOrOtomo, class AActor* Enemy);
	void ActionMenaceStart(class APalCharacter* SelfCharacter);
};

// 0x8 (0x298 - 0x290)
// Class Pal.PalBiomeAreaTriggerBase
class APalBiomeAreaTriggerBase : public AActor
{
public:
	enum class EPalBiomeType                     BindBiomeType;                                     // 0x290(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_302C[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class APalBiomeAreaTriggerBase* GetDefaultObj();

	void OnOverlap(class AActor* OtherActor, enum class EPalBiomeType BiomeType);
	void OnEndOverlap(class AActor* OtherActor, enum class EPalBiomeType BiomeType);
	enum class EPalBiomeType GetBiomeType();
};

// 0x18 (0xB8 - 0xA0)
// Class Pal.PalBiomeDetectComponent
class UPalBiomeDetectComponent : public UActorComponent
{
public:
	FMulticastInlineDelegateProperty_            OnChangedBiome;                                    // 0xA0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                        Pad_3032[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UPalBiomeDetectComponent* GetDefaultObj();

	void OnChangedBiomeDelegate__DelegateSignature(class AActor* OverlapActor, class APalBiomeAreaTriggerBase* BiomeTriggerActor);
	void ChangeBiome(class APalBiomeAreaTriggerBase* BiomeTriggerActor);
};

// 0x0 (0x28 - 0x28)
// Class Pal.PalBlueprintLibrary
class UPalBlueprintLibrary : public UBlueprintFunctionLibrary
{
public:

	static class UClass* StaticClass();
	static class UPalBlueprintLibrary* GetDefaultObj();

	bool NotEqual_PalInstanceIDPalInstanceID(const struct FPalInstanceID& A, const struct FPalInstanceID& B);
	bool EqualEqual_PalInstanceIDPalInstanceID(const struct FPalInstanceID& A, const struct FPalInstanceID& B);
};

// 0x18 (0x590 - 0x578)
// Class Pal.PalBodyPartsBoxComponent
class UPalBodyPartsBoxComponent : public UBoxComponent
{
public:
	enum class EPalBodyPartsType                 BodyPartsType;                                     // 0x578(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_304D[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FName                                  DefaultCollisionProfileName;                       // 0x57C(0x8)(Edit, ZeroConstructor, DisableEditOnTemplate, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                  BroadcastCollisionProfileName;                     // 0x584(0x8)(Edit, Net, ZeroConstructor, DisableEditOnTemplate, EditConst, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_304E[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UPalBodyPartsBoxComponent* GetDefaultObj();

	void OnRep_BroadcastCollisionProfileName();
};

// 0x20 (0x580 - 0x560)
// Class Pal.PalBodyPartsCapsuleComponent
class UPalBodyPartsCapsuleComponent : public UCapsuleComponent
{
public:
	enum class EPalBodyPartsType                 BodyPartsType;                                     // 0x560(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_304F[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FName                                  DefaultCollisionProfileName;                       // 0x564(0x8)(Edit, ZeroConstructor, DisableEditOnTemplate, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                  BroadcastCollisionProfileName;                     // 0x56C(0x8)(Edit, Net, ZeroConstructor, DisableEditOnTemplate, EditConst, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_3050[0xC];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UPalBodyPartsCapsuleComponent* GetDefaultObj();

	void OnRep_BroadcastCollisionProfileName();
};

// 0x20 (0x580 - 0x560)
// Class Pal.PalBodyPartsSphereComponent
class UPalBodyPartsSphereComponent : public USphereComponent
{
public:
	enum class EPalBodyPartsType                 BodyPartsType;                                     // 0x560(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3053[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FName                                  DefaultCollisionProfileName;                       // 0x564(0x8)(Edit, ZeroConstructor, DisableEditOnTemplate, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                  BroadcastCollisionProfileName;                     // 0x56C(0x8)(Edit, Net, ZeroConstructor, DisableEditOnTemplate, EditConst, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_3054[0xC];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UPalBodyPartsSphereComponent* GetDefaultObj();

	void OnRep_BroadcastCollisionProfileName();
};

// 0xA8 (0x148 - 0xA0)
// Class Pal.PalBodyTemperatureComponent
class UPalBodyTemperatureComponent : public UActorComponent
{
public:
	FMulticastInlineDelegateProperty_            OnChangeTemperatureDelegate;                       // 0xA0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnChangeResistRankDelegate;                        // 0xB0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnChangeBodyStateDelegate;                         // 0xC0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMap<class FName, struct FPalHeatSourceInfo> HeatSourceInfoMap;                                 // 0xD0(0x50)(NativeAccessSpecifierPrivate)
	int32                                        CurrentTemperature;                                // 0x120(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                  SelfKeyName;                                       // 0x124(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_308D[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FTimerHandle                          SlipDamageTimer;                                   // 0x130(0x8)(Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                        CurrentResistRank_Heat;                            // 0x138(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                        CurrentResistRank_Cold;                            // 0x13C(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	enum class EPalBodyTemperatureState          CurrentBodyState;                                  // 0x140(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_308E[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UPalBodyTemperatureComponent* GetDefaultObj();

	void RequestReSend_ToServer();
	void RemoveHeatSource(class FName UniqueName);
	void OnUpdatePassiveSkill(enum class EPalPassiveSkillEffectType EffectType, float Value);
	void OnUpdateEquipment(class UPalItemSlot* ItemSlot, enum class EPalPlayerEquipItemSlotType SlotType);
	void OnInitializedPlayer_ForClient(class APalCharacter* Character);
	void OnInitializedPlayer(class APalCharacter* Character);
	void OnEndPassiveSkill(enum class EPalPassiveSkillEffectType EffectType);
	void OnChangeTemperatureDelegate__DelegateSignature(int32 NextTemperature);
	void OnChangeResistRankDelegate__DelegateSignature(int32 NextResistHeat, int32 NextResistCold);
	void OnChangeHour();
	void OnChangeBodyStateDelegate__DelegateSignature(enum class EPalBodyTemperatureState BodyState);
	void CallOnChangeTemperature(int32 Next);
	void CallOnChangeResistRank(int32 Heat, int32 Cold);
	void CallOnChangeBodyState(enum class EPalBodyTemperatureState State);
	void CallAllDelegate();
	void AddHeatSourceInfo(class FName UniqueName, const struct FPalHeatSourceInfo& HeatInfo);
	void AddHeatSource(class FName UniqueName, int32 HeatLevel);
};

// 0x8 (0x30 - 0x28)
// Class Pal.PalBoneInfo
class UPalBoneInfo : public UObject
{
public:
	float                                        Length;                                            // 0x28(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        Radius;                                            // 0x2C(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UPalBoneInfo* GetDefaultObj();

};

// 0x2F8 (0x320 - 0x28)
// Class Pal.PalBossBattleInstanceModel
class UPalBossBattleInstanceModel : public UObject
{
public:
	uint8                                        Pad_309F[0x58];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	struct FTransform                            FrontWarpPointTransform;                           // 0x80(0x60)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnTemplate, Transient, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector_NetQuantize                   RepFrontWarpPointtLocation;                        // 0xE0(0x18)(Edit, BlueprintVisible, BlueprintReadOnly, Net, DisableEditOnTemplate, Transient, EditConst, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_30A0[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FTransform                            TopWarpPointTransform;                             // 0x100(0x60)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnTemplate, Transient, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FTransform                            StartPointTransform;                               // 0x160(0x60)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnTemplate, Transient, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FTransform                            DeadItemDropTransform;                             // 0x1C0(0x60)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnTemplate, Transient, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FPalStageInstanceId                   StageInstanceId;                                   // 0x220(0x14)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnTemplate, Transient, EditConst, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EPalBossType                      BossType;                                          // 0x234(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_30A1[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TSoftClassPtr<class APalCutsceneActor>       IntroCutsceneActor;                                // 0x238(0x30)(Edit, BlueprintVisible, BlueprintReadOnly, Net, DisableEditOnTemplate, Transient, EditConst, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftClassPtr<class ALevelInstance>          BossRoomLevelInstanceAsset;                        // 0x268(0x30)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnTemplate, Transient, EditConst, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UAkAudioEvent>          BGMAudioEvent;                                     // 0x298(0x30)(Edit, BlueprintVisible, BlueprintReadOnly, Net, DisableEditOnTemplate, Transient, EditConst, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        Level;                                             // 0x2C8(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        CombatTimeMax;                                     // 0x2CC(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class APalBossBattleLevelInstance*           BossBattleLevelInstance;                           // 0x2D0(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, DisableEditOnTemplate, EditConst, RepNotify, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class APalBossTower*                         BossTower;                                         // 0x2D8(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EPalBossBattleState               BossBattleState;                                   // 0x2E0(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_30A5[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class APalPlayerCharacter*>           EntryPlayers;                                      // 0x2E8(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, RepNotify, Protected, NativeAccessSpecifierProtected)
	TArray<class APalPlayerCharacter*>           WonPlayers;                                        // 0x2F8(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, Protected, NativeAccessSpecifierProtected)
	struct FDateTime                             CombatTimeLimit;                                   // 0x308(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UPalBossBattleSequencer*               LocalBattleSequencer;                              // 0x310(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDataLayerAsset*                       ReservedDataLayerAsset;                            // 0x318(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UPalBossBattleInstanceModel* GetDefaultObj();

	void OnUpdateCombatTimeLimit();
	void OnUpdateBossBattleState();
	void OnRep_EntryPlayers();
	void OnRep_CombatTimeLimit();
	void OnRep_BossBattleState();
	void OnRep_BossBattleLevelInstance();
	void OnChangeEntryPlayerDelegate__DelegateSignature(const TArray<class APalPlayerCharacter*>& EntryPlayers);
	void OnChangeCombatTimeLimitDelegate__DelegateSignature(const struct FDateTime& CombatTimeLimit);
	void OnChangeBossBattleStateDelegate__DelegateSignature(enum class EPalBossBattleState BossBattleState);
	bool IsLevelInstanceLoaded();
	int32 GetLevel();
	enum class EPalBossType GetBossType();
	enum class EPalBossBattleState GetBossBattleState();
};

// 0x18 (0x338 - 0x320)
// Class Pal.PalBossBattleLevelInstance
class APalBossBattleLevelInstance : public ALevelInstance
{
public:
	FMulticastInlineDelegateProperty_            OnBossSpawnedDelegate;                             // 0x320(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	bool                                         bIsLoaded;                                         // 0x330(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_30B5[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class APalBossBattleLevelInstance* GetDefaultObj();

	void SpawnBossSpawner(enum class EPalBossType BossType, int32 JoinPlayerNum);
	void ResetBossLocation();
	void OnBossSpawnedDelegate__DelegateSignature(class APalCharacter* SpawnedCharacter);
	struct FTransform GetSequencerTransform();
	struct FTransform GetPlayerStartTransform();
	bool CheckLevelLoaded();
	void BossSpawned(class APalCharacter* SpawnedCharacter);
};

// 0x1A0 (0x210 - 0x70)
// Class Pal.PalBossBattleManager
class UPalBossBattleManager : public UPalWorldSubsystem
{
public:
	FMulticastInlineDelegateProperty_            OnLocalBossBattleSuccessDelegate;                  // 0x70(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnCombatStartUIDelegate;                           // 0x80(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnCombatEndUIAction;                               // 0x90(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	int32                                        MAX_TIME_LIMIT;                                    // 0xA0(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        PlayerRespawnTimeLimit;                            // 0xA4(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        BGMFadeDuration;                                   // 0xA8(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_30E9[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TMap<int32, float>                           MultiPlayerBossHPMap;                              // 0xB0(0x50)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	TSubclassOf<class UPalBossBattleSequencer>   BossBattleSequencerClass;                          // 0x100(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TMap<enum class EPalBossType, struct FPalBossBattleStaticInfo> BossInfoMap;                                       // 0x108(0x50)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	TMap<enum class EPalBossType, class UPalBossBattleInstanceModel*> InstanceModelMap;                                  // 0x158(0x50)(Transient, NativeAccessSpecifierPrivate)
	TMap<enum class EPalBossType, class UPalBossBattleSequencer*> BossBattleSequencerMap;                            // 0x1A8(0x50)(Transient, NativeAccessSpecifierPrivate)
	struct FGuid                                 GroupGuid;                                         // 0x1F8(0x10)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	enum class EPalBossType                      DisableSkyBossType_LocalPlayer;                    // 0x208(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_30EA[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UPalBossBattleManager* GetDefaultObj();

	void UnlockAchievement(enum class EPalBossType BossType);
	void UnloadBossBattle_ServerInternal(enum class EPalBossType BossType);
	void OnLocalPlayerBossBattleSuccessDelegate__DelegateSignature(class APalPlayerCharacter* LocalJoinedPlayer, enum class EPalBossType BossType);
	void OnCombatStartUIDelegate__DelegateSignature(class APalBossTower* BossTower);
	void OnCombatEndUIActionDelegate__DelegateSignature(enum class EPalBossBattleCombatResult CombatResult);
	void OnBossBattleCombatStart(enum class EPalBossType BossType);
	void LoadAsyncBossBattle_ServerInternal(enum class EPalBossType BossType);
	struct FTransform GetTopWarpPointTransform(enum class EPalBossType BossType);
	struct FPalBossBattleStaticInfo GetStaticInfo(enum class EPalBossType BossType);
	struct FTransform GetPlayerSpawnTransformForMultiPlayer(int32 Index, const struct FVector& Location, const struct FRotator& Rotate, float Offset);
	int32 GetMaxJoinablePlayerNum();
	bool GetIsServer();
	float GetBossHPMultiPlayerRate(int32 JoinedPlayerNum);
	int32 GetBossAchievementIndex(enum class EPalBossType BossType);
	float GetBattleTimeLimit();
	void EmptyInstanceCleanup();
	void DisableSkyCreator(bool Disable);
	bool CanStartBossBattle(enum class EPalBossType BossType);
	void BossBattleExit(enum class EPalBossType BossType, class APalPlayerCharacter* ExitPlayer);
	void BossBattleEntryCancel(enum class EPalBossType BossType, class APalPlayerCharacter* EntryPlayer);
	void BossBattleEntry(enum class EPalBossType BossType, class APalPlayerCharacter* EntryPlayer);
	void AddGroupCharacter(class UPalIndividualCharacterHandle* AddIndividualHandle);
};

// 0x0 (0x28 - 0x28)
// Class Pal.BossBattleLevelSequenceRootInterface
class IBossBattleLevelSequenceRootInterface : public IInterface
{
public:

	static class UClass* StaticClass();
	static class IBossBattleLevelSequenceRootInterface* GetDefaultObj();

};

// 0x18 (0x40 - 0x28)
// Class Pal.PalBossBattleSequenceBase
class UPalBossBattleSequenceBase : public UObject
{
public:
	FMulticastInlineDelegateProperty_            OnSequenceFinishDelegate;                          // 0x28(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	enum class EPalBossBattleSequenceType        NextSequenceType;                                  // 0x38(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_310D[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UPalBossBattleSequenceBase* GetDefaultObj();

	void TickSequence(float DeltaTime);
	void SetupLevelSequenceActor(class ALevelSequenceActor* LevelSequenceActor, class ULevelSequence* LevelSequence, class ALevelInstance* LevelInstance);
	void SequenceFinishDelegate__DelegateSignature(bool IsSuccess);
	void SelfFinish_ForBP();
	void OnBeginSequence();
	void NoticeSequenceEnd_ToServer();
	bool IsServer();
	class UPalBossBattleSequencer* GetOuterSequencer();
	class APalPlayerCharacter* GetJoinedLocalControlPlayer();
	class AActor* GetBossRoomSequenceRootActor(class ALevelInstance* LevelInstance);
	struct FPalBossBattleStaticInfo GetBossBattleStaticInfo();
	void FinishSequence(bool IsSuccess);
};

// 0x100 (0x128 - 0x28)
// Class Pal.PalBossBattleSequencer
class UPalBossBattleSequencer : public UObject
{
public:
	FMulticastInlineDelegateProperty_            OnCombatStartDelegate;                             // 0x28(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	float                                        RemainBattleTimer;                                 // 0x38(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         IsBattleTimerCountDown;                            // 0x3C(0x1)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EPalBossBattleCombatResult        CombatResult;                                      // 0x3D(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_3188[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TMap<enum class EPalBossBattleSequenceType, TSubclassOf<class UPalBossBattleSequenceBase>> SequenceClassMap;                                  // 0x40(0x50)(Edit, DisableEditOnInstance, UObjectWrapper, NativeAccessSpecifierPrivate)
	TMap<enum class EPalBossBattleSequenceType, class UPalBossBattleSequenceBase*> SequenceMap;                                       // 0x90(0x50)(Transient, NativeAccessSpecifierPrivate)
	class UPalBossBattleSequenceBase*            CurrentSequence;                                   // 0xE0(0x8)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UPalBossBattleInstanceModel*           BossBattleInstanceModel;                           // 0xE8(0x8)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class APalPlayerCharacter*>           InRoomPlayers;                                     // 0xF0(0x10)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	TArray<class APalPlayerCharacter*>           SequenceEndPlayers;                                // 0x100(0x10)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	uint8                                        Pad_3189[0x1];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	enum class EPalBossType                      SelfBossType;                                      // 0x111(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_318A[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class APalCharacter*                         BossCharacter;                                     // 0x118(0x8)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                        PlayingBGMId;                                      // 0x120(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bIsClientOnly;                                     // 0x124(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_318B[0x3];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UPalBossBattleSequencer* GetDefaultObj();

	void Tick_ForBP(float DeltaTime);
	void StopBGM();
	void SetPlayerMoveDisable(class APalPlayerCharacter* Player, bool Disable);
	void SetMutekiAllPlayer(bool bIsMuteki);
	void SetBossCharacter(class APalCharacter* BossActor);
	void SetAllPlayerMoveDisable(bool Disable);
	void RemovePlayerFromInRoomList(class APalPlayerCharacter* Player);
	void RemoveDyingStatus();
	void PlayBGM(class UAkAudioEvent* BGMAudioEvent);
	void OnPlayerRespawn(class APalPlayerCharacter* Player);
	void OnPlayerDeadStopBGM(class APalPlayerCharacter* PlayerCharacter);
	void OnOpeningEnd(bool Success);
	void OnEndingEnd(bool Success);
	void OnDyingDeadEndDelegate(class APalPlayerCharacter* PlayerCharacter);
	void OnCompletedEnd(bool Success);
	void OnCombatFinish(enum class EPalBossBattleCombatResult InCombatResult);
	void OnCombatEnd(bool Success);
	void NoticeClientCombatResult();
	void KillAllPlayer();
	bool IsClientOnly();
	bool IsAllPlayerDead();
	TArray<class APalPlayerCharacter*> GetSequencePlayers();
	float GetRemainTimeSecond();
	class APalPlayerCharacter* GetJoinedLocalPlayer();
	class APalPlayerCharacter* GetJoinedAndServerLocalPlayer();
	TArray<class APalPlayerCharacter*> GetInRoomPlayers();
	enum class EPalBossType GetBossType();
	class APalCharacter* GetBossCharacter();
	class UPalBossBattleInstanceModel* GetBossBattleInstanceModel();
	TArray<class APalPlayerCharacter*> GetAliveOrDyingPlayers();
	void FullRecoveryHPAllPlayer();
	void ForceRespawnPlayer();
	class APalPlayerCharacter* FindFirstCombatTargetForBossAI();
	void BossBattleCombatStart__DelegateSignature(enum class EPalBossType BossType);
};

// 0x10 (0x38 - 0x28)
// Class Pal.PalHUDDispatchParameterBase
class UPalHUDDispatchParameterBase : public UObject
{
public:
	FMulticastInlineDelegateProperty_            OnClose;                                           // 0x28(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UPalHUDDispatchParameterBase* GetDefaultObj();

};

// 0x10 (0x48 - 0x38)
// Class Pal.PalWaitInfoWorldHUDParameter
class UPalWaitInfoWorldHUDParameter : public UPalHUDDispatchParameterBase
{
public:
	class APalBossTower*                         BossTower;                                         // 0x38(0x8)(BlueprintVisible, ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         IsWaiting;                                         // 0x40(0x1)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_319F[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UPalWaitInfoWorldHUDParameter* GetDefaultObj();

};

// 0x38 (0x428 - 0x3F0)
// Class Pal.PalUserWidget
class UPalUserWidget : public UPalActivatableWidget
{
public:
	bool                                         bSyncPlayerInventory;                              // 0x3F0(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_31E4[0x17];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	class UPalHUDDispatchParameterBase*          Param;                                             // 0x408(0x8)(ZeroConstructor, Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_31E5[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FPalUIActionBindData>          BindedActionHandles;                               // 0x418(0x10)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UPalUserWidget* GetDefaultObj();

	void VisibilityOverride(enum class ESlateVisibility ChangedVisibility);
	void UnregisterActionBinding(struct FPalUIActionBindData& BindingData);
	void RequestInventorySync(bool bOpen);
	struct FPalUIActionBindData RegisterActionBinding_NotConcume(class FName& ActionName, bool IsDisplayActionBar, enum class EInputEvent InputType, FDelegateProperty_ Callback);
	struct FPalUIActionBindData RegisterActionBinding(class FName& ActionName, bool IsDisplayActionBar, enum class EInputEvent InputType, FDelegateProperty_ Callback);
	struct FGuid Push(TSubclassOf<class UPalUserWidgetOverlayUI> WidgetClass, class UPalHUDDispatchParameterBase* Parameter);
	void PlayAkSound(class UAkAudioEvent* AkEvent);
	void OnSetup_AfterCreatedPlayer();
	void OnSetup();
	void OnClosed();
	bool IsSameWidget(struct FGuid& CheckID);
	class UPalHUDDispatchParameterBase* GetParam();
	class UUserWidget* FindParentWidget(TSubclassOf<class UUserWidget> Class);
};

// 0x0 (0x428 - 0x428)
// Class Pal.PalUserWidgetWorldHUD
class UPalUserWidgetWorldHUD : public UPalUserWidget
{
public:

	static class UClass* StaticClass();
	static class UPalUserWidgetWorldHUD* GetDefaultObj();

	void RemoveSelf();
	void OnRequestRemove();
};

// 0x18 (0x440 - 0x428)
// Class Pal.PalBossEntryWaitInfoHUD
class UPalBossEntryWaitInfoHUD : public UPalUserWidgetWorldHUD
{
public:
	bool                                         EnableCountDown;                                   // 0x428(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_31F6[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class APalBossTower*                         BossTower;                                         // 0x430(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDateTime                             TimeLimitDate;                                     // 0x438(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UPalBossEntryWaitInfoHUD* GetDefaultObj();

	void UpdateWaitInfo(bool bIsCountDown, const struct FDateTime& TimeLimit);
	void UpdateCountDown();
	void OnCloseHUD();
};

// 0x68 (0x2F8 - 0x290)
// Class Pal.PalBossTower
class APalBossTower : public AActor
{
public:
	uint8                                        Pad_324A[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	FMulticastInlineDelegateProperty_            OnChangeBossTowerEntryWaitUI;                      // 0x298(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	enum class EPalBossType                      BossType;                                          // 0x2A8(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_324B[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FGuid                                 EntryWaitInfoHUDId;                                // 0x2AC(0x10)(Edit, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_324D[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UPalBossBattleInstanceModel*           InstanceModel;                                     // 0x2C0(0x8)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FDateTime                             CombatTimeLimit;                                   // 0x2C8(0x8)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                 LocationInstanceId;                                // 0x2D0(0x10)(Edit, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class APalPlayerCharacter*>           InDoorPlayerList;                                  // 0x2E0(0x10)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	struct FTimerHandle                          TimerHandle;                                       // 0x2F0(0x8)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class APalBossTower* GetDefaultObj();

	bool WriteBossDefeatRecord_ServerInternal(class APalPlayerCharacter* TargetPlayer);
	void ShowWaitInfo(const struct FVector& TargetLocation, const struct FVector& DisplayOffset, bool IsWaiting);
	void RequestBossBattleStart(class APalPlayerCharacter* Player);
	void RequestBossBattleEntry(class APalPlayerCharacter* Player);
	void RemoveInDoorPlayer(class APalPlayerCharacter* Player);
	void OnRep_InstanceModel();
	void OnChangeEntryPlayer(const TArray<class APalPlayerCharacter*>& EntryPlayers);
	void OnChangeCombatTimeLimit(const struct FDateTime& NewCombatTimeLimit);
	void OnChangeBossTowerEntryWaitUI__DelegateSignature(bool bIsCountDown, const struct FDateTime& TimeLimit);
	void OnChangeBossBattleStateBP(enum class EPalBossBattleState NewState);
	void OnChangeBossBattleState(enum class EPalBossBattleState NewBossBattleState);
	bool IsEntered(class APalPlayerCharacter* Player);
	struct FTransform GetTopWarpPoint();
	TArray<class APalPlayerCharacter*> GetStartablePlayers();
	struct FTransform GetFrontWarpPoint();
	TArray<class APalPlayerCharacter*> GetForceWarpTargets();
	struct FTransform GetDeadItemDropPoint();
	class FName GetBossBattleRowName();
	void CloseWaitInfo();
	void AddInDoorPlayer(class APalPlayerCharacter* Player);
};

// 0x8 (0x298 - 0x290)
// Class Pal.PalBotBuilderLocationBase
class APalBotBuilderLocationBase : public AActor
{
public:
	int32                                        BuilderIndex;                                      // 0x290(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bIsBuilded;                                        // 0x294(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_325F[0x3];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class APalBotBuilderLocationBase* GetDefaultObj();

};

// 0x20 (0x2B0 - 0x290)
// Class Pal.PalBoxSpawnerPlacementTool
class APalBoxSpawnerPlacementTool : public AActor
{
public:
	struct FVector                               BoxExtent;                                         // 0x290(0x18)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UBoxComponent*                         BoxComp;                                           // 0x2A8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class APalBoxSpawnerPlacementTool* GetDefaultObj();

};

// 0x60 (0x100 - 0xA0)
// Class Pal.PalBuilderComponent
class UPalBuilderComponent : public UActorComponent
{
public:
	FMulticastInlineDelegateProperty_            OnUpdatePossessMaterials;                          // 0xA0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnStartBuildingMode_Local;                         // 0xB0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnEndBuildingMode_Local;                           // 0xC0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	float                                        InstallDistanceNormalFromOwner;                    // 0xD0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        InstallableRange;                                  // 0xD4(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCameraComponent*                      OwnerCamera;                                       // 0xD8(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class APalBuildObjectInstallChecker*         InstallChecker;                                    // 0xE0(0x8)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class APalDismantleObjectChecker*            DismantleChecker;                                  // 0xE8(0x8)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_32A7[0x10];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UPalBuilderComponent* GetDefaultObj();

	void RequestBuild_ToServer(class FName BuildObjectId, struct FVector& Location, struct FQuat& Rotation, TArray<struct FPalNetArchive>& ExtraParameterArchives, const struct FPalBuildRequestDebugParameter& DebugParameter);
	void ReceiveBuildResult_ToRequestClient(enum class EPalMapObjectOperationResult Result);
	void OnExitBaseCamp(class UPalBaseCampModel* BaseCampModel);
	void OnEnterBaseCamp(class UPalBaseCampModel* BaseCampModel);
	void MulticastReturnSelfDelegate__DelegateSignature(class UPalBuilderComponent* Self);
	bool IsInstallAtReticle();
	bool IsExistsMaterialForBuildObject(struct FPalBuildObjectData& BuildObjectData);
	bool IsExecuting();
	bool IsEnableDismantle();
	enum class EPalMapObjectOperationResult IsEnableBuild();
	void GetSelectedBuildObjectId(class FName* OutSelectedBuildObjectId);
	class APalBuildObject* GetDismantleTargetObject();
	void CollectItemInfoEnableToUseMaterial(const TArray<class FName>& StaticItemIds, TArray<struct FPalStaticItemIdAndNum>* OutItemInfos);
};

// 0x110 (0x3A0 - 0x290)
// Class Pal.PalMapObject
class APalMapObject : public AActor
{
public:
	uint8                                        Pad_32E5[0x10];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	FMulticastInlineDelegateProperty_            OnNotifiedShowStatusHUDDelegate;                   // 0x2A0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnNotifiedShowBuildProgressHUDDelegate;            // 0x2B0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnSetConcreteModelDelegate;                        // 0x2C0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	struct FVector                               SpawnLocationOffset;                               // 0x2D0(0x18)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UPalMapObjectConcreteModelBase> ConcreteModelClass;                                // 0x2E8(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<TScriptInterface<class IPalInteractiveObjectComponentInterface>> InteractComps;                                     // 0x2F0(0x10)(ZeroConstructor, Transient, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	class UPalMapObjectDamageReactionComponent*  DamageReaction;                                    // 0x300(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UPalMapObjectVisualEffectComponent*    VisualEffect;                                      // 0x308(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bSpawnableIfOverlapped;                            // 0x310(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bLevelSpawnObject;                                 // 0x311(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_32EA[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class FName>                          AllowOverlapCollisionPresetNames;                  // 0x318(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	bool                                         bSpawnSlipAboveIfAnyOverlap;                       // 0x328(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bShakeOnDamaged;                                   // 0x329(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EPalMapObjectDestroyFXType        DestroyFXType;                                     // 0x32A(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bShowOutlineInTargettingReticle;                   // 0x32B(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bShowOutlineNearPlayer;                            // 0x32C(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bAutoDestroyByOverlapSpawning;                     // 0x32D(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bInDoorObject;                                     // 0x32E(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bBaseObject;                                       // 0x32F(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGuid                                 HPHUDId;                                           // 0x330(0x10)(Edit, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EPalMapObjectDamagableType        DamagableType;                                     // 0x340(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_32F3[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FGuid                                 ModelInstanceId;                                   // 0x344(0x10)(Edit, Net, ZeroConstructor, DisableEditOnTemplate, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_32F4[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UPalMapObjectModel*                    MapObjectModel;                                    // 0x358(0x8)(Edit, Net, ZeroConstructor, DisableEditOnTemplate, EditConst, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bUnmanagedInLocal;                                 // 0x360(0x1)(Edit, ZeroConstructor, DisableEditOnTemplate, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_32F5[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TSubclassOf<class UPalUserWidgetWorldHUD>    IndicatorWidgetClass;                              // 0x368(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<struct FPalMapObjectMeshVisibleData>  MeshVisibleDataSet;                                // 0x370(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	enum class EPalMapObjectChangeMeshFXType     ChangeMeshFXType;                                  // 0x380(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_32F7[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FGuid                                 OpenWidgetId;                                      // 0x384(0x10)(Edit, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bWorkLocationGroupRaycastStartOffsetOrigin;        // 0x394(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bShouldPlayDestroyFX;                              // 0x395(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_32FA[0xA];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class APalMapObject* GetDefaultObj();

	void TryGetConcreteModel(enum class EPalMapObjectGetModelOutPinType* OutputPin, class UPalMapObjectConcreteModelBase** ConcreteModel);
	void ToggleBuildProgressHUD__DelegateSignature(enum class EPalHUDDisplayType DisplayType);
	void SetIgnoreSave_ServerInternal(bool bIgnore);
	void ReturnSelf__DelegateSignature(class APalMapObject* Self, enum class EPalHUDDisplayType DisplayType);
	void OnUpdatedEnableTickByModel(class UPalMapObjectModel* Model);
	void OnRep_MapObjectModel();
	void OnInteractEnd(class AActor* Other, TScriptInterface<class IPalInteractiveObjectComponentInterface> Component);
	void OnInteractBegin(class AActor* Other, TScriptInterface<class IPalInteractiveObjectComponentInterface> Component);
	void OnDisposeModel_ServerInternal(class UPalMapObjectModel* DisposeModel, struct FPalMapObjectDisposeOptions& Options);
	void OnDamaged(class UPalMapObjectModel* TargetModel, struct FPalDamageInfo& DamageInfo);
	void OnCloseParameter(class UPalHUDDispatchParameterBase* Parameter);
	class UPalMapObjectModel* GetModel();
	struct FGuid GetGroupIdBelongTo();
	void DisposeSelf_ServerInternal();
	void CallOrRegisterOnSetConcreteModel(FDelegateProperty_ Delegate);
	void BroadcastShouldPlayDestroyFX();
	void BP_OnSetConcreteModel(class UPalMapObjectConcreteModelBase* ConcreteModel);
};

// 0x1D0 (0x570 - 0x3A0)
// Class Pal.PalBuildObject
class APalBuildObject : public APalMapObject
{
public:
	uint8                                        Pad_337D[0x20];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	FMulticastInlineDelegateProperty_            OnChangeState;                                     // 0x3C0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                        Pad_337E[0x18];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	enum class EPalBuildObjectInstallStrategy    InstallStrategy;                                   // 0x3E8(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_3380[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        InstallCapacitySlopeAngle;                         // 0x3EC(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        InstallCapacitySinkRateByHeight;                   // 0x3F0(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_3382[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UPalBuildObjectVisualControlComponent* VisualCtrl;                                        // 0x3F8(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                  BuildObjectId;                                     // 0x400(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, DisableEditOnTemplate, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UShapeComponent*                       OverlapCheckCollision;                             // 0x408(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FComponentReference                   OverlapCheckCollisionRef;                          // 0x410(0x28)(Edit, BlueprintVisible, Protected, NativeAccessSpecifierProtected)
	struct FBox                                  LocalBounds;                                       // 0x438(0x38)(Edit, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	class UPalBuildObjectOverlapChecker*         OverlapChecker;                                    // 0x470(0x8)(Edit, ZeroConstructor, Transient, EditConst, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UMeshComponent*>                AllMeshes;                                         // 0x478(0x10)(ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	TArray<class UPrimitiveComponent*>           VirtualMeshCollisions;                             // 0x488(0x10)(ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	enum class EPalBuildObjectState              CurrentState;                                      // 0x498(0x1)(Edit, Net, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_3387[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FGuid                                 WorldHUDId;                                        // 0x49C(0x10)(Edit, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGuid                                 buildProgressWorldHUDId;                           // 0x4AC(0x10)(Edit, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_3388[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               WorldHUDDisplayOffset;                             // 0x4C0(0x18)(Edit, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        WorldHUDDisplayRange;                              // 0x4D8(0x4)(Edit, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_3389[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               buildProgressHUDDisplayOffset;                     // 0x4E0(0x18)(Edit, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector2D                             buildProgressHUDDisplayOffsetScreen;               // 0x4F8(0x10)(Edit, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        buildProgressHUDDisplayRange;                      // 0x508(0x4)(Edit, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_338D[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UAkAudioEvent*                         BuildCompleteSEOverride;                           // 0x510(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        BuildProgressVisualRate;                           // 0x518(0x4)(Edit, Net, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bDismantleTargetInLocal;                           // 0x51C(0x1)(Edit, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_3392[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TMap<class UPrimitiveComponent*, struct FPalBuildObjectMeshDefaultSetting> DefaultMeshSettingMap;                             // 0x520(0x50)(Edit, DisableEditOnTemplate, Transient, EditConst, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class APalBuildObject* GetDefaultObj();

	void PlayBuildCompleteFX_ToALL();
	void OnUpdateHp(class UPalMapObjectModel* DamagedModel);
	void OnUpdateBuildWorkAmount(class UPalWorkProgress* WorkProgress);
	void OnTriggerInteractBuilding(class AActor* OtherActor, enum class EPalInteractiveObjectIndicatorType IndicatorType);
	void OnTickRepairCompleteAnimation();
	void OnTickBuildCompleteAnimation();
	void OnStartTriggerInteractBuilding(class AActor* OtherActor, enum class EPalInteractiveObjectIndicatorType IndicatorType);
	void OnRep_CurrentState();
	void OnRep_BuildProgressVisualRate();
	void OnNotAvailable_BlueprintImpl();
	void OnFinishBuildWork_ServerInternal(class UPalBuildProcess* BuildProcess);
	void OnEndTriggerInteractBuilding(class AActor* OtherActor, enum class EPalInteractiveObjectIndicatorType IndicatorType);
	void OnDamage(class UPalMapObjectModel* DamagedModel, struct FPalDamageInfo& DamageInfo);
	void OnChangeStateDelegate__DelegateSignature(enum class EPalBuildObjectState State);
	void OnBeginInteractBuilding(class AActor* OtherActor, TScriptInterface<class IPalInteractiveObjectComponentInterface> InteractiveObject);
	void OnAvailable_BlueprintImpl();
	bool IsAvailable();
	class UShapeComponent* GetBuildWorkableBoundsShape();
};

// 0x0 (0x570 - 0x570)
// Class Pal.PalBuildObjectBaseCampPoint
class APalBuildObjectBaseCampPoint : public APalBuildObject
{
public:

	static class UClass* StaticClass();
	static class APalBuildObjectBaseCampPoint* GetDefaultObj();

	struct FTransform GetWorkerSpawnLocalTransform();
	struct FTransform GetFastTravelLocalTransform();
};

// 0x50 (0x5C0 - 0x570)
// Class Pal.PalBuildObjectBreedFarm
class APalBuildObjectBreedFarm : public APalBuildObject
{
public:
	struct FComponentReference                   ChestInteractRef;                                  // 0x570(0x28)(Edit, BlueprintVisible, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FComponentReference                   WalkAroundVolumeRef;                               // 0x598(0x28)(Edit, BlueprintVisible, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class APalBuildObjectBreedFarm* GetDefaultObj();

};

// 0x68 (0x90 - 0x28)
// Class Pal.PalBuildObjectDataMap
class UPalBuildObjectDataMap : public UObject
{
public:
	TMap<class FName, struct FPalBuildObjectData> BuildObjectDataIdMap;                              // 0x28(0x50)(Transient, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_33C4[0x18];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UPalBuildObjectDataMap* GetDefaultObj();

	struct FPalBuildObjectData GetByMapObjectId(class FName MapObjectId);
	struct FPalBuildObjectData GetById(class FName ID);
	void GetBuildObjectDataMapForType(enum class EPalBuildObjectTypeA TypeA, TArray<struct FPalBuildObjectData>* OutArray);
	void GetBuildObjectDataArrayForTypeAByTypeB(enum class EPalBuildObjectTypeA TypeA, TArray<struct FPalBuildObjectDataSetTypeB>* OutArray);
};

// 0x18 (0x588 - 0x570)
// Class Pal.PalBuildObjectDefenseBase
class APalBuildObjectDefenseBase : public APalBuildObject
{
public:
	TSubclassOf<class UPalAIActionBaseCampDefenseBase> DefenseAIActionClass;                              // 0x570(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FPalDataTableRowName_ItemData         BulletItemId;                                      // 0x578(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, Transient, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        MagazineSize;                                      // 0x580(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_33D0[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class APalBuildObjectDefenseBase* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class Pal.PalBuildObjectDataUtility
class UPalBuildObjectDataUtility : public UBlueprintFunctionLibrary
{
public:

	static class UClass* StaticClass();
	static class UPalBuildObjectDataUtility* GetDefaultObj();

	int32 ToSortPriorityTypeB(enum class EPalBuildObjectTypeB TypeB);
	int32 ToSortPriorityTypeA(enum class EPalBuildObjectTypeA TypeA);
	int32 ToInt(enum class EPalBuildObjectTypeA TypeA);
	enum class EPalBuildObjectTypeA ToBuildObjectTypeA(int32 Value);
	void MaterialInfos(struct FPalBuildObjectData& BuildObjectData, TArray<struct FPalItemRecipeMaterialInfo>* MaterialInfos);
};

// 0x28 (0x598 - 0x570)
// Class Pal.PalBuildObjectFarmBlockV2
class APalBuildObjectFarmBlockV2 : public APalBuildObject
{
public:
	struct FPalDataTableRowName_FarmCropData     CropDataId;                                        // 0x570(0x8)(Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UNiagaraSystem*                        GrowupFX;                                          // 0x578(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class APalMapObjectFarmCrop*                 CropActor;                                         // 0x580(0x8)(Edit, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_3412[0x10];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class APalBuildObjectFarmBlockV2* GetDefaultObj();

	void OnUpdateState_ServerInternal(enum class EPalFarmCropState LastCropState, enum class EPalFarmCropState NextCropState);
};

// 0x10 (0x580 - 0x570)
// Class Pal.PalBuildObjectGenerateEnergy
class APalBuildObjectGenerateEnergy : public APalBuildObject
{
public:
	enum class EPalEnergyType                    GenerateEnergyType;                                // 0x570(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_344B[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        GenerateEnergyRateByWorker;                        // 0x574(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        MaxEnergyStorage;                                  // 0x578(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_344C[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class APalBuildObjectGenerateEnergy* GetDefaultObj();

	void OnUpdateWorkAssigned_ServerInternal(class UPalWorkBase* Work);
	void OnStartGenerate();
	void OnEndGenerate();
	void BroadcastStartGenerate();
	void BroadcastEndGenerate();
};

// 0x20 (0x2B0 - 0x290)
// Class Pal.PalBuildObjectInstallChecker
class APalBuildObjectInstallChecker : public AActor
{
public:
	class APalBuildObject*                       TargetBuildObject;                                 // 0x290(0x8)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UShapeComponent*                       OverlapCheckComponent;                             // 0x298(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UPalBuildObjectOverlapChecker*         OverlapChecker;                                    // 0x2A0(0x8)(Edit, ZeroConstructor, Transient, EditConst, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UPalBuildObjectInstallStrategyBase*    InstallStrategy;                                   // 0x2A8(0x8)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class APalBuildObjectInstallChecker* GetDefaultObj();

};

// 0x10 (0x38 - 0x28)
// Class Pal.PalBuildObjectInstallStrategyBase
class UPalBuildObjectInstallStrategyBase : public UObject
{
public:
	class APalBuildObject*                       TargetBuildObject;                                 // 0x28(0x8)(ZeroConstructor, Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_3453[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UPalBuildObjectInstallStrategyBase* GetDefaultObj();

};

// 0x0 (0x38 - 0x38)
// Class Pal.PalBuildObjectInstallStrategyAttachToObjectBase
class UPalBuildObjectInstallStrategyAttachToObjectBase : public UPalBuildObjectInstallStrategyBase
{
public:

	static class UClass* StaticClass();
	static class UPalBuildObjectInstallStrategyAttachToObjectBase* GetDefaultObj();

};

// 0x0 (0x38 - 0x38)
// Class Pal.PalBuildObjectInstallStrategyAttachToCeil
class UPalBuildObjectInstallStrategyAttachToCeil : public UPalBuildObjectInstallStrategyAttachToObjectBase
{
public:

	static class UClass* StaticClass();
	static class UPalBuildObjectInstallStrategyAttachToCeil* GetDefaultObj();

};

// 0x20 (0x48 - 0x28)
// Class Pal.PalMapObjectModelConnectorBase
class UPalMapObjectModelConnectorBase : public UObject
{
public:
	int32                                        SupportedLevel;                                    // 0x28(0x4)(Edit, Net, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_345C[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FPalMapObjectModelConnectInfo         ConnectInfoAnyPlace;                               // 0x30(0x18)(Edit, DisableEditOnTemplate, Transient, EditConst, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UPalMapObjectModelConnectorBase* GetDefaultObj();

};

// 0x0 (0x48 - 0x48)
// Class Pal.PalMapObjectModelConnectorAttach
class UPalMapObjectModelConnectorAttach : public UPalMapObjectModelConnectorBase
{
public:

	static class UClass* StaticClass();
	static class UPalMapObjectModelConnectorAttach* GetDefaultObj();

};

// 0x0 (0x48 - 0x48)
// Class Pal.PalMapObjectModelConnectorAttachToCeil
class UPalMapObjectModelConnectorAttachToCeil : public UPalMapObjectModelConnectorAttach
{
public:

	static class UClass* StaticClass();
	static class UPalMapObjectModelConnectorAttachToCeil* GetDefaultObj();

};

// 0x0 (0x38 - 0x38)
// Class Pal.PalBuildObjectInstallStrategyAttachToWall
class UPalBuildObjectInstallStrategyAttachToWall : public UPalBuildObjectInstallStrategyAttachToObjectBase
{
public:

	static class UClass* StaticClass();
	static class UPalBuildObjectInstallStrategyAttachToWall* GetDefaultObj();

};

// 0x0 (0x48 - 0x48)
// Class Pal.PalMapObjectModelConnectorAttachToWall
class UPalMapObjectModelConnectorAttachToWall : public UPalMapObjectModelConnectorAttach
{
public:

	static class UClass* StaticClass();
	static class UPalMapObjectModelConnectorAttachToWall* GetDefaultObj();

};

// 0x0 (0x38 - 0x38)
// Class Pal.PalBuildObjectInstallStrategySinkableNormal
class UPalBuildObjectInstallStrategySinkableNormal : public UPalBuildObjectInstallStrategyBase
{
public:

	static class UClass* StaticClass();
	static class UPalBuildObjectInstallStrategySinkableNormal* GetDefaultObj();

};

// 0x40 (0x78 - 0x38)
// Class Pal.PalBuildObjectInstallStrategyBaseCampPoint
class UPalBuildObjectInstallStrategyBaseCampPoint : public UPalBuildObjectInstallStrategySinkableNormal
{
public:
	class APalBuildObjectBaseCampPoint*          TargetBuildObjectCache;                            // 0x38(0x8)(Edit, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FBox                                  CannotOverlapAreaBox;                              // 0x40(0x38)(ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UPalBuildObjectInstallStrategyBaseCampPoint* GetDefaultObj();

};

// 0x18 (0x50 - 0x38)
// Class Pal.PalBuildObjectInstallStrategyFloor
class UPalBuildObjectInstallStrategyFloor : public UPalBuildObjectInstallStrategyBase
{
public:
	class AActor*                                HitActorCache;                                     // 0x38(0x8)(ZeroConstructor, Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class APalBuildObject*                       HitBuildObjectCache;                               // 0x40(0x8)(ZeroConstructor, Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_3477[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UPalBuildObjectInstallStrategyFloor* GetDefaultObj();

};

// 0x18 (0x50 - 0x38)
// Class Pal.PalBuildObjectInstallStrategyFoundation
class UPalBuildObjectInstallStrategyFoundation : public UPalBuildObjectInstallStrategyBase
{
public:
	class AActor*                                HitActorCache;                                     // 0x38(0x8)(ZeroConstructor, Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class APalBuildObject*                       HitBuildObjectCache;                               // 0x40(0x8)(ZeroConstructor, Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_347D[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UPalBuildObjectInstallStrategyFoundation* GetDefaultObj();

};

// 0x60 (0xA8 - 0x48)
// Class Pal.PalMapObjectModelConnectorFoundation
class UPalMapObjectModelConnectorFoundation : public UPalMapObjectModelConnectorBase
{
public:
	struct FPalMapObjectModelConnectInfo         FrontConnectInfo;                                  // 0x48(0x18)(Edit, Net, DisableEditOnTemplate, Transient, EditConst, NativeAccessSpecifierPrivate)
	struct FPalMapObjectModelConnectInfo         BackConnectInfo;                                   // 0x60(0x18)(Edit, Net, DisableEditOnTemplate, Transient, EditConst, NativeAccessSpecifierPrivate)
	struct FPalMapObjectModelConnectInfo         LeftConnectInfo;                                   // 0x78(0x18)(Edit, Net, DisableEditOnTemplate, Transient, EditConst, NativeAccessSpecifierPrivate)
	struct FPalMapObjectModelConnectInfo         RightConnectInfo;                                  // 0x90(0x18)(Edit, Net, DisableEditOnTemplate, Transient, EditConst, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UPalMapObjectModelConnectorFoundation* GetDefaultObj();

};

// 0x30 (0x68 - 0x38)
// Class Pal.PalBuildObjectInstallStrategyGroundWall
class UPalBuildObjectInstallStrategyGroundWall : public UPalBuildObjectInstallStrategyBase
{
public:
	class AActor*                                HitActorCache;                                     // 0x38(0x8)(ZeroConstructor, Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class APalBuildObject*                       HitBuildObjectCache;                               // 0x40(0x8)(ZeroConstructor, Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_3484[0x20];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UPalBuildObjectInstallStrategyGroundWall* GetDefaultObj();

};

// 0x0 (0x38 - 0x38)
// Class Pal.PalBuildObjectInstallStrategyNormal
class UPalBuildObjectInstallStrategyNormal : public UPalBuildObjectInstallStrategyBase
{
public:

	static class UClass* StaticClass();
	static class UPalBuildObjectInstallStrategyNormal* GetDefaultObj();

};

// 0x8 (0x40 - 0x38)
// Class Pal.PalBuildObjectInstallStrategyPalStorage
class UPalBuildObjectInstallStrategyPalStorage : public UPalBuildObjectInstallStrategySinkableNormal
{
public:
	class APalBuildObjectPalStorage*             TargetPalStorageCache;                             // 0x38(0x8)(Edit, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UPalBuildObjectInstallStrategyPalStorage* GetDefaultObj();

};

// 0x18 (0x50 - 0x38)
// Class Pal.PalBuildObjectInstallStrategyRoof
class UPalBuildObjectInstallStrategyRoof : public UPalBuildObjectInstallStrategyBase
{
public:
	class AActor*                                HitActorCache;                                     // 0x38(0x8)(ZeroConstructor, Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class APalBuildObject*                       HitBuildObjectCache;                               // 0x40(0x8)(ZeroConstructor, Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_348E[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UPalBuildObjectInstallStrategyRoof* GetDefaultObj();

};

// 0x60 (0xA8 - 0x48)
// Class Pal.PalMapObjectModelConnectorRoof
class UPalMapObjectModelConnectorRoof : public UPalMapObjectModelConnectorBase
{
public:
	struct FPalMapObjectModelConnectInfo         FrontConnectInfo;                                  // 0x48(0x18)(Edit, Net, DisableEditOnTemplate, Transient, EditConst, NativeAccessSpecifierPrivate)
	struct FPalMapObjectModelConnectInfo         BackConnectInfo;                                   // 0x60(0x18)(Edit, Net, DisableEditOnTemplate, Transient, EditConst, NativeAccessSpecifierPrivate)
	struct FPalMapObjectModelConnectInfo         LeftConnectInfo;                                   // 0x78(0x18)(Edit, Net, DisableEditOnTemplate, Transient, EditConst, NativeAccessSpecifierPrivate)
	struct FPalMapObjectModelConnectInfo         RightConnectInfo;                                  // 0x90(0x18)(Edit, Net, DisableEditOnTemplate, Transient, EditConst, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UPalMapObjectModelConnectorRoof* GetDefaultObj();

};

// 0x18 (0x50 - 0x38)
// Class Pal.PalBuildObjectInstallStrategyStairs
class UPalBuildObjectInstallStrategyStairs : public UPalBuildObjectInstallStrategyBase
{
public:
	class AActor*                                HitActorCache;                                     // 0x38(0x8)(ZeroConstructor, Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class APalBuildObject*                       HitBuildObjectCache;                               // 0x40(0x8)(ZeroConstructor, Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_34A1[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UPalBuildObjectInstallStrategyStairs* GetDefaultObj();

};

// 0x30 (0x78 - 0x48)
// Class Pal.PalMapObjectModelConnectorStair
class UPalMapObjectModelConnectorStair : public UPalMapObjectModelConnectorBase
{
public:
	struct FPalMapObjectModelConnectInfo         UpConnectInfo;                                     // 0x48(0x18)(Edit, Net, DisableEditOnTemplate, Transient, EditConst, NativeAccessSpecifierPrivate)
	struct FPalMapObjectModelConnectInfo         DownConnectInfo;                                   // 0x60(0x18)(Edit, Net, DisableEditOnTemplate, Transient, EditConst, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UPalMapObjectModelConnectorStair* GetDefaultObj();

};

// 0x30 (0x68 - 0x38)
// Class Pal.PalBuildObjectInstallStrategyWall
class UPalBuildObjectInstallStrategyWall : public UPalBuildObjectInstallStrategyBase
{
public:
	class AActor*                                HitActorCache;                                     // 0x38(0x8)(ZeroConstructor, Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class APalBuildObject*                       HitBuildObjectCache;                               // 0x40(0x8)(ZeroConstructor, Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_34AF[0x20];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UPalBuildObjectInstallStrategyWall* GetDefaultObj();

};

// 0x30 (0x68 - 0x38)
// Class Pal.PalBuildObjectInstallStrategyWallV2
class UPalBuildObjectInstallStrategyWallV2 : public UPalBuildObjectInstallStrategyBase
{
public:
	class AActor*                                HitActorCache;                                     // 0x38(0x8)(ZeroConstructor, Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class APalBuildObject*                       HitBuildObjectCache;                               // 0x40(0x8)(ZeroConstructor, Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_34BA[0x20];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UPalBuildObjectInstallStrategyWallV2* GetDefaultObj();

};

// 0x30 (0x78 - 0x48)
// Class Pal.PalMapObjectModelConnectorWallV2
class UPalMapObjectModelConnectorWallV2 : public UPalMapObjectModelConnectorBase
{
public:
	struct FPalMapObjectModelConnectInfo         UpConnectInfo;                                     // 0x48(0x18)(Edit, Net, DisableEditOnTemplate, Transient, EditConst, NativeAccessSpecifierPrivate)
	struct FPalMapObjectModelConnectInfo         DownConnectInfo;                                   // 0x60(0x18)(Edit, Net, DisableEditOnTemplate, Transient, EditConst, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UPalMapObjectModelConnectorWallV2* GetDefaultObj();

};

// 0x28 (0x598 - 0x570)
// Class Pal.PalBuildObjectMonsterFarm
class APalBuildObjectMonsterFarm : public APalBuildObject
{
public:
	struct FComponentReference                   WalkAroundVolumeRef;                               // 0x570(0x28)(Edit, BlueprintVisible, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class APalBuildObjectMonsterFarm* GetDefaultObj();

};

// 0x50 (0x78 - 0x28)
// Class Pal.PalBuildObjectOverlapChecker
class UPalBuildObjectOverlapChecker : public UObject
{
public:
	uint8                                        Pad_34EA[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UShapeComponent*                       Collision;                                         // 0x30(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class APalBuildObject*                       Owner;                                             // 0x38(0x8)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class APalBuildObject*>               OverlapBuildObjects;                               // 0x40(0x10)(Edit, ZeroConstructor, Transient, EditConst, NativeAccessSpecifierPrivate)
	TArray<class UObject*>                       OverlapOtherObjects;                               // 0x50(0x10)(Edit, ZeroConstructor, Transient, EditConst, NativeAccessSpecifierPrivate)
	class AActor*                                OverlappedActor;                                   // 0x60(0x8)(Edit, ZeroConstructor, Transient, EditConst, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class FName>                          AllowOverlapCollisionPresetNames;                  // 0x68(0x10)(Edit, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UPalBuildObjectOverlapChecker* GetDefaultObj();

	void OnOverlapEnd(class UPrimitiveComponent* OverlappedComp, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void OnOverlapBegin(class UPrimitiveComponent* OverlappedComp, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, struct FHitResult& SweepResult);
};

// 0x148 (0x6B8 - 0x570)
// Class Pal.PalBuildObjectPalStorage
class APalBuildObjectPalStorage : public APalBuildObject
{
public:
	FMulticastInlineDelegateProperty_            OnOverlapBeginCageArea;                            // 0x570(0x10)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, InstancedReference, BlueprintCallable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnOverlapEndCageArea;                              // 0x580(0x10)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, InstancedReference, BlueprintCallable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnOverlapBeginCageWalls;                           // 0x590(0x10)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, InstancedReference, BlueprintCallable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnOverlapEndCageWalls;                             // 0x5A0(0x10)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, InstancedReference, BlueprintCallable, NativeAccessSpecifierPublic)
	float                                        BaseCampAreaRange;                                 // 0x5B0(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_352D[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FComponentReference                   AccessPointObjectRef;                              // 0x5B8(0x28)(Edit, BlueprintVisible, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FComponentReference                   AccessPointMovableRangeRef;                        // 0x5E0(0x28)(Edit, BlueprintVisible, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FComponentReference                   AccessPointInteractRef;                            // 0x608(0x28)(Edit, BlueprintVisible, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FComponentReference                   ChestObjectRef;                                    // 0x630(0x28)(Edit, BlueprintVisible, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FComponentReference                   ChestMovableRangeRef;                              // 0x658(0x28)(Edit, BlueprintVisible, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FComponentReference                   ChestInteractRef;                                  // 0x680(0x28)(Edit, BlueprintVisible, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	class FName                                  ChestWorkableBoundsName;                           // 0x6A8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        ChestSlotNum;                                      // 0x6B0(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_3532[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class APalBuildObjectPalStorage* GetDefaultObj();

	void PlaySpawnCharacterFX(class APalCharacter* TargetActor);
	void OverlapAreaDelegate__DelegateSignature(class UPrimitiveComponent* OverlappedComp, class AActor* OtherActor, class UPrimitiveComponent* OtherComp);
	void OnSpawnCharacter(const struct FPalInstanceID& IndividualId, int32 PhantomId);
	struct FTransform GetWorkerSpawnLocalTransform();
	struct FTransform GetFastTravelLocalTransform();
	struct FTransform GetDisplayCharacterSpawnLocalTransform();
	class USceneComponent* GetChestObject();
	class UBoxComponent* GetChestMovableRange();
	class UShapeComponent* GetCageAreaShape();
	class UStaticMeshComponent* GetAccessPointObject();
	class UBoxComponent* GetAccessPointMovableRange();
};

// 0xC0 (0x160 - 0xA0)
// Class Pal.PalBuildObjectVisualControlComponent
class UPalBuildObjectVisualControlComponent : public UActorComponent
{
public:
	TMap<class UMeshComponent*, struct FPalBuildObjectMaterialArray> NormalMaterialMapCache;                            // 0xA0(0x50)(Transient, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	TMap<class UDecalComponent*, class UMaterialInterface*> DecalNormalMaterialMapCache;                       // 0xF0(0x50)(Transient, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	uint8                                        Pad_353F[0x18];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	class UNiagaraComponent*                     DamageNiagaraComp;                                 // 0x158(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UPalBuildObjectVisualControlComponent* GetDefaultObj();

};

// 0x60 (0x88 - 0x28)
// Class Pal.PalBuildOperator
class UPalBuildOperator : public UObject
{
public:
	FMulticastInlineDelegateProperty_            OnCompleteBuildInServerDelegate;                   // 0x28(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	struct FBuildingSurfaceMaterialSet           BuildingSurfaceMaterialSet;                        // 0x38(0x38)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	class UPalBuildObjectDataMap*                DataMap;                                           // 0x70(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class APalBuildObject*>               BuildObjects;                                      // 0x78(0x10)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UPalBuildOperator* GetDefaultObj();

};

// 0x40 (0x68 - 0x28)
// Class Pal.PalBuildProcess
class UPalBuildProcess : public UObject
{
public:
	FMulticastInlineDelegateProperty_            OnUpdateStateDelegate;                             // 0x28(0x10)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnFinishBuildDelegate;                             // 0x38(0x10)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	enum class EPalBuildProcessState             State;                                             // 0x48(0x1)(Edit, Net, ZeroConstructor, DisableEditOnTemplate, EditConst, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_3572[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UPalWorkProgress*                      BuildWork;                                         // 0x50(0x8)(Edit, Net, ZeroConstructor, DisableEditOnTemplate, EditConst, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_3573[0x10];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UPalBuildProcess* GetDefaultObj();

	void UpdateStateDelegate__DelegateSignature(class UPalBuildProcess* BuildProcess);
	void OnRep_StateChanged();
	void OnRep_BuildWork();
	void OnReflectFinishBuildWork(class UPalWorkBase* Work);
	void OnFinishWorkInServer(class UPalWorkBase* Work);
	bool IsCompleted();
	class UPalWorkProgress* GetWorkProgress();
};

// 0xD8 (0x368 - 0x290)
// Class Pal.PalBullet
class APalBullet : public AActor
{
public:
	FMulticastInlineDelegateProperty_            OnDestroyDelegate;                                 // 0x290(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	class USphereComponent*                      CollisionComp;                                     // 0x2A0(0x8)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UProjectileMovementComponent*          ProjectileMovement;                                // 0x2A8(0x8)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EPalPlayerDamageCameraShakeCategory PlayerDamageCameraShake;                           // 0x2B0(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bIsHitFriend;                                      // 0x2B1(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_35F0[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        WeaponDamage;                                      // 0x2B4(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FTimerHandle                          Handle;                                            // 0x2B8(0x8)(Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         IsDamageable;                                      // 0x2C0(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         AISoundEmitable;                                   // 0x2C1(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_35F1[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        SneakAttackRate;                                   // 0x2C4(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        DeleteTime;                                        // 0x2C8(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        DamageDecayStartRate;                              // 0x2CC(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        LifeTimer;                                         // 0x2D0(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	enum class EPalDamageAnimationReactionType   WeaponBulletDamageReactionType;                    // 0x2D4(0x1)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_35F2[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
