#pragma once

// Dumped with Dumper-7!


#include "../SDK.hpp"

namespace SDK
{
namespace Params
{
//---------------------------------------------------------------------------------------------------------------------
// PARAMETERS
//---------------------------------------------------------------------------------------------------------------------

// 0x18 (0x18 - 0x0)
// Function Pal.FixedPoint64MathLibrary.Subtract_FixedPoint64Integer
struct UFixedPoint64MathLibrary_Subtract_FixedPoint64Integer_Params
{
public:
	struct FFixedPoint64                         A;                                                 // 0x0(0x8)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	int64                                        B;                                                 // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFixedPoint64                         ReturnValue;                                       // 0x10(0x8)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function Pal.FixedPoint64MathLibrary.Subtract_FixedPoint64Float
struct UFixedPoint64MathLibrary_Subtract_FixedPoint64Float_Params
{
public:
	struct FFixedPoint64                         A;                                                 // 0x0(0x8)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	float                                        B;                                                 // 0x8(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1C66[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FFixedPoint64                         ReturnValue;                                       // 0x10(0x8)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function Pal.FixedPoint64MathLibrary.Subtract_FixedPoint64FixedPoint64
struct UFixedPoint64MathLibrary_Subtract_FixedPoint64FixedPoint64_Params
{
public:
	struct FFixedPoint64                         A;                                                 // 0x0(0x8)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	struct FFixedPoint64                         B;                                                 // 0x8(0x8)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	struct FFixedPoint64                         ReturnValue;                                       // 0x10(0x8)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function Pal.FixedPoint64MathLibrary.NotEqual_FixedPoint64Integer
struct UFixedPoint64MathLibrary_NotEqual_FixedPoint64Integer_Params
{
public:
	struct FFixedPoint64                         A;                                                 // 0x0(0x8)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	int64                                        B;                                                 // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x10(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1C6F[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x10 (0x10 - 0x0)
// Function Pal.FixedPoint64MathLibrary.NotEqual_FixedPoint64Float
struct UFixedPoint64MathLibrary_NotEqual_FixedPoint64Float_Params
{
public:
	struct FFixedPoint64                         A;                                                 // 0x0(0x8)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	float                                        B;                                                 // 0x8(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0xC(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1C76[0x3];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x18 (0x18 - 0x0)
// Function Pal.FixedPoint64MathLibrary.NotEqual_FixedPoint64FixedPoint64
struct UFixedPoint64MathLibrary_NotEqual_FixedPoint64FixedPoint64_Params
{
public:
	struct FFixedPoint64                         A;                                                 // 0x0(0x8)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	struct FFixedPoint64                         B;                                                 // 0x8(0x8)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x10(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1C7E[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x18 (0x18 - 0x0)
// Function Pal.FixedPoint64MathLibrary.Multiply_FixedPoint64Integer
struct UFixedPoint64MathLibrary_Multiply_FixedPoint64Integer_Params
{
public:
	struct FFixedPoint64                         A;                                                 // 0x0(0x8)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	int64                                        B;                                                 // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFixedPoint64                         ReturnValue;                                       // 0x10(0x8)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function Pal.FixedPoint64MathLibrary.Multiply_FixedPoint64Float
struct UFixedPoint64MathLibrary_Multiply_FixedPoint64Float_Params
{
public:
	struct FFixedPoint64                         A;                                                 // 0x0(0x8)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	float                                        B;                                                 // 0x8(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1C96[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FFixedPoint64                         ReturnValue;                                       // 0x10(0x8)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function Pal.FixedPoint64MathLibrary.Multiply_FixedPoint64FixedPoint64
struct UFixedPoint64MathLibrary_Multiply_FixedPoint64FixedPoint64_Params
{
public:
	struct FFixedPoint64                         A;                                                 // 0x0(0x8)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	struct FFixedPoint64                         B;                                                 // 0x8(0x8)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	struct FFixedPoint64                         ReturnValue;                                       // 0x10(0x8)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function Pal.FixedPoint64MathLibrary.LessEqual_FixedPoint64Integer
struct UFixedPoint64MathLibrary_LessEqual_FixedPoint64Integer_Params
{
public:
	struct FFixedPoint64                         A;                                                 // 0x0(0x8)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	int64                                        B;                                                 // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x10(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1CA3[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x10 (0x10 - 0x0)
// Function Pal.FixedPoint64MathLibrary.LessEqual_FixedPoint64Float
struct UFixedPoint64MathLibrary_LessEqual_FixedPoint64Float_Params
{
public:
	struct FFixedPoint64                         A;                                                 // 0x0(0x8)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	float                                        B;                                                 // 0x8(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0xC(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1CAB[0x3];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x18 (0x18 - 0x0)
// Function Pal.FixedPoint64MathLibrary.LessEqual_FixedPoint64FixedPoint64
struct UFixedPoint64MathLibrary_LessEqual_FixedPoint64FixedPoint64_Params
{
public:
	struct FFixedPoint64                         A;                                                 // 0x0(0x8)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	struct FFixedPoint64                         B;                                                 // 0x8(0x8)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x10(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1CAF[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x18 (0x18 - 0x0)
// Function Pal.FixedPoint64MathLibrary.Less_FixedPoint64Integer
struct UFixedPoint64MathLibrary_Less_FixedPoint64Integer_Params
{
public:
	struct FFixedPoint64                         A;                                                 // 0x0(0x8)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	int64                                        B;                                                 // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x10(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1CBC[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x10 (0x10 - 0x0)
// Function Pal.FixedPoint64MathLibrary.Less_FixedPoint64Float
struct UFixedPoint64MathLibrary_Less_FixedPoint64Float_Params
{
public:
	struct FFixedPoint64                         A;                                                 // 0x0(0x8)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	float                                        B;                                                 // 0x8(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0xC(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1CC3[0x3];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x18 (0x18 - 0x0)
// Function Pal.FixedPoint64MathLibrary.Less_FixedPoint64FixedPoint64
struct UFixedPoint64MathLibrary_Less_FixedPoint64FixedPoint64_Params
{
public:
	struct FFixedPoint64                         A;                                                 // 0x0(0x8)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	struct FFixedPoint64                         B;                                                 // 0x8(0x8)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x10(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1CCE[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x18 (0x18 - 0x0)
// Function Pal.FixedPoint64MathLibrary.GreaterEqual_FixedPoint64Integer
struct UFixedPoint64MathLibrary_GreaterEqual_FixedPoint64Integer_Params
{
public:
	struct FFixedPoint64                         A;                                                 // 0x0(0x8)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	int64                                        B;                                                 // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x10(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1CD8[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x10 (0x10 - 0x0)
// Function Pal.FixedPoint64MathLibrary.GreaterEqual_FixedPoint64Float
struct UFixedPoint64MathLibrary_GreaterEqual_FixedPoint64Float_Params
{
public:
	struct FFixedPoint64                         A;                                                 // 0x0(0x8)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	float                                        B;                                                 // 0x8(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0xC(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1CDE[0x3];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x18 (0x18 - 0x0)
// Function Pal.FixedPoint64MathLibrary.GreaterEqual_FixedPoint64FixedPoint64
struct UFixedPoint64MathLibrary_GreaterEqual_FixedPoint64FixedPoint64_Params
{
public:
	struct FFixedPoint64                         A;                                                 // 0x0(0x8)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	struct FFixedPoint64                         B;                                                 // 0x8(0x8)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x10(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1CE5[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x18 (0x18 - 0x0)
// Function Pal.FixedPoint64MathLibrary.Greater_FixedPoint64Integer
struct UFixedPoint64MathLibrary_Greater_FixedPoint64Integer_Params
{
public:
	struct FFixedPoint64                         A;                                                 // 0x0(0x8)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	int64                                        B;                                                 // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x10(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1CF1[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x10 (0x10 - 0x0)
// Function Pal.FixedPoint64MathLibrary.Greater_FixedPoint64Float
struct UFixedPoint64MathLibrary_Greater_FixedPoint64Float_Params
{
public:
	struct FFixedPoint64                         A;                                                 // 0x0(0x8)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	float                                        B;                                                 // 0x8(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0xC(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1CF8[0x3];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x18 (0x18 - 0x0)
// Function Pal.FixedPoint64MathLibrary.Greater_FixedPoint64FixedPoint64
struct UFixedPoint64MathLibrary_Greater_FixedPoint64FixedPoint64_Params
{
public:
	struct FFixedPoint64                         A;                                                 // 0x0(0x8)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	struct FFixedPoint64                         B;                                                 // 0x8(0x8)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x10(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1D03[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x18 (0x18 - 0x0)
// Function Pal.FixedPoint64MathLibrary.EqualEqual_FixedPoint64Integer
struct UFixedPoint64MathLibrary_EqualEqual_FixedPoint64Integer_Params
{
public:
	struct FFixedPoint64                         A;                                                 // 0x0(0x8)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	int64                                        B;                                                 // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x10(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1D0A[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x10 (0x10 - 0x0)
// Function Pal.FixedPoint64MathLibrary.EqualEqual_FixedPoint64Float
struct UFixedPoint64MathLibrary_EqualEqual_FixedPoint64Float_Params
{
public:
	struct FFixedPoint64                         A;                                                 // 0x0(0x8)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	float                                        B;                                                 // 0x8(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0xC(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1D11[0x3];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x18 (0x18 - 0x0)
// Function Pal.FixedPoint64MathLibrary.EqualEqual_FixedPoint64FixedPoint64
struct UFixedPoint64MathLibrary_EqualEqual_FixedPoint64FixedPoint64_Params
{
public:
	struct FFixedPoint64                         A;                                                 // 0x0(0x8)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	struct FFixedPoint64                         B;                                                 // 0x8(0x8)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x10(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1D1C[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x18 (0x18 - 0x0)
// Function Pal.FixedPoint64MathLibrary.Divide_FixedPoint64Integer
struct UFixedPoint64MathLibrary_Divide_FixedPoint64Integer_Params
{
public:
	struct FFixedPoint64                         A;                                                 // 0x0(0x8)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	int64                                        B;                                                 // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFixedPoint64                         ReturnValue;                                       // 0x10(0x8)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function Pal.FixedPoint64MathLibrary.Divide_FixedPoint64Float
struct UFixedPoint64MathLibrary_Divide_FixedPoint64Float_Params
{
public:
	struct FFixedPoint64                         A;                                                 // 0x0(0x8)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	float                                        B;                                                 // 0x8(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1D2A[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FFixedPoint64                         ReturnValue;                                       // 0x10(0x8)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function Pal.FixedPoint64MathLibrary.Divide_FixedPoint64FixedPoint64
struct UFixedPoint64MathLibrary_Divide_FixedPoint64FixedPoint64_Params
{
public:
	struct FFixedPoint64                         A;                                                 // 0x0(0x8)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	struct FFixedPoint64                         B;                                                 // 0x8(0x8)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	struct FFixedPoint64                         ReturnValue;                                       // 0x10(0x8)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Pal.FixedPoint64MathLibrary.Convert_IntToFixedPoint64
struct UFixedPoint64MathLibrary_Convert_IntToFixedPoint64_Params
{
public:
	int32                                        Value;                                             // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1D3A[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FFixedPoint64                         ReturnValue;                                       // 0x8(0x8)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Pal.FixedPoint64MathLibrary.Convert_Int64ToFixedPoint64
struct UFixedPoint64MathLibrary_Convert_Int64ToFixedPoint64_Params
{
public:
	int64                                        Value;                                             // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFixedPoint64                         ReturnValue;                                       // 0x8(0x8)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Pal.FixedPoint64MathLibrary.Convert_FloatToFixedPoint64
struct UFixedPoint64MathLibrary_Convert_FloatToFixedPoint64_Params
{
public:
	float                                        Value;                                             // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1D49[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FFixedPoint64                         ReturnValue;                                       // 0x8(0x8)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Pal.FixedPoint64MathLibrary.Convert_FixedPoint64ToInt64
struct UFixedPoint64MathLibrary_Convert_FixedPoint64ToInt64_Params
{
public:
	struct FFixedPoint64                         Value;                                             // 0x0(0x8)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	int64                                        ReturnValue;                                       // 0x8(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Pal.FixedPoint64MathLibrary.Convert_FixedPoint64ToInt
struct UFixedPoint64MathLibrary_Convert_FixedPoint64ToInt_Params
{
public:
	struct FFixedPoint64                         Value;                                             // 0x0(0x8)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	int32                                        ReturnValue;                                       // 0x8(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1D59[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x10 (0x10 - 0x0)
// Function Pal.FixedPoint64MathLibrary.Convert_FixedPoint64ToFloat
struct UFixedPoint64MathLibrary_Convert_FixedPoint64ToFloat_Params
{
public:
	struct FFixedPoint64                         Value;                                             // 0x0(0x8)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	float                                        ReturnValue;                                       // 0x8(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1D5F[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x18 (0x18 - 0x0)
// Function Pal.FixedPoint64MathLibrary.Add_FixedPoint64Integer
struct UFixedPoint64MathLibrary_Add_FixedPoint64Integer_Params
{
public:
	struct FFixedPoint64                         A;                                                 // 0x0(0x8)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	int64                                        B;                                                 // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFixedPoint64                         ReturnValue;                                       // 0x10(0x8)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function Pal.FixedPoint64MathLibrary.Add_FixedPoint64Float
struct UFixedPoint64MathLibrary_Add_FixedPoint64Float_Params
{
public:
	struct FFixedPoint64                         A;                                                 // 0x0(0x8)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	float                                        B;                                                 // 0x8(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1D69[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FFixedPoint64                         ReturnValue;                                       // 0x10(0x8)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function Pal.FixedPoint64MathLibrary.Add_FixedPoint64FixedPoint64
struct UFixedPoint64MathLibrary_Add_FixedPoint64FixedPoint64_Params
{
public:
	struct FFixedPoint64                         A;                                                 // 0x0(0x8)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	struct FFixedPoint64                         B;                                                 // 0x8(0x8)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	struct FFixedPoint64                         ReturnValue;                                       // 0x10(0x8)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};

// 0xC (0xC - 0x0)
// Function Pal.FixedPointMathLibrary.Subtract_FixedPointInteger
struct UFixedPointMathLibrary_Subtract_FixedPointInteger_Params
{
public:
	struct FFixedPoint                           A;                                                 // 0x0(0x4)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	int32                                        B;                                                 // 0x4(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFixedPoint                           ReturnValue;                                       // 0x8(0x4)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};

// 0xC (0xC - 0x0)
// Function Pal.FixedPointMathLibrary.Subtract_FixedPointFloat
struct UFixedPointMathLibrary_Subtract_FixedPointFloat_Params
{
public:
	struct FFixedPoint                           A;                                                 // 0x0(0x4)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	float                                        B;                                                 // 0x4(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFixedPoint                           ReturnValue;                                       // 0x8(0x4)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};

// 0xC (0xC - 0x0)
// Function Pal.FixedPointMathLibrary.Subtract_FixedPointFixedPoint
struct UFixedPointMathLibrary_Subtract_FixedPointFixedPoint_Params
{
public:
	struct FFixedPoint                           A;                                                 // 0x0(0x4)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	struct FFixedPoint                           B;                                                 // 0x4(0x4)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	struct FFixedPoint                           ReturnValue;                                       // 0x8(0x4)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};

// 0xC (0xC - 0x0)
// Function Pal.FixedPointMathLibrary.NotEqual_FixedPointInteger
struct UFixedPointMathLibrary_NotEqual_FixedPointInteger_Params
{
public:
	struct FFixedPoint                           A;                                                 // 0x0(0x4)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	int32                                        B;                                                 // 0x4(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x8(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1DD0[0x3];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0xC (0xC - 0x0)
// Function Pal.FixedPointMathLibrary.NotEqual_FixedPointFloat
struct UFixedPointMathLibrary_NotEqual_FixedPointFloat_Params
{
public:
	struct FFixedPoint                           A;                                                 // 0x0(0x4)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	float                                        B;                                                 // 0x4(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x8(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1DDA[0x3];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0xC (0xC - 0x0)
// Function Pal.FixedPointMathLibrary.NotEqual_FixedPointFixedPoint
struct UFixedPointMathLibrary_NotEqual_FixedPointFixedPoint_Params
{
public:
	struct FFixedPoint                           A;                                                 // 0x0(0x4)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	struct FFixedPoint                           B;                                                 // 0x4(0x4)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x8(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1DE5[0x3];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0xC (0xC - 0x0)
// Function Pal.FixedPointMathLibrary.Multiply_FixedPointInteger
struct UFixedPointMathLibrary_Multiply_FixedPointInteger_Params
{
public:
	struct FFixedPoint                           A;                                                 // 0x0(0x4)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	int32                                        B;                                                 // 0x4(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFixedPoint                           ReturnValue;                                       // 0x8(0x4)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};

// 0xC (0xC - 0x0)
// Function Pal.FixedPointMathLibrary.Multiply_FixedPointFloat
struct UFixedPointMathLibrary_Multiply_FixedPointFloat_Params
{
public:
	struct FFixedPoint                           A;                                                 // 0x0(0x4)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	float                                        B;                                                 // 0x4(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFixedPoint                           ReturnValue;                                       // 0x8(0x4)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};

// 0xC (0xC - 0x0)
// Function Pal.FixedPointMathLibrary.Multiply_FixedPointFixedPoint
struct UFixedPointMathLibrary_Multiply_FixedPointFixedPoint_Params
{
public:
	struct FFixedPoint                           A;                                                 // 0x0(0x4)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	struct FFixedPoint                           B;                                                 // 0x4(0x4)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	struct FFixedPoint                           ReturnValue;                                       // 0x8(0x4)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};

// 0xC (0xC - 0x0)
// Function Pal.FixedPointMathLibrary.LessEqual_FixedPointInteger
struct UFixedPointMathLibrary_LessEqual_FixedPointInteger_Params
{
public:
	struct FFixedPoint                           A;                                                 // 0x0(0x4)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	int32                                        B;                                                 // 0x4(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x8(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1DF8[0x3];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0xC (0xC - 0x0)
// Function Pal.FixedPointMathLibrary.LessEqual_FixedPointFloat
struct UFixedPointMathLibrary_LessEqual_FixedPointFloat_Params
{
public:
	struct FFixedPoint                           A;                                                 // 0x0(0x4)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	float                                        B;                                                 // 0x4(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x8(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1DFF[0x3];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0xC (0xC - 0x0)
// Function Pal.FixedPointMathLibrary.LessEqual_FixedPointFixedPoint
struct UFixedPointMathLibrary_LessEqual_FixedPointFixedPoint_Params
{
public:
	struct FFixedPoint                           A;                                                 // 0x0(0x4)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	struct FFixedPoint                           B;                                                 // 0x4(0x4)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x8(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1E03[0x3];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0xC (0xC - 0x0)
// Function Pal.FixedPointMathLibrary.Less_FixedPointInteger
struct UFixedPointMathLibrary_Less_FixedPointInteger_Params
{
public:
	struct FFixedPoint                           A;                                                 // 0x0(0x4)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	int32                                        B;                                                 // 0x4(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x8(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1E0C[0x3];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0xC (0xC - 0x0)
// Function Pal.FixedPointMathLibrary.Less_FixedPointFloat
struct UFixedPointMathLibrary_Less_FixedPointFloat_Params
{
public:
	struct FFixedPoint                           A;                                                 // 0x0(0x4)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	float                                        B;                                                 // 0x4(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x8(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1E11[0x3];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0xC (0xC - 0x0)
// Function Pal.FixedPointMathLibrary.Less_FixedPointFixedPoint
struct UFixedPointMathLibrary_Less_FixedPointFixedPoint_Params
{
public:
	struct FFixedPoint                           A;                                                 // 0x0(0x4)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	struct FFixedPoint                           B;                                                 // 0x4(0x4)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x8(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1E19[0x3];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0xC (0xC - 0x0)
// Function Pal.FixedPointMathLibrary.GreaterEqual_FixedPointInteger
struct UFixedPointMathLibrary_GreaterEqual_FixedPointInteger_Params
{
public:
	struct FFixedPoint                           A;                                                 // 0x0(0x4)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	int32                                        B;                                                 // 0x4(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x8(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1E2E[0x3];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0xC (0xC - 0x0)
// Function Pal.FixedPointMathLibrary.GreaterEqual_FixedPointFloat
struct UFixedPointMathLibrary_GreaterEqual_FixedPointFloat_Params
{
public:
	struct FFixedPoint                           A;                                                 // 0x0(0x4)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	float                                        B;                                                 // 0x4(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x8(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1E34[0x3];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0xC (0xC - 0x0)
// Function Pal.FixedPointMathLibrary.GreaterEqual_FixedPointFixedPoint
struct UFixedPointMathLibrary_GreaterEqual_FixedPointFixedPoint_Params
{
public:
	struct FFixedPoint                           A;                                                 // 0x0(0x4)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	struct FFixedPoint                           B;                                                 // 0x4(0x4)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x8(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1E3A[0x3];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0xC (0xC - 0x0)
// Function Pal.FixedPointMathLibrary.Greater_FixedPointInteger
struct UFixedPointMathLibrary_Greater_FixedPointInteger_Params
{
public:
	struct FFixedPoint                           A;                                                 // 0x0(0x4)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	int32                                        B;                                                 // 0x4(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x8(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1E3D[0x3];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0xC (0xC - 0x0)
// Function Pal.FixedPointMathLibrary.Greater_FixedPointFloat
struct UFixedPointMathLibrary_Greater_FixedPointFloat_Params
{
public:
	struct FFixedPoint                           A;                                                 // 0x0(0x4)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	float                                        B;                                                 // 0x4(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x8(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1E43[0x3];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0xC (0xC - 0x0)
// Function Pal.FixedPointMathLibrary.Greater_FixedPointFixedPoint
struct UFixedPointMathLibrary_Greater_FixedPointFixedPoint_Params
{
public:
	struct FFixedPoint                           A;                                                 // 0x0(0x4)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	struct FFixedPoint                           B;                                                 // 0x4(0x4)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x8(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1E4F[0x3];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0xC (0xC - 0x0)
// Function Pal.FixedPointMathLibrary.EqualEqual_FixedPointInteger
struct UFixedPointMathLibrary_EqualEqual_FixedPointInteger_Params
{
public:
	struct FFixedPoint                           A;                                                 // 0x0(0x4)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	int32                                        B;                                                 // 0x4(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x8(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1E55[0x3];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0xC (0xC - 0x0)
// Function Pal.FixedPointMathLibrary.EqualEqual_FixedPointFloat
struct UFixedPointMathLibrary_EqualEqual_FixedPointFloat_Params
{
public:
	struct FFixedPoint                           A;                                                 // 0x0(0x4)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	float                                        B;                                                 // 0x4(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x8(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1E5A[0x3];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0xC (0xC - 0x0)
// Function Pal.FixedPointMathLibrary.EqualEqual_FixedPointFixedPoint
struct UFixedPointMathLibrary_EqualEqual_FixedPointFixedPoint_Params
{
public:
	struct FFixedPoint                           A;                                                 // 0x0(0x4)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	struct FFixedPoint                           B;                                                 // 0x4(0x4)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x8(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1E5E[0x3];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0xC (0xC - 0x0)
// Function Pal.FixedPointMathLibrary.Divide_FixedPointInteger
struct UFixedPointMathLibrary_Divide_FixedPointInteger_Params
{
public:
	struct FFixedPoint                           A;                                                 // 0x0(0x4)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	int32                                        B;                                                 // 0x4(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFixedPoint                           ReturnValue;                                       // 0x8(0x4)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};

// 0xC (0xC - 0x0)
// Function Pal.FixedPointMathLibrary.Divide_FixedPointFloat
struct UFixedPointMathLibrary_Divide_FixedPointFloat_Params
{
public:
	struct FFixedPoint                           A;                                                 // 0x0(0x4)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	float                                        B;                                                 // 0x4(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFixedPoint                           ReturnValue;                                       // 0x8(0x4)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};

// 0xC (0xC - 0x0)
// Function Pal.FixedPointMathLibrary.Divide_FixedPointFixedPoint
struct UFixedPointMathLibrary_Divide_FixedPointFixedPoint_Params
{
public:
	struct FFixedPoint                           A;                                                 // 0x0(0x4)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	struct FFixedPoint                           B;                                                 // 0x4(0x4)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	struct FFixedPoint                           ReturnValue;                                       // 0x8(0x4)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Pal.FixedPointMathLibrary.Convert_IntToFixedPoint
struct UFixedPointMathLibrary_Convert_IntToFixedPoint_Params
{
public:
	int32                                        Value;                                             // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFixedPoint                           ReturnValue;                                       // 0x4(0x4)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Pal.FixedPointMathLibrary.Convert_FloatToFixedPoint
struct UFixedPointMathLibrary_Convert_FloatToFixedPoint_Params
{
public:
	float                                        Value;                                             // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFixedPoint                           ReturnValue;                                       // 0x4(0x4)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Pal.FixedPointMathLibrary.Convert_FixedPointToInt
struct UFixedPointMathLibrary_Convert_FixedPointToInt_Params
{
public:
	struct FFixedPoint                           Value;                                             // 0x0(0x4)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	int32                                        ReturnValue;                                       // 0x4(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Pal.FixedPointMathLibrary.Convert_FixedPointToFloat
struct UFixedPointMathLibrary_Convert_FixedPointToFloat_Params
{
public:
	struct FFixedPoint                           Value;                                             // 0x0(0x4)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	float                                        ReturnValue;                                       // 0x4(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0xC (0xC - 0x0)
// Function Pal.FixedPointMathLibrary.Add_FixedPointInteger
struct UFixedPointMathLibrary_Add_FixedPointInteger_Params
{
public:
	struct FFixedPoint                           A;                                                 // 0x0(0x4)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	int32                                        B;                                                 // 0x4(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFixedPoint                           ReturnValue;                                       // 0x8(0x4)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};

// 0xC (0xC - 0x0)
// Function Pal.FixedPointMathLibrary.Add_FixedPointFloat
struct UFixedPointMathLibrary_Add_FixedPointFloat_Params
{
public:
	struct FFixedPoint                           A;                                                 // 0x0(0x4)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	float                                        B;                                                 // 0x4(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFixedPoint                           ReturnValue;                                       // 0x8(0x4)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};

// 0xC (0xC - 0x0)
// Function Pal.FixedPointMathLibrary.Add_FixedPointFixedPoint
struct UFixedPointMathLibrary_Add_FixedPointFixedPoint_Params
{
public:
	struct FFixedPoint                           A;                                                 // 0x0(0x4)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	struct FFixedPoint                           B;                                                 // 0x4(0x4)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	struct FFixedPoint                           ReturnValue;                                       // 0x8(0x4)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Pal.PalAbilityPassiveSkill.OnWorkerAssignChanged
struct UPalAbilityPassiveSkill_OnWorkerAssignChanged_Params
{
public:
	class UPalCharacterParameterComponent*       Parameter;                                         // 0x0(0x8)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Pal.PalAbilityPassiveSkill.OnUpdateOtomoHolder
struct UPalAbilityPassiveSkill_OnUpdateOtomoHolder_Params
{
public:
	class APalCharacter*                         Character;                                         // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Pal.PalAbilityPassiveSkill.OnUpdateInventoryContainer
struct UPalAbilityPassiveSkill_OnUpdateInventoryContainer_Params
{
public:
	class UPalItemContainer*                     Container;                                         // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Pal.PalAbilityPassiveSkill.IsRestricted__DelegateSignature
struct UPalAbilityPassiveSkill_IsRestricted__DelegateSignature_Params
{
public:
	class AActor*                                Trainer;                                           // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x8(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1F6A[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x1 (0x1 - 0x0)
// Function Pal.PalAbilityPassiveSkill.IsRestricted
struct UPalAbilityPassiveSkill_IsRestricted_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Pal.PalAbilityPassiveSkill.Initialize
struct UPalAbilityPassiveSkill_Initialize_Params
{
public:
	TArray<struct FPalPassiveAbilitySkills>      _PassiveSkills;                                    // 0x0(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Pal.PalAbilityPassiveSkill.GetTrainerController
struct UPalAbilityPassiveSkill_GetTrainerController_Params
{
public:
	class APalPlayerController*                  ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Pal.PalAbilityPassiveSkill.GetTrainerActor
struct UPalAbilityPassiveSkill_GetTrainerActor_Params
{
public:
	class APalCharacter*                         ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Pal.PalAbilityPassiveSkill.GetTrainer
struct UPalAbilityPassiveSkill_GetTrainer_Params
{
public:
	class ACharacter*                            ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Pal.PalAbilityPassiveSkill.GetPassiveSkillList
struct UPalAbilityPassiveSkill_GetPassiveSkillList_Params
{
public:
	TArray<class FName>                          ReturnValue;                                       // 0x0(0x10)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Pal.PalAbilityPassiveSkill.GetOwner
struct UPalAbilityPassiveSkill_GetOwner_Params
{
public:
	class APalCharacter*                         ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function Pal.PalAbilityPassiveSkill.GetOtomoRank
struct UPalAbilityPassiveSkill_GetOtomoRank_Params
{
public:
	int32                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x30 (0x30 - 0x0)
// Function Pal.PalAbilitySkillParameterComponent.OnOwnerCharacterSpawned
struct UPalAbilitySkillParameterComponent_OnOwnerCharacterSpawned_Params
{
public:
	struct FPalInstanceID                        ID;                                                // 0x0(0x30)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Pal.PalAbilitySkillParameterComponent.OnInitializedCharacter
struct UPalAbilitySkillParameterComponent_OnInitializedCharacter_Params
{
public:
	class APalCharacter*                         OwnerCharacter;                                    // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0xF0 (0xF0 - 0x0)
// Function Pal.ActionDynamicParameterUtility.SetBlackboard
struct UActionDynamicParameterUtility_SetBlackboard_Params
{
public:
	struct FActionDynamicParameter               DynamicParameterRef;                               // 0x0(0xE0)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FPalNetArchive                        Blackboard;                                        // 0xE0(0x10)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function Pal.PalActionBase.TickAction
struct UPalActionBase_TickAction_Params
{
public:
	float                                        DeltaTime;                                         // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0xC (0xC - 0x0)
// Function Pal.PalActionBase.SetAnimRateScale
struct UPalActionBase_SetAnimRateScale_Params
{
public:
	class FName                                  FlagName;                                          // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        AnimRateScale;                                     // 0x8(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Pal.PalActionBase.SendNotify
struct UPalActionBase_SendNotify_Params
{
public:
	class FName                                  NotifyName;                                        // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Pal.PalActionBase.OnUpdatePassiveSkill
struct UPalActionBase_OnUpdatePassiveSkill_Params
{
public:
	enum class EPalPassiveSkillEffectType        EffectType;                                        // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_204A[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        Value;                                             // 0x4(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function Pal.PalActionBase.OnEndPassiveSkill
struct UPalActionBase_OnEndPassiveSkill_Params
{
public:
	enum class EPalPassiveSkillEffectType        EffectType;                                        // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function Pal.PalActionBase.IsInServer
struct UPalActionBase_IsInServer_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function Pal.PalActionBase.IsInLocalControlled
struct UPalActionBase_IsInLocalControlled_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function Pal.PalActionBase.IsEndAction
struct UPalActionBase_IsEndAction_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function Pal.PalActionBase.GetTargetLocation
struct UPalActionBase_GetTargetLocation_Params
{
public:
	struct FVector                               ReturnValue;                                       // 0x0(0x18)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Pal.PalActionBase.GetSimpleName
struct UPalActionBase_GetSimpleName_Params
{
public:
	class FString                                ReturnValue;                                       // 0x0(0x10)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Pal.PalActionBase.GetRandomStream
struct UPalActionBase_GetRandomStream_Params
{
public:
	struct FRandomStream                         ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function Pal.PalActionBase.GetGeneralPurposeIndex
struct UPalActionBase_GetGeneralPurposeIndex_Params
{
public:
	int32                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Pal.PalActionBase.GetBlackboard
struct UPalActionBase_GetBlackboard_Params
{
public:
	struct FPalNetArchive                        ReturnValue;                                       // 0x0(0x10)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function Pal.PalActionBase.GetActionVelocity
struct UPalActionBase_GetActionVelocity_Params
{
public:
	struct FVector                               ReturnValue;                                       // 0x0(0x18)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Pal.PalActionBase.GetActionTarget
struct UPalActionBase_GetActionTarget_Params
{
public:
	class AActor*                                ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Pal.PalActionBase.GetActionIndividualCharacterParameter
struct UPalActionBase_GetActionIndividualCharacterParameter_Params
{
public:
	class UPalIndividualCharacterParameter*      ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Pal.PalActionBase.GetActionCharacter
struct UPalActionBase_GetActionCharacter_Params
{
public:
	class APalCharacter*                         ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function Pal.PalActionBase.CanStepCancel
struct UPalActionBase_CanStepCancel_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function Pal.PalActionBase.CanNextActionCancel
struct UPalActionBase_CanNextActionCancel_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function Pal.PalActionBase.CanGainSP
struct UPalActionBase_CanGainSP_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function Pal.PalActionBase.CanDeleteInstance
struct UPalActionBase_CanDeleteInstance_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0xF0 (0xF0 - 0x0)
// Function Pal.PalActionComponent.PlayActionParameter
struct UPalActionComponent_PlayActionParameter_Params
{
public:
	struct FActionDynamicParameter               Param;                                             // 0x0(0xE0)(Parm, NativeAccessSpecifierPublic)
	TSubclassOf<class UPalActionBase>            ActionClass;                                       // 0xE0(0x8)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPalActionBase*                        ReturnValue;                                       // 0xE8(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x28 (0x28 - 0x0)
// Function Pal.PalActionComponent.PlayActionLocationByType
struct UPalActionComponent_PlayActionLocationByType_Params
{
public:
	struct FVector                               Location;                                          // 0x0(0x18)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EPalActionType                    Type;                                              // 0x18(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2124[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UPalActionBase*                        ReturnValue;                                       // 0x20(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x28 (0x28 - 0x0)
// Function Pal.PalActionComponent.PlayActionLocation
struct UPalActionComponent_PlayActionLocation_Params
{
public:
	struct FVector                               Location;                                          // 0x0(0x18)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UPalActionBase>            ActionClass;                                       // 0x18(0x8)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPalActionBase*                        ReturnValue;                                       // 0x20(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0xF0 (0xF0 - 0x0)
// Function Pal.PalActionComponent.PlayActionByTypeParameter
struct UPalActionComponent_PlayActionByTypeParameter_Params
{
public:
	struct FActionDynamicParameter               Param;                                             // 0x0(0xE0)(Parm, NativeAccessSpecifierPublic)
	enum class EPalActionType                    Type;                                              // 0xE0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2167[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UPalActionBase*                        ReturnValue;                                       // 0xE8(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function Pal.PalActionComponent.PlayActionByType
struct UPalActionComponent_PlayActionByType_Params
{
public:
	class AActor*                                ActionTarget;                                      // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EPalActionType                    Type;                                              // 0x8(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_218A[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UPalActionBase*                        ReturnValue;                                       // 0x10(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0xF0 (0xF0 - 0x0)
// Function Pal.PalActionComponent.PlayAction_ToServer
struct UPalActionComponent_PlayAction_ToServer_Params
{
public:
	struct FActionDynamicParameter               Param;                                             // 0x0(0xE0)(Parm, NativeAccessSpecifierPublic)
	TSubclassOf<class UPalActionBase>            ActionClass;                                       // 0xE0(0x8)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        IssuerID;                                          // 0xE8(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_219D[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0xF0 (0xF0 - 0x0)
// Function Pal.PalActionComponent.PlayAction_ToALL
struct UPalActionComponent_PlayAction_ToALL_Params
{
public:
	struct FActionDynamicParameter               Param;                                             // 0x0(0xE0)(Parm, NativeAccessSpecifierPublic)
	TSubclassOf<class UPalActionBase>            ActionClass;                                       // 0xE0(0x8)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        IssuerID;                                          // 0xE8(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_21A8[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0xF0 (0xF0 - 0x0)
// Function Pal.PalActionComponent.PlayAction_LocalOnly
struct UPalActionComponent_PlayAction_LocalOnly_Params
{
public:
	struct FActionDynamicParameter               Param;                                             // 0x0(0xE0)(Parm, NativeAccessSpecifierPublic)
	TSubclassOf<class UPalActionBase>            ActionClass;                                       // 0xE0(0x8)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPalActionBase*                        ReturnValue;                                       // 0xE8(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0xF0 (0xF0 - 0x0)
// Function Pal.PalActionComponent.PlayAction_Internal
struct UPalActionComponent_PlayAction_Internal_Params
{
public:
	struct FActionDynamicParameter               Param;                                             // 0x0(0xE0)(Parm, NativeAccessSpecifierPublic)
	TSubclassOf<class UPalActionBase>            ActionClass;                                       // 0xE0(0x8)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPalActionBase*                        ReturnValue;                                       // 0xE8(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function Pal.PalActionComponent.PlayAction
struct UPalActionComponent_PlayAction_Params
{
public:
	class AActor*                                ActionTarget;                                      // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UPalActionBase>            ActionClass;                                       // 0x8(0x8)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPalActionBase*                        ReturnValue;                                       // 0x10(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Pal.PalActionComponent.OnOwnerEndPlay
struct UPalActionComponent_OnOwnerEndPlay_Params
{
public:
	class AActor*                                Actor;                                             // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EEndPlayReason                    ReasonType;                                        // 0x8(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2215[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x8 (0x8 - 0x0)
// Function Pal.PalActionComponent.OnCompleteCharacter
struct UPalActionComponent_OnCompleteCharacter_Params
{
public:
	class APalCharacter*                         InCharacter;                                       // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function Pal.PalActionComponent.GetCurrentActionType
struct UPalActionComponent_GetCurrentActionType_Params
{
public:
	enum class EPalActionType                    ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Pal.PalActionComponent.GetCurrentAction
struct UPalActionComponent_GetCurrentAction_Params
{
public:
	class UPalActionBase*                        ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function Pal.PalActionComponent.CancelActionByType
struct UPalActionComponent_CancelActionByType_Params
{
public:
	enum class EPalActionType                    Type;                                              // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Pal.PalActionComponent.CancelAction_Internal
struct UPalActionComponent_CancelAction_Internal_Params
{
public:
	struct FGuid                                 ActionID;                                          // 0x0(0x10)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Pal.PalActionComponent.CancelAction
struct UPalActionComponent_CancelAction_Params
{
public:
	class UPalActionBase*                        Action;                                            // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// DelegateFunction Pal.PalActionComponent.AllActionFinishDelegate__DelegateSignature
struct UPalActionComponent_AllActionFinishDelegate__DelegateSignature_Params
{
public:
	class UPalActionComponent*                   ActionComponent;                                   // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// DelegateFunction Pal.PalActionComponent.ActionStartDelegate__DelegateSignature
struct UPalActionComponent_ActionStartDelegate__DelegateSignature_Params
{
public:
	class UPalActionBase*                        Action;                                            // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Pal.PalActionComponent.ActionNotify__DelegateSignature
struct UPalActionComponent_ActionNotify__DelegateSignature_Params
{
public:
	class UPalActionBase*                        Action;                                            // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  NotifyName;                                        // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function Pal.PalActionComponent.ActionIsEmpty
struct UPalActionComponent_ActionIsEmpty_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Pal.PalActionOneShotAnimation.OnEndMontage
struct UPalActionOneShotAnimation_OnEndMontage_Params
{
public:
	class UAnimMontage*                          Montage;                                           // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bInterrupted;                                      // 0x8(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_22D2[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x20 (0x20 - 0x0)
// Function Pal.PalActionSpawnItem.WriteBlackboard
struct UPalActionSpawnItem_WriteBlackboard_Params
{
public:
	struct FPalNetArchive                        BlackboardRef;                                     // 0x0(0x10)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FPalStaticItemIdAndNum                ItemInfo;                                          // 0x10(0xC)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                        Pad_22E1[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0xC (0xC - 0x0)
// Function Pal.PalActionSpawnItem.ReadBlackboard
struct UPalActionSpawnItem_ReadBlackboard_Params
{
public:
	struct FPalStaticItemIdAndNum                ItemInfo;                                          // 0x0(0xC)(Parm, OutParm, NoDestructor, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function Pal.PalActionTransportItem.WriteBlackboard
struct UPalActionTransportItem_WriteBlackboard_Params
{
public:
	struct FPalNetArchive                        BlackboardRef;                                     // 0x0(0x10)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FName                                  StaticItemId;                                      // 0x10(0x8)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Pal.PalActionTransportItem.StartSetupItemActor
struct UPalActionTransportItem_StartSetupItemActor_Params
{
public:
	class FName                                  StaticItemId;                                      // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Pal.PalActionTransportItem.ReadBlackboard
struct UPalActionTransportItem_ReadBlackboard_Params
{
public:
	class FName                                  StaticItemId;                                      // 0x0(0x8)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Pal.PalActionWazaBase.PlayAkSound
struct UPalActionWazaBase_PlayAkSound_Params
{
public:
	class UAkAudioEvent*                         AudioEvent;                                        // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function Pal.PalActionWazaBase.GetWazaID
struct UPalActionWazaBase_GetWazaID_Params
{
public:
	enum class EPalWazaID                        ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Pal.PalActionWazaBase.GetRiderPlayer
struct UPalActionWazaBase_GetRiderPlayer_Params
{
public:
	class APalPlayerCharacter*                   ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x50 (0x50 - 0x0)
// Function Pal.PalAction_BeLiftup.OnDeadOwner_ServerInternal
struct UPalAction_BeLiftup_OnDeadOwner_ServerInternal_Params
{
public:
	struct FPalDeadInfo                          DeadInfo;                                          // 0x0(0x50)(Parm, NoDestructor, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function Pal.PalStatusBase.TickStatus
struct UPalStatusBase_TickStatus_Params
{
public:
	float                                        DeltaTime;                                         // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function Pal.PalStatusBase.IsEndStatus
struct UPalStatusBase_IsEndStatus_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Pal.PalStatusBase.GetOwner
struct UPalStatusBase_GetOwner_Params
{
public:
	class AActor*                                ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Pal.PalAction_Liftup.PlayTargetBeLiftupAction
struct UPalAction_Liftup_PlayTargetBeLiftupAction_Params
{
public:
	class APalCharacter*                         TargetCharacter;                                   // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function Pal.PalAction_SleepPlayerBed.IsSleepLooping
struct UPalAction_SleepPlayerBed_IsSleepLooping_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// DelegateFunction Pal.PalActiveSkill.OnCoolTimeUpdateDelegate__DelegateSignature
struct UPalActiveSkill_OnCoolTimeUpdateDelegate__DelegateSignature_Params
{
public:
	float                                        CoolRate;                                          // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function Pal.PalActiveSkill.IsCoolTimeFinish
struct UPalActiveSkill_IsCoolTimeFinish_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function Pal.PalActiveSkillSlot.UpdateCoolTime
struct UPalActiveSkillSlot_UpdateCoolTime_Params
{
public:
	float                                        DeltaTime;                                         // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function Pal.PalActiveSkillSlot.StopCoolTime
struct UPalActiveSkillSlot_StopCoolTime_Params
{
public:
	int32                                        SlotID;                                            // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Pal.PalActiveSkillSlot.SetTransient
struct UPalActiveSkillSlot_SetTransient_Params
{
public:
	int32                                        SlotID;                                            // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         IsTransient;                                       // 0x4(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2490[0x3];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x8 (0x8 - 0x0)
// Function Pal.PalActiveSkillSlot.SetSkill
struct UPalActiveSkillSlot_SetSkill_Params
{
public:
	int32                                        SlotID;                                            // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EPalWazaID                        WazaType;                                          // 0x4(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2495[0x3];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0xC (0xC - 0x0)
// Function Pal.PalActiveSkillSlot.SetCoolTimeRate
struct UPalActiveSkillSlot_SetCoolTimeRate_Params
{
public:
	class FName                                  Key;                                               // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        Rate;                                              // 0x8(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function Pal.PalActiveSkillSlot.RestartCoolTime
struct UPalActiveSkillSlot_RestartCoolTime_Params
{
public:
	int32                                        SlotID;                                            // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function Pal.PalActiveSkillSlot.RemoveSkill
struct UPalActiveSkillSlot_RemoveSkill_Params
{
public:
	int32                                        SlotID;                                            // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Pal.PalActiveSkillSlot.OnChangeEquipWaza
struct UPalActiveSkillSlot_OnChangeEquipWaza_Params
{
public:
	class UPalIndividualCharacterParameter*      IndividualParameter;                               // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Pal.PalActiveSkillSlot.IsValidSkill
struct UPalActiveSkillSlot_IsValidSkill_Params
{
public:
	int32                                        SlotID;                                            // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x4(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_24B4[0x3];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x8 (0x8 - 0x0)
// Function Pal.PalActiveSkillSlot.IsTransient
struct UPalActiveSkillSlot_IsTransient_Params
{
public:
	int32                                        SlotID;                                            // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x4(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_24BC[0x3];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x18 (0x18 - 0x0)
// Function Pal.PalActiveSkillSlot.IsNearMaxRange
struct UPalActiveSkillSlot_IsNearMaxRange_Params
{
public:
	int32                                        SlotID;                                            // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_24C5[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class AActor*                                TargetActor;                                       // 0x8(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x10(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_24C6[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x18 (0x18 - 0x0)
// Function Pal.PalActiveSkillSlot.IsFarMinRange
struct UPalActiveSkillSlot_IsFarMinRange_Params
{
public:
	int32                                        SlotID;                                            // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_24CA[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class AActor*                                TargetActor;                                       // 0x8(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x10(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_24CB[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x8 (0x8 - 0x0)
// Function Pal.PalActiveSkillSlot.IsCoolTimeFinish
struct UPalActiveSkillSlot_IsCoolTimeFinish_Params
{
public:
	int32                                        SlotID;                                            // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x4(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_24CE[0x3];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x8 (0x8 - 0x0)
// Function Pal.PalActiveSkillSlot.InitObject
struct UPalActiveSkillSlot_InitObject_Params
{
public:
	class AActor*                                ActorSelf;                                         // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Pal.PalActiveSkillSlot.GetWazaType
struct UPalActiveSkillSlot_GetWazaType_Params
{
public:
	int32                                        SlotID;                                            // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EPalWazaID                        ReturnValue;                                       // 0x4(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_24D3[0x3];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x50 (0x50 - 0x0)
// Function Pal.PalActiveSkillSlot.GetSkillMap
struct UPalActiveSkillSlot_GetSkillMap_Params
{
public:
	TMap<int32, class UPalActiveSkill*>          ReturnValue;                                       // 0x0(0x50)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Pal.PalActiveSkillSlot.GetEnableSlotIDs
struct UPalActiveSkillSlot_GetEnableSlotIDs_Params
{
public:
	TArray<int32>                                ReturnValue;                                       // 0x0(0x10)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Pal.PalActiveSkillSlot.GetCoolTimeRate
struct UPalActiveSkillSlot_GetCoolTimeRate_Params
{
public:
	int32                                        SlotID;                                            // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ReturnValue;                                       // 0x4(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Pal.PalActiveSkillSlot.GetCoolTime
struct UPalActiveSkillSlot_GetCoolTime_Params
{
public:
	int32                                        SlotID;                                            // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ReturnValue;                                       // 0x4(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Pal.PalActiveSkillSlot.FindMostEffectiveSlotID
struct UPalActiveSkillSlot_FindMostEffectiveSlotID_Params
{
public:
	class AActor*                                TargetActor;                                       // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        ReturnValue;                                       // 0x8(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_24E8[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x4 (0x4 - 0x0)
// Function Pal.PalActiveSkillSlot.ChoiceEnableSlotIDByRandom
struct UPalActiveSkillSlot_ChoiceEnableSlotIDByRandom_Params
{
public:
	int32                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function Pal.PalActiveSkillSlot.CanUse
struct UPalActiveSkillSlot_CanUse_Params
{
public:
	int32                                        SlotID;                                            // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_24F2[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class AActor*                                TargetActor;                                       // 0x8(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x10(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_24F3[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x1 (0x1 - 0x0)
// Function Pal.PalAIActionBase.SetWalkSpeed_ForAIAction
struct UPalAIActionBase_SetWalkSpeed_ForAIAction_Params
{
public:
	enum class EPalMovementSpeedType             MoveSpeedType;                                     // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x60 (0x60 - 0x0)
// Function Pal.PalAIActionBase.SetAIActionClassParameter
struct UPalAIActionBase_SetAIActionClassParameter_Params
{
public:
	TSubclassOf<class UPalAIActionBase>          NewActionClass;                                    // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPalAIActionDynamicParameter          Parameter;                                         // 0x8(0x50)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	class UPalAIActionBase*                      ReturnValue;                                       // 0x58(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Pal.PalAIActionBase.PushChildAction
struct UPalAIActionBase_PushChildAction_Params
{
public:
	class UPawnAction*                           Action;                                            // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x8(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_251B[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x10 (0x10 - 0x0)
// Function Pal.PalAIActionBase.OnChildActionFinished
struct UPalAIActionBase_OnChildActionFinished_Params
{
public:
	class UPawnAction*                           Action;                                            // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EPawnActionResult                 WithResult;                                        // 0x8(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2525[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x8 (0x8 - 0x0)
// DelegateFunction Pal.PalAIActionBase.OnActionDelegate__DelegateSignature
struct UPalAIActionBase_OnActionDelegate__DelegateSignature_Params
{
public:
	class UPalAIActionBase*                      Action;                                            // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Pal.PalAIActionBase.OnActionByDelegate__DelegateSignature
struct UPalAIActionBase_OnActionByDelegate__DelegateSignature_Params
{
public:
	class UPalAIActionBase*                      Action;                                            // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPawnAction*                           byAction;                                          // 0x8(0x8)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function Pal.PalAIActionBase.IsPaused
struct UPalAIActionBase_IsPaused_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function Pal.PalAIActionBase.IsActive
struct UPalAIActionBase_IsActive_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Pal.PalAIActionBase.GetSimpleName
struct UPalAIActionBase_GetSimpleName_Params
{
public:
	class FString                                ReturnValue;                                       // 0x0(0x10)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function Pal.PalAIActionBase.GetRequestPriority
struct UPalAIActionBase_GetRequestPriority_Params
{
public:
	enum class EAIRequestPriority                ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Pal.PalAIActionBase.GetPalAIController
struct UPalAIActionBase_GetPalAIController_Params
{
public:
	class APalAIController*                      ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Pal.PalAIActionBase.GetOwnerComponent
struct UPalAIActionBase_GetOwnerComponent_Params
{
public:
	class UPawnActionsComponent*                 ReturnValue;                                       // 0x0(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Pal.PalAIActionBase.GetController
struct UPalAIActionBase_GetController_Params
{
public:
	class AController*                           ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Pal.PalAIActionBase.GetCharacterParameter
struct UPalAIActionBase_GetCharacterParameter_Params
{
public:
	class UPalCharacterParameterComponent*       ReturnValue;                                       // 0x0(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Pal.PalAIActionBase.GetCharacter
struct UPalAIActionBase_GetCharacter_Params
{
public:
	class APalCharacter*                         ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Pal.PalAIActionBase.GetAIActionComponent
struct UPalAIActionBase_GetAIActionComponent_Params
{
public:
	class UPalAIActionComponent*                 ReturnValue;                                       // 0x0(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Pal.PalAIActionBase.GetActionComponent
struct UPalAIActionBase_GetActionComponent_Params
{
public:
	class UPalActionComponent*                   ReturnValue;                                       // 0x0(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// Function Pal.PalAIActionBase.CreateActionInstanceFixName
struct UPalAIActionBase_CreateActionInstanceFixName_Params
{
public:
	class UObject*                               WorldContextObject;                                // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UPawnAction>               ActionClass;                                       // 0x8(0x8)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  ActionName;                                        // 0x10(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPawnAction*                           ReturnValue;                                       // 0x18(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Pal.PalAIActionBase.ActionAbort
struct UPalAIActionBase_ActionAbort_Params
{
public:
	class APawn*                                 ControlledPawn;                                    // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Pal.PalAIActionBaseCampBase.StartCombatAction
struct UPalAIActionBaseCampBase_StartCombatAction_Params
{
public:
	TSubclassOf<class UPalAIActionCombatBase>    CombatActionClass;                                 // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Pal.PalAIActionBaseCampBase.OnUpdateFullStomach
struct UPalAIActionBaseCampBase_OnUpdateFullStomach_Params
{
public:
	float                                        Current;                                           // 0x0(0x4)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        Last;                                              // 0x4(0x4)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Pal.PalAIActionBaseCampBase.OnTriggerInteract
struct UPalAIActionBaseCampBase_OnTriggerInteract_Params
{
public:
	class AActor*                                OtherActor;                                        // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EPalInteractiveObjectIndicatorType IndicatorType;                                     // 0x8(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2596[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x8 (0x8 - 0x0)
// Function Pal.PalAIActionBaseCampBase.OnClosedWorkerRadialMenu
struct UPalAIActionBaseCampBase_OnClosedWorkerRadialMenu_Params
{
public:
	class UPalHUDDispatchParameterBase*          Parameter;                                         // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function Pal.PalAIActionBaseCampBase.NotifyOrderCommand
struct UPalAIActionBaseCampBase_NotifyOrderCommand_Params
{
public:
	enum class EPalMapBaseCampWorkerOrderType    OrderType;                                         // 0x0(0x1)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0xC (0xC - 0x0)
// Function Pal.PalAIActionBaseCampBase.InterruptActionToRecoverHungry
struct UPalAIActionBaseCampBase_InterruptActionToRecoverHungry_Params
{
public:
	struct FPalMonsterControllerBaseCampHungryParameter Parameter;                                         // 0x0(0xC)(ConstParm, Parm, NoDestructor, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Pal.PalAIActionBaseCampBase.GetBaseCampIdBelongTo
struct UPalAIActionBaseCampBase_GetBaseCampIdBelongTo_Params
{
public:
	struct FGuid                                 ReturnValue;                                       // 0x0(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Pal.PalAIActionBaseCampBase.GetBaseCampBelongTo
struct UPalAIActionBaseCampBase_GetBaseCampBelongTo_Params
{
public:
	class UPalBaseCampModel*                     ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Pal.PalAIActionBaseCampBase.ChangeChildAction
struct UPalAIActionBaseCampBase_ChangeChildAction_Params
{
public:
	class UPalAIActionBaseCampChildBase*         Action;                                            // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Pal.PalAIActionBaseCampDefenseBase.GetControllerRef
struct UPalAIActionBaseCampDefenseBase_GetControllerRef_Params
{
public:
	class APalAIController*                      ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Pal.PalAIActionBaseCampFighter.TryGetDefenseMapObjectModel
struct UPalAIActionBaseCampFighter_TryGetDefenseMapObjectModel_Params
{
public:
	class UPalMapObjectDefenseModelBase*         OutModel;                                          // 0x0(0x8)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x8(0x1)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_261C[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x10 (0x10 - 0x0)
// Function Pal.PalAIActionBaseCampFighter.RegisterAssignDefenseModelId
struct UPalAIActionBaseCampFighter_RegisterAssignDefenseModelId_Params
{
public:
	struct FGuid                                 InDefenseMapObjectModelId;                         // 0x0(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Pal.PalAIActionBaseCampFighterChildBase.GetParentFighterAction
struct UPalAIActionBaseCampFighterChildBase_GetParentFighterAction_Params
{
public:
	class UPalAIActionBaseCampFighter*           ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Pal.PalAIActionCombatBase.StartNextAction_Event
struct UPalAIActionCombatBase_StartNextAction_Event_Params
{
public:
	class UPalActionComponent*                   ActionComponent;                                   // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Pal.PalAIActionCombatBase.SetTargetAndNextAction
struct UPalAIActionCombatBase_SetTargetAndNextAction_Params
{
public:
	class AActor*                                Target;                                            // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function Pal.PalAIActionCombatBase.PreTickFinishCheck
struct UPalAIActionCombatBase_PreTickFinishCheck_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x50 (0x50 - 0x0)
// Function Pal.PalAIActionCombatBase.OnDeadDeledate_Event
struct UPalAIActionCombatBase_OnDeadDeledate_Event_Params
{
public:
	struct FPalDeadInfo                          DeadInfo;                                          // 0x0(0x50)(Parm, NoDestructor, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function Pal.PalAIActionCombatBase.LineTraceTarget
struct UPalAIActionCombatBase_LineTraceTarget_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function Pal.PalAIActionCombatBase.InterruptAction
struct UPalAIActionCombatBase_InterruptAction_Params
{
public:
	int32                                        SkillSlotID;                                       // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Pal.PalAIActionCombatBase.GetStaticParamCompRef
struct UPalAIActionCombatBase_GetStaticParamCompRef_Params
{
public:
	class UPalStaticCharacterParameterComponent* ReturnValue;                                       // 0x0(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Pal.PalAIActionCombatBase.GetSkillSlotRef
struct UPalAIActionCombatBase_GetSkillSlotRef_Params
{
public:
	class UPalActiveSkillSlot*                   ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Pal.PalAIActionCombatBase.GetParamCompRef
struct UPalAIActionCombatBase_GetParamCompRef_Params
{
public:
	class UPalCharacterParameterComponent*       ReturnValue;                                       // 0x0(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Pal.PalAIActionCombatBase.GetControllerRef
struct UPalAIActionCombatBase_GetControllerRef_Params
{
public:
	class APalAIController*                      ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Pal.PalAIActionCombatBase.GetActorActionComponentRef
struct UPalAIActionCombatBase_GetActorActionComponentRef_Params
{
public:
	class UPalActionComponent*                   ReturnValue;                                       // 0x0(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function Pal.PalAIActionBaseCampFighterWait.TrySearchEnemy
struct UPalAIActionBaseCampFighterWait_TrySearchEnemy_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// Function Pal.PalAIActionBaseCampFighterWait.TryGetWaitLocation
struct UPalAIActionBaseCampFighterWait_TryGetWaitLocation_Params
{
public:
	struct FVector                               Location;                                          // 0x0(0x18)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x18(0x1)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2707[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x4 (0x4 - 0x0)
// Function Pal.PalAIActionBaseCampInUsingAmusement.GetUsingTime
struct UPalAIActionBaseCampInUsingAmusement_GetUsingTime_Params
{
public:
	float                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Pal.PalAIActionBaseCampRecoverHungryChildBase.TryGetTargetMapObjectConcreteModel
struct UPalAIActionBaseCampRecoverHungryChildBase_TryGetTargetMapObjectConcreteModel_Params
{
public:
	class UPalMapObjectConcreteModelBase*        OutTargetModel;                                    // 0x0(0x8)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x8(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2737[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x1 (0x1 - 0x0)
// Function Pal.PalAIActionBaseCampRecoverHungryChildBase.ToggleShowWantFoodHUD
struct UPalAIActionBaseCampRecoverHungryChildBase_ToggleShowWantFoodHUD_Params
{
public:
	bool                                         bShow;                                             // 0x0(0x1)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function Pal.PalAIActionBaseCampRecoverHungryChildBase.IsExistEnoughFoodInTarget
struct UPalAIActionBaseCampRecoverHungryChildBase_IsExistEnoughFoodInTarget_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function Pal.PalAIActionBaseCampRecoverHungryChildBase.IsAvailableDistance
struct UPalAIActionBaseCampRecoverHungryChildBase_IsAvailableDistance_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function Pal.PalAIActionBaseCampRecoverHungryChildBase.GetTargetLocation
struct UPalAIActionBaseCampRecoverHungryChildBase_GetTargetLocation_Params
{
public:
	struct FVector                               ReturnValue;                                       // 0x0(0x18)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Pal.PalAIActionBaseCampRecoverHungryChildBase.GetParentRecoverHungryAction
struct UPalAIActionBaseCampRecoverHungryChildBase_GetParentRecoverHungryAction_Params
{
public:
	class UPalAIActionBaseCampRecoverHungry*     ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0xC (0xC - 0x0)
// Function Pal.PalAIActionBaseCampRecoverHungryChildBase.GetHungryParameter
struct UPalAIActionBaseCampRecoverHungryChildBase_GetHungryParameter_Params
{
public:
	struct FPalMonsterControllerBaseCampHungryParameter HungeryParameter;                                  // 0x0(0xC)(Parm, OutParm, NoDestructor, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function Pal.PalAIActionBaseCampSleepActively.SetParameter
struct UPalAIActionBaseCampSleepActively_SetParameter_Params
{
public:
	struct FPalAIActionBaseCampSleepActivelyParameter Parameter;                                         // 0x0(0x4)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};

// 0xE8 (0xE8 - 0x0)
// Function Pal.PalAIActionBaseCampSpawningForWorker.OnLanded
struct UPalAIActionBaseCampSpawningForWorker_OnLanded_Params
{
public:
	struct FHitResult                            Hit;                                               // 0x0(0xE8)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// 0x2 (0x2 - 0x0)
// Function Pal.PalAIActionBaseCampUtility.GetRequestSoftScriptPriority
struct UPalAIActionBaseCampUtility_GetRequestSoftScriptPriority_Params
{
public:
	enum class EPalRequestSoftScriptPriorityAdd  AddPriority;                                       // 0x0(0x1)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EAIRequestPriority                ReturnValue;                                       // 0x1(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Pal.PalAIActionComponent.TerminateCurrentActionByClass
struct UPalAIActionComponent_TerminateCurrentActionByClass_Params
{
public:
	TSubclassOf<class UPalAIActionBase>          ActionClass;                                       // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function Pal.PalAIActionComponent.SetWalkSpeed_ForAIAction
struct UPalAIActionComponent_SetWalkSpeed_ForAIAction_Params
{
public:
	enum class EPalMovementSpeedType             MoveSpeedType;                                     // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Pal.PalAIActionComponent.SetRootComposite
struct UPalAIActionComponent_SetRootComposite_Params
{
public:
	class UPalAIActionCompositeBase*             NewCompositeAction;                                // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EAIRequestPriority                Priority;                                          // 0x8(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_27B9[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x60 (0x60 - 0x0)
// Function Pal.PalAIActionComponent.SetActionClassParameter
struct UPalAIActionComponent_SetActionClassParameter_Params
{
public:
	TSubclassOf<class UPalAIActionBase>          NewActionClass;                                    // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPalAIActionDynamicParameter          Parameter;                                         // 0x8(0x50)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	class UPalAIActionBase*                      ReturnValue;                                       // 0x58(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function Pal.PalAIActionComponent.SetAction
struct UPalAIActionComponent_SetAction_Params
{
public:
	class UPawnAction*                           NewAction;                                         // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EAIRequestPriority                Priority;                                          // 0x8(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_27C5[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UObject*                               Instigator;                                        // 0x10(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function Pal.PalAIActionComponent.IsActionEmpty
struct UPalAIActionComponent_IsActionEmpty_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Pal.PalAIActionComponent.HasAction
struct UPalAIActionComponent_HasAction_Params
{
public:
	TSubclassOf<class UPawnAction>               CheckClass;                                        // 0x0(0x8)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EAIRequestPriority                CheckPriority;                                     // 0x8(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x9(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_27D2[0x6];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x8 (0x8 - 0x0)
// Function Pal.PalAIActionComponent.GetCurrentTopParentAction_BP
struct UPalAIActionComponent_GetCurrentTopParentAction_BP_Params
{
public:
	class UPawnAction*                           ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function Pal.PalAIActionComponent.GetCurrentAIActionCategory
struct UPalAIActionComponent_GetCurrentAIActionCategory_Params
{
public:
	enum class EPalAIActionCategory              ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Pal.PalAIActionComponent.GetCurrentAction_BP
struct UPalAIActionComponent_GetCurrentAction_BP_Params
{
public:
	class UPawnAction*                           ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Pal.PalAIActionComponent.GetCompositeRoot
struct UPalAIActionComponent_GetCompositeRoot_Params
{
public:
	enum class EAIRequestPriority                Priority;                                          // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_27DE[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UPalAIActionCompositeBase*             ReturnValue;                                       // 0x8(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Pal.PalAIActionComponent.AllCancelPushedAction
struct UPalAIActionComponent_AllCancelPushedAction_Params
{
public:
	class UObject*                               Instigator;                                        // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Pal.PalAIActionComponent.AllCancelActionPriorThanSoftScript
struct UPalAIActionComponent_AllCancelActionPriorThanSoftScript_Params
{
public:
	class UObject*                               Instigator;                                        // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Pal.PalAIActionComponent.AllCancelAction_Logic_HardScript_Reaction
struct UPalAIActionComponent_AllCancelAction_Logic_HardScript_Reaction_Params
{
public:
	class UObject*                               Instigator;                                        // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Pal.PalAIActionCompositeBase.SetChildActionComposite
struct UPalAIActionCompositeBase_SetChildActionComposite_Params
{
public:
	class UPalAIActionCompositeBase*             Composite;                                         // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Pal.PalAIActionCompositeBase.SetChildAction
struct UPalAIActionCompositeBase_SetChildAction_Params
{
public:
	class UPalAIActionBase*                      Action;                                            // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                               Instigator;                                        // 0x8(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function Pal.PalAIActionCompositeBase.IsPaused
struct UPalAIActionCompositeBase_IsPaused_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Pal.PalAIActionCompositeBase.GetPawn
struct UPalAIActionCompositeBase_GetPawn_Params
{
public:
	class APawn*                                 ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Pal.PalAIActionCompositeBase.GetOwnerComponent
struct UPalAIActionCompositeBase_GetOwnerComponent_Params
{
public:
	class UPalAIActionComponent*                 ReturnValue;                                       // 0x0(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Pal.PalAIActionCompositeBase.GetController
struct UPalAIActionCompositeBase_GetController_Params
{
public:
	class AController*                           ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Pal.PalAIActionCompositeBase.GetChild
struct UPalAIActionCompositeBase_GetChild_Params
{
public:
	class UPalAIActionCompositeBase*             ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Pal.PalAIActionCompositeBase.GetCharacterParameter
struct UPalAIActionCompositeBase_GetCharacterParameter_Params
{
public:
	class UPalCharacterParameterComponent*       ReturnValue;                                       // 0x0(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Pal.PalAIActionCompositeBase.GetActionComponent
struct UPalAIActionCompositeBase_GetActionComponent_Params
{
public:
	class UPalActionComponent*                   ReturnValue;                                       // 0x0(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function Pal.PalAIActionCompositeBaseCamp.NotifyOrderCommand
struct UPalAIActionCompositeBaseCamp_NotifyOrderCommand_Params
{
public:
	enum class EPalMapBaseCampWorkerOrderType    OrderType;                                         // 0x0(0x1)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0xC (0xC - 0x0)
// Function Pal.PalAIActionCompositeBaseCamp.InterruptActionToRecoverHungry
struct UPalAIActionCompositeBaseCamp_InterruptActionToRecoverHungry_Params
{
public:
	struct FPalMonsterControllerBaseCampHungryParameter Parameter;                                         // 0x0(0xC)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Pal.PalAIActionCompositeActionDummy.OnResumeAction
struct UPalAIActionCompositeActionDummy_OnResumeAction_Params
{
public:
	class UPalAIActionBase*                      Action;                                            // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Pal.PalAIActionCompositeActionDummy.OnPauseAction
struct UPalAIActionCompositeActionDummy_OnPauseAction_Params
{
public:
	class UPalAIActionBase*                      Action;                                            // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPawnAction*                           PausedBy;                                          // 0x8(0x8)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Pal.PalAIActionCompositeActionDummy.OnFinishAction
struct UPalAIActionCompositeActionDummy_OnFinishAction_Params
{
public:
	class UPalAIActionBase*                      Action;                                            // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function Pal.PalAIActionCompositeWorker.TryFindNextWork
struct UPalAIActionCompositeWorker_TryFindNextWork_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Pal.PalAIActionCompositeWorker.RegisterFixedAssignWorkAttack
struct UPalAIActionCompositeWorker_RegisterFixedAssignWorkAttack_Params
{
public:
	struct FGuid                                 MapObjectModelInstanceId;                          // 0x0(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Pal.PalAIActionCompositeWorker.RegisterFixedAssignWork
struct UPalAIActionCompositeWorker_RegisterFixedAssignWork_Params
{
public:
	struct FGuid                                 WorkId;                                            // 0x0(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function Pal.PalAIActionCompositeWorker.OnTickInWaitAction
struct UPalAIActionCompositeWorker_OnTickInWaitAction_Params
{
public:
	float                                        DeltaTime;                                         // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Pal.PalAIActionCompositeWorker.OnStartAction
struct UPalAIActionCompositeWorker_OnStartAction_Params
{
public:
	class UPalAIActionBase*                      Action;                                            // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function Pal.PalAIActionCompositeWorker.IsTargetWorkable
struct UPalAIActionCompositeWorker_IsTargetWorkable_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function Pal.PalAIActionCompositeWorker.IsTargetAssignable
struct UPalAIActionCompositeWorker_IsTargetAssignable_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function Pal.PalAIActionCompositeWorker.IsAssignedToTarget
struct UPalAIActionCompositeWorker_IsAssignedToTarget_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Pal.PalAIActionWorkerChildBase.LookToTarget
struct UPalAIActionWorkerChildBase_LookToTarget_Params
{
public:
	float                                        TurnSpeed;                                         // 0x0(0x4)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        DeltaTime;                                         // 0x4(0x4)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function Pal.PalAIActionWorkerChildBase.IsTargetWorkable
struct UPalAIActionWorkerChildBase_IsTargetWorkable_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function Pal.PalAIActionWorkerChildBase.IsTargetAssignable
struct UPalAIActionWorkerChildBase_IsTargetAssignable_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function Pal.PalAIActionWorkerChildBase.IsAssignedToTarget
struct UPalAIActionWorkerChildBase_IsAssignedToTarget_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function Pal.PalAIActionWorkerChildBase.GetWorkLookAtLocation
struct UPalAIActionWorkerChildBase_GetWorkLookAtLocation_Params
{
public:
	struct FVector                               ReturnValue;                                       // 0x0(0x18)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Pal.PalAIActionWorkerChildBase.GetParent
struct UPalAIActionWorkerChildBase_GetParent_Params
{
public:
	class UPalAIActionCompositeWorker*           ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Pal.PalAIActionCompositeWorkerModuleBaseCamp.GetBaseCampIdBelongTo
struct UPalAIActionCompositeWorkerModuleBaseCamp_GetBaseCampIdBelongTo_Params
{
public:
	struct FGuid                                 ReturnValue;                                       // 0x0(0x10)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Pal.PalAIActionCompositeWorkerModuleBaseCamp.GetBaseCampBelongTo
struct UPalAIActionCompositeWorkerModuleBaseCamp_GetBaseCampBelongTo_Params
{
public:
	class UPalBaseCampModel*                     ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function Pal.PalAIActionCoopAssaultrifleMode.Update
struct UPalAIActionCoopAssaultrifleMode_Update_Params
{
public:
	float                                        DeltaTime;                                         // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function Pal.PalAIActionCoopAssaultrifleMode.SetAimStartPoint
struct UPalAIActionCoopAssaultrifleMode_SetAimStartPoint_Params
{
public:
	struct FVector                               OffsetLocation;                                    // 0x0(0x18)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function Pal.PalAIActionCoopAssaultrifleMode.ProgressSeraching
struct UPalAIActionCoopAssaultrifleMode_ProgressSeraching_Params
{
public:
	float                                        DeltaTime;                                         // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// Function Pal.PalAIActionCoopAssaultrifleMode.OnUpdateShootingLocation
struct UPalAIActionCoopAssaultrifleMode_OnUpdateShootingLocation_Params
{
public:
	class APalCharacter*                         Target;                                            // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                               ShootLocation;                                     // 0x8(0x18)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function Pal.PalAIActionCoopAssaultrifleMode.IsSearching
struct UPalAIActionCoopAssaultrifleMode_IsSearching_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// Function Pal.PalAIActionCoopAssaultrifleMode.HasReached
struct UPalAIActionCoopAssaultrifleMode_HasReached_Params
{
public:
	struct FVector                               Goal;                                              // 0x0(0x18)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x18(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_28C0[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x8 (0x8 - 0x0)
// Function Pal.PalAIActionCoopAssaultrifleMode.GetTrainer
struct UPalAIActionCoopAssaultrifleMode_GetTrainer_Params
{
public:
	class APalCharacter*                         ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Pal.PalAIActionCoopAssaultrifleMode.GetTargetEnemies
struct UPalAIActionCoopAssaultrifleMode_GetTargetEnemies_Params
{
public:
	TArray<class APalCharacter*>                 Enemies;                                           // 0x0(0x10)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Pal.PalAIActionCoopAssaultrifleMode.GetTargetCharacter
struct UPalAIActionCoopAssaultrifleMode_GetTargetCharacter_Params
{
public:
	class APalCharacter*                         ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Pal.PalAIActionCoopAssaultrifleMode.GetReticleTarget
struct UPalAIActionCoopAssaultrifleMode_GetReticleTarget_Params
{
public:
	class APalCharacter*                         ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function Pal.PalAIActionCoopAssaultrifleMode.GetCandidateLocations
struct UPalAIActionCoopAssaultrifleMode_GetCandidateLocations_Params
{
public:
	float                                        Radius;                                            // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        DegStep;                                           // 0x4(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FPalCoopSkillAssaultrifleModeCandidateLocation> Results;                                           // 0x8(0x10)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x30 (0x30 - 0x0)
// Function Pal.PalAIActionCoopAssaultrifleMode.FindLocationToShootEnemy
struct UPalAIActionCoopAssaultrifleMode_FindLocationToShootEnemy_Params
{
public:
	class APalCharacter*                         Target;                                            // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPalCoopSkillAssaultrifleModeCandidateLocation OutLocation;                                       // 0x8(0x20)(Parm, OutParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x28(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_28EA[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x1 (0x1 - 0x0)
// Function Pal.PalAIActionFunnelCharacterDefault.ShouldSetSkillAction
struct UPalAIActionFunnelCharacterDefault_ShouldSetSkillAction_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function Pal.PalAIActionFunnelCharacterDefault.OnTick_BP
struct UPalAIActionFunnelCharacterDefault_OnTick_BP_Params
{
public:
	float                                        DeltaTime;                                         // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Pal.PalAIActionFunnelCharacterDefault.CreateSkillActionModule
struct UPalAIActionFunnelCharacterDefault_CreateSkillActionModule_Params
{
public:
	TSubclassOf<class UPalFunnelSkillModule>     FunnelSkillModuleClass;                            // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Pal.PalAIActionFunnelSkillBase.SetModule
struct UPalAIActionFunnelSkillBase_SetModule_Params
{
public:
	class UPalFunnelSkillModule*                 InModule;                                          // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0xE8 (0xE8 - 0x0)
// Function Pal.PalAIActionLiftup.CallOnLanded
struct UPalAIActionLiftup_CallOnLanded_Params
{
public:
	struct FHitResult                            Hit;                                               // 0x0(0xE8)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function Pal.PalAIActionOtomoDefault.ShouldSetCombatAction
struct UPalAIActionOtomoDefault_ShouldSetCombatAction_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Pal.PalAIActionOtomoDefault.SetOtomoWorkActionFixedAssign
struct UPalAIActionOtomoDefault_SetOtomoWorkActionFixedAssign_Params
{
public:
	class AActor*                                HitActor;                                          // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Pal.PalAIActionWorkerApproachToWorkArea.OnReceiveMoveCompleted
struct UPalAIActionWorkerApproachToWorkArea_OnReceiveMoveCompleted_Params
{
public:
	struct FAIRequestID                          AIRequestID;                                       // 0x0(0x4)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EPathFollowingResult              Result;                                            // 0x4(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2936[0x3];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x4 (0x4 - 0x0)
// Function Pal.PalAIActionWorkerWait.OnTickForWait
struct UPalAIActionWorkerWait_OnTickForWait_Params
{
public:
	float                                        DeltaTime;                                         // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// Function Pal.PalAIActionWorkerWait.MoveToLocation
struct UPalAIActionWorkerWait_MoveToLocation_Params
{
public:
	struct FVector                               ToLocation;                                        // 0x0(0x18)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EPathFollowingRequestResult       ReturnValue;                                       // 0x18(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_295A[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x28 (0x28 - 0x0)
// Function Pal.PalAIActionWorkerWait.CalcWalkAroundDestination
struct UPalAIActionWorkerWait_CalcWalkAroundDestination_Params
{
public:
	float                                        Radius;                                            // 0x0(0x4)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2961[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               OutDestination;                                    // 0x8(0x18)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x20(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2962[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x10 (0x10 - 0x0)
// Function Pal.PalAIAction_LeaveBase.InitializeObject
struct UPalAIAction_LeaveBase_InitializeObject_Params
{
public:
	class AActor*                                CombatTarget;                                      // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class APalCharacter*                         SelfCharactor;                                     // 0x8(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Pal.PalAICombatModule.IsReachable_NavMesh_ForActor
struct UPalAICombatModule_IsReachable_NavMesh_ForActor_Params
{
public:
	class AActor*                                Target;                                            // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x8(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2983[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x20 (0x20 - 0x0)
// Function Pal.PalAICombatModule.IsReachable_NavMesh
struct UPalAICombatModule_IsReachable_NavMesh_Params
{
public:
	struct FVector                               TargetPos;                                         // 0x0(0x18)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x18(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2990[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x1 (0x1 - 0x0)
// Function Pal.PalAICombatModule.IsBattleMode
struct UPalAICombatModule_IsBattleMode_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Pal.PalAICombatModule.GetTargetActor
struct UPalAICombatModule_GetTargetActor_Params
{
public:
	class AActor*                                ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Pal.PalAICombatModule.AIMoveToTargetActor
struct UPalAICombatModule_AIMoveToTargetActor_Params
{
public:
	class AActor*                                Target;                                            // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x8(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2997[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x8 (0x8 - 0x0)
// Function Pal.PalAICombatModule_Invader.OnBattleFinish_forDelegate
struct UPalAICombatModule_Invader_OnBattleFinish_forDelegate_Params
{
public:
	class AActor*                                Actor;                                             // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Pal.PalAICombatModule_Wild.OnBattleFinish_forDelegate
struct UPalAICombatModule_Wild_OnBattleFinish_forDelegate_Params
{
public:
	class AActor*                                Actor;                                             // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function Pal.PalAICombatModule_Wild.JudgeReturnCombatStartPosition
struct UPalAICombatModule_Wild_JudgeReturnCombatStartPosition_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function Pal.PalAIController.WaitForSeconds
struct APalAIController_WaitForSeconds_Params
{
public:
	float                                        Time;                                              // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Pal.PalAIController.SimpleMoveToActorWithLineTraceGround
struct APalAIController_SimpleMoveToActorWithLineTraceGround_Params
{
public:
	class AActor*                                GoalActor;                                         // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x2 (0x2 - 0x0)
// Function Pal.PalAIController.SetInitialValue
struct APalAIController_SetInitialValue_Params
{
public:
	bool                                         IsSquad;                                           // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         NotSleep;                                          // 0x1(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function Pal.PalAIController.SetActiveAI
struct APalAIController_SetActiveAI_Params
{
public:
	bool                                         Active;                                            // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x30 (0x30 - 0x0)
// Function Pal.PalAIController.PalMoveToLocation
struct APalAIController_PalMoveToLocation_Params
{
public:
	struct FVector                               Dest;                                              // 0x0(0x18)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        AcceptanceRadius;                                  // 0x18(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bStopOnOverlap;                                    // 0x1C(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bUsePathfinding;                                   // 0x1D(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bProjectDestinationToNavigation;                   // 0x1E(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bCanStrafe;                                        // 0x1F(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UNavigationQueryFilter>    FilterClass;                                       // 0x20(0x8)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bAllowPartialPaths;                                // 0x28(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EPathFollowingRequestResult       ReturnValue;                                       // 0x29(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_29F2[0x6];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x50 (0x50 - 0x0)
// Function Pal.PalAIController.OnDeadTimerStart
struct APalAIController_OnDeadTimerStart_Params
{
public:
	struct FPalDeadInfo                          Info;                                              // 0x0(0x50)(Parm, NoDestructor, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function Pal.PalAIController.OnChangedActiveCharacter
struct APalAIController_OnChangedActiveCharacter_Params
{
public:
	bool                                         bActive;                                           // 0x0(0x1)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function Pal.PalAIController.OnChangeChangeImportance
struct APalAIController_OnChangeChangeImportance_Params
{
public:
	enum class EPalCharacterImportanceType       Next;                                              // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Pal.PalAIController.NotifyTalkStart
struct APalAIController_NotifyTalkStart_Params
{
public:
	class APalPlayerCharacter*                   TalkPlayer;                                        // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Pal.PalAIController.NotifyTalkEnd
struct APalAIController_NotifyTalkEnd_Params
{
public:
	class APalPlayerCharacter*                   TalkPlayer;                                        // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function Pal.PalAIController.MoveToLocation_ErrorSupportMove
struct APalAIController_MoveToLocation_ErrorSupportMove_Params
{
public:
	struct FVector                               GoalLocation;                                      // 0x0(0x18)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function Pal.PalAIController.MoveToDirectly
struct APalAIController_MoveToDirectly_Params
{
public:
	struct FVector                               GoalLocation;                                      // 0x0(0x18)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// Function Pal.PalAIController.IsOnNavMesh_TargetLocation
struct APalAIController_IsOnNavMesh_TargetLocation_Params
{
public:
	struct FVector                               TargetLocation;                                    // 0x0(0x18)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x18(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2A11[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x1 (0x1 - 0x0)
// Function Pal.PalAIController.IsOnNavMesh
struct APalAIController_IsOnNavMesh_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function Pal.PalAIController.IsLeader
struct APalAIController_IsLeader_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x48 (0x48 - 0x0)
// Function Pal.PalAIController.IsExistPathForLocation_ForBP_HeightRangeCheck
struct APalAIController_IsExistPathForLocation_ForBP_HeightRangeCheck_Params
{
public:
	struct FVector                               Location;                                          // 0x0(0x18)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        AcceptanceRadius;                                  // 0x18(0x4)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        UpOffset;                                          // 0x1C(0x4)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        DownOffset;                                        // 0x20(0x4)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2A28[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               OutGoalLocation;                                   // 0x28(0x18)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x40(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2A29[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x20 (0x20 - 0x0)
// Function Pal.PalAIController.IsExistPathForLocation_ForBP
struct APalAIController_IsExistPathForLocation_ForBP_Params
{
public:
	struct FVector                               Location;                                          // 0x0(0x18)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        AcceptanceRadius;                                  // 0x18(0x4)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x1C(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2A2E[0x3];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x1 (0x1 - 0x0)
// Function Pal.PalAIController.IsActiveAI
struct APalAIController_IsActiveAI_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Pal.PalAIController.GetSquadLeader
struct APalAIController_GetSquadLeader_Params
{
public:
	class APalCharacter*                         ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Pal.PalAIController.GetSquad
struct APalAIController_GetSquad_Params
{
public:
	class UPalSquad*                             ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Pal.PalAIController.GetMyPalBlackboard
struct APalAIController_GetMyPalBlackboard_Params
{
public:
	class UPalAIBlackboardBase*                  ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Pal.PalAIController.GetLeaderPalBlackboard
struct APalAIController_GetLeaderPalBlackboard_Params
{
public:
	class UPalAIBlackboardBase*                  ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function Pal.PalAIController.GetIsSquadBehaviour
struct APalAIController_GetIsSquadBehaviour_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function Pal.PalAIController.GetIsnotSleepWildLife
struct APalAIController_GetIsnotSleepWildLife_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Pal.PalAIController.GetHateSystem
struct APalAIController_GetHateSystem_Params
{
public:
	class UPalHate*                              ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Pal.PalAIController.GetAIActionComponent
struct APalAIController_GetAIActionComponent_Params
{
public:
	class UPalAIActionComponent*                 ReturnValue;                                       // 0x0(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x30 (0x30 - 0x0)
// Function Pal.PalAIController.FindReachablePathLocation
struct APalAIController_FindReachablePathLocation_Params
{
public:
	TArray<struct FVector>                       RequestLocationArray;                              // 0x0(0x10)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FVector                               OutGoalLocation;                                   // 0x10(0x18)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x28(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2A51[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x20 (0x20 - 0x0)
// Function Pal.PalAIController.FindNearestNavmeshPointFromSelf
struct APalAIController_FindNearestNavmeshPointFromSelf_Params
{
public:
	struct FVector                               OutLocation;                                       // 0x0(0x18)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x18(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2A57[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x10 (0x10 - 0x0)
// Function Pal.PalAIController.CopyTargetFromOtherAI
struct APalAIController_CopyTargetFromOtherAI_Params
{
public:
	class AActor*                                FromAcotr;                                         // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                ReturnValue;                                       // 0x8(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Pal.PalAIController.AddTargetPlayer_ForEnemy
struct APalAIController_AddTargetPlayer_ForEnemy_Params
{
public:
	class AActor*                                PlayerOrPal;                                       // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Pal.PalAIController.AddTargetNPC
struct APalAIController_AddTargetNPC_Params
{
public:
	class AActor*                                NPC;                                               // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Pal.PalAIControllerBaseCampStatus.GetBaseCampId
struct UPalAIControllerBaseCampStatus_GetBaseCampId_Params
{
public:
	struct FGuid                                 ReturnValue;                                       // 0x0(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Pal.PalAIControllerBaseCampStatus.GetBaseCamp
struct UPalAIControllerBaseCampStatus_GetBaseCamp_Params
{
public:
	class UPalBaseCampModel*                     ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Pal.PalAIControllerWorkerInterface.GetWorkerModuleClass
struct IPalAIControllerWorkerInterface_GetWorkerModuleClass_Params
{
public:
	TSubclassOf<class UPalAIControllerWorkerModule> ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function Pal.PalAISensorComponent.SightCheckAllPlayer
struct UPalAISensorComponent_SightCheckAllPlayer_Params
{
public:
	TArray<class APalCharacter*>                 InSightPlayers;                                    // 0x0(0x10)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	float                                        RangeRate;                                         // 0x10(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2A87[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x10 (0x10 - 0x0)
// Function Pal.PalAISensorComponent.SightCheckAllEdibleDeadNPC
struct UPalAISensorComponent_SightCheckAllEdibleDeadNPC_Params
{
public:
	TArray<class APalCharacter*>                 InSightCharacters;                                 // 0x0(0x10)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Pal.PalAISensorComponent.SightCheckAllAliveNPC
struct UPalAISensorComponent_SightCheckAllAliveNPC_Params
{
public:
	TArray<class APalCharacter*>                 InSightCharacters;                                 // 0x0(0x10)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0xC (0xC - 0x0)
// Function Pal.PalAISensorComponent.SetDisableSightFlag
struct UPalAISensorComponent_SetDisableSightFlag_Params
{
public:
	class FName                                  FlagName;                                          // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         IsDisable;                                         // 0x8(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2A8D[0x3];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x8 (0x8 - 0x0)
// Function Pal.PalAISensorComponent.SetDebugAIResponse
struct UPalAISensorComponent_SetDebugAIResponse_Params
{
public:
	TSubclassOf<class UPalAIResponsePreset>      PresetClass;                                       // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x30 (0x30 - 0x0)
// Function Pal.PalAISensorComponent.SelectResponseBySenses
struct UPalAISensorComponent_SelectResponseBySenses_Params
{
public:
	enum class EPalAIResponseType                CurrentBehavior;                                   // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2A93[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class APalCharacter*>                 FindCharacters;                                    // 0x8(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                         IsDamaged;                                         // 0x18(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2A94[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class APalCharacter*                         OutTargetCharacter;                                // 0x20(0x8)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EPalAIResponseType                ReturnValue;                                       // 0x28(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2A95[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x18 (0x18 - 0x0)
// DelegateFunction Pal.PalAISensorComponent.ReceiveSoundDelegate__DelegateSignature
struct UPalAISensorComponent_ReceiveSoundDelegate__DelegateSignature_Params
{
public:
	struct FVector                               EmitLocation;                                      // 0x0(0x18)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x28 (0x28 - 0x0)
// Function Pal.PalAISensorComponent.ReceiveSound
struct UPalAISensorComponent_ReceiveSound_Params
{
public:
	int32                                        SoundRadius;                                       // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2A9C[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               EmitLocation;                                      // 0x8(0x18)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                Emitter;                                           // 0x20(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// Function Pal.PalAISensorComponent.MaximumStrengthEnemy
struct UPalAISensorComponent_MaximumStrengthEnemy_Params
{
public:
	TArray<class APalCharacter*>                 FindCharacters;                                    // 0x0(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	enum class EPalBiologicalGradeComparedResult Result;                                            // 0x10(0x1)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2AA2[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class APalCharacter*                         ReturnValue;                                       // 0x18(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function Pal.PalAISensorComponent.IsInSightKillerAndDeadBody
struct UPalAISensorComponent_IsInSightKillerAndDeadBody_Params
{
public:
	class AActor*                                Killer;                                            // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                DeadBody;                                          // 0x8(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x10(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2AA5[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x50 (0x50 - 0x0)
// Function Pal.PalAISensorComponent.DeadAutoRemoveDelegate
struct UPalAISensorComponent_DeadAutoRemoveDelegate_Params
{
public:
	struct FPalDeadInfo                          DeadInfo;                                          // 0x0(0x50)(Parm, NoDestructor, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Pal.PalAISightResponsePreset.FindDelegate__DelegateSignature
struct UPalAISightResponsePreset_FindDelegate__DelegateSignature_Params
{
public:
	class APalCharacter*                         SelfCharacter;                                     // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class APalCharacter*                         FoundCharacter;                                    // 0x8(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Pal.PalAISightResponseTransitionableInterface.GetTransitionableJudgementType
struct IPalAISightResponseTransitionableInterface_GetTransitionableJudgementType_Params
{
public:
	TArray<enum class EPalAISightJudgementType>  JudgeTypeList;                                     // 0x0(0x10)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Pal.PalAmbientSoundAreaBase.OnEndOverlap
struct APalAmbientSoundAreaBase_OnEndOverlap_Params
{
public:
	class UPrimitiveComponent*                   OverlappedComponent;                               // 0x0(0x8)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class APalPlayerCharacter*                   PlayerCharacter;                                   // 0x8(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Pal.PalAmbientSoundAreaBase.OnBeginOverlap
struct APalAmbientSoundAreaBase_OnBeginOverlap_Params
{
public:
	class UPrimitiveComponent*                   OverlappedComponent;                               // 0x0(0x8)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class APalPlayerCharacter*                   PlayerCharacter;                                   // 0x8(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Pal.PalAmbientSoundAreaBase.GetAreaCollision
struct APalAmbientSoundAreaBase_GetAreaCollision_Params
{
public:
	class UPrimitiveComponent*                   ReturnValue;                                       // 0x0(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x28 (0x28 - 0x0)
// Function Pal.PalAmbientSoundAreaBase.GetAmbientSoundAreaData
struct APalAmbientSoundAreaBase_GetAmbientSoundAreaData_Params
{
public:
	struct FPalAmbientSoundAreaData              ReturnValue;                                       // 0x0(0x28)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// 0x108 (0x108 - 0x0)
// Function Pal.PalAmbientSoundLineObject.OnActivateTriggerOverlapBegin
struct UPalAmbientSoundLineObject_OnActivateTriggerOverlapBegin_Params
{
public:
	class UPrimitiveComponent*                   OverlappedComp;                                    // 0x0(0x8)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                OtherActor;                                        // 0x8(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                   OtherComp;                                         // 0x10(0x8)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        OtherBodyIndex;                                    // 0x18(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bFromSweep;                                        // 0x1C(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2AF4[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FHitResult                            SweepResult;                                       // 0x20(0xE8)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// Function Pal.PalAmbientSoundLineObject.OnActivateTriggerLineOverlapEnd
struct UPalAmbientSoundLineObject_OnActivateTriggerLineOverlapEnd_Params
{
public:
	class UPrimitiveComponent*                   OverlappedComponent;                               // 0x0(0x8)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                OtherActor;                                        // 0x8(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                   OtherComp;                                         // 0x10(0x8)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        OtherBodyIndex;                                    // 0x18(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2AF8[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0xC (0xC - 0x0)
// Function Pal.PalAnimInstance.SetUpperOverrideDisableFlag
struct UPalAnimInstance_SetUpperOverrideDisableFlag_Params
{
public:
	class FName                                  FlagName;                                          // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         IsDisable;                                         // 0x8(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2B08[0x3];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0xC (0xC - 0x0)
// Function Pal.PalAnimInstance.SetAdditiveAnimationRate
struct UPalAnimInstance_SetAdditiveAnimationRate_Params
{
public:
	class FName                                  FlagName;                                          // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        Rate;                                              // 0x8(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x28 (0x28 - 0x0)
// Function Pal.PalAnimInstance.OnNotifyEndReceived
struct UPalAnimInstance_OnNotifyEndReceived_Params
{
public:
	class FName                                  NotifyName;                                        // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FBranchingPointNotifyPayload          BranchingPointNotifyPayload;                       // 0x8(0x20)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};

// 0x28 (0x28 - 0x0)
// Function Pal.PalAnimInstance.OnNotifyBeginReceived
struct UPalAnimInstance_OnNotifyBeginReceived_Params
{
public:
	class FName                                  NotifyName;                                        // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FBranchingPointNotifyPayload          BranchingPointNotifyPayload;                       // 0x8(0x20)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Pal.PalAnimInstance.OnMontageNotifyEnd__DelegateSignature
struct UPalAnimInstance_OnMontageNotifyEnd__DelegateSignature_Params
{
public:
	class UAnimMontage*                          Montage;                                           // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  NotifyName;                                        // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Pal.PalAnimInstance.OnMontageNotifyBegin__DelegateSignature
struct UPalAnimInstance_OnMontageNotifyBegin__DelegateSignature_Params
{
public:
	class UAnimMontage*                          Montage;                                           // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  NotifyName;                                        // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Pal.PalAnimInstance.OnMontageEndedCallback
struct UPalAnimInstance_OnMontageEndedCallback_Params
{
public:
	class UAnimMontage*                          Montage;                                           // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bInterrupted;                                      // 0x8(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2B21[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x10 (0x10 - 0x0)
// Function Pal.PalAnimInstance.Montage_PlayList
struct UPalAnimInstance_Montage_PlayList_Params
{
public:
	TArray<struct FReserveMontage>               MontageList;                                       // 0x0(0x10)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// Function Pal.PalAnimInstance.GetNearBoneInSpines
struct UPalAnimInstance_GetNearBoneInSpines_Params
{
public:
	struct FVector                               FromPos;                                           // 0x0(0x18)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  ReturnValue;                                       // 0x18(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// Function Pal.PalAnimInstance.GetNearBoneInFullBody
struct UPalAnimInstance_GetNearBoneInFullBody_Params
{
public:
	struct FVector                               FromPos;                                           // 0x0(0x18)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  ReturnValue;                                       // 0x18(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function Pal.PalAnimInstance.GetCurrentMontagePlayTimeToEnd
struct UPalAnimInstance_GetCurrentMontagePlayTimeToEnd_Params
{
public:
	float                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x70 (0x70 - 0x0)
// Function Pal.PalAnimInstance.GetBoneTransform
struct UPalAnimInstance_GetBoneTransform_Params
{
public:
	class FName                                  BoneName;                                          // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2B4F[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FTransform                            ReturnValue;                                       // 0x10(0x60)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x30 (0x30 - 0x0)
// Function Pal.PalAnimInstance.GetBoneRotationComponentSpace
struct UPalAnimInstance_GetBoneRotationComponentSpace_Params
{
public:
	class FName                                  BoneName;                                          // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2B52[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FQuat                                 ReturnValue;                                       // 0x10(0x20)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x30 (0x30 - 0x0)
// Function Pal.PalAnimInstance.GetBoneRotation
struct UPalAnimInstance_GetBoneRotation_Params
{
public:
	class FName                                  BoneName;                                          // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2B55[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FQuat                                 ReturnValue;                                       // 0x10(0x20)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// Function Pal.PalAnimInstance.GetBonePosition
struct UPalAnimInstance_GetBonePosition_Params
{
public:
	class FName                                  BoneName;                                          // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                               ReturnValue;                                       // 0x8(0x18)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Pal.PalAnimInstance.GetBoneInfo
struct UPalAnimInstance_GetBoneInfo_Params
{
public:
	class FName                                  BoneName;                                          // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPalBoneInfo*                          ReturnValue;                                       // 0x8(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x14 (0x14 - 0x0)
// Function Pal.PalAnimInstance.CalcLength
struct UPalAnimInstance_CalcLength_Params
{
public:
	class FName                                  Target;                                            // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  NextBone;                                          // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        TipLength;                                         // 0x10(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0xC (0xC - 0x0)
// Function Pal.PalAnimInstance.BodyInstance_SetSimulate
struct UPalAnimInstance_BodyInstance_SetSimulate_Params
{
public:
	class FName                                  BoneName;                                          // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         SimulateActive;                                    // 0x8(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2B65[0x3];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x8 (0x8 - 0x0)
// Function Pal.PalAnimInstance.AddSpinesListFromBoneList
struct UPalAnimInstance_AddSpinesListFromBoneList_Params
{
public:
	class FName                                  BoneName;                                          // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Pal.PalAnimInstance.AddList
struct UPalAnimInstance_AddList_Params
{
public:
	class FName                                  BoneName;                                          // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x48 (0x48 - 0x0)
// Function Pal.PalAnimNotifyState_AttackCollision.OnHit
struct UPalAnimNotifyState_AttackCollision_OnHit_Params
{
public:
	class UPrimitiveComponent*                   MyHitComponent;                                    // 0x0(0x8)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                HitActor;                                          // 0x8(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                   HitComponent;                                      // 0x10(0x8)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<int32>                                FoliageIndex;                                      // 0x18(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	struct FVector                               HitLocation;                                       // 0x28(0x18)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        HitCount;                                          // 0x40(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2BA7[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x48 (0x48 - 0x0)
// Function Pal.PalAnimNotify_FootStep.SpawnFootStepEffect
struct UPalAnimNotify_FootStep_SpawnFootStepEffect_Params
{
public:
	class UObject*                               WorldObject;                                       // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EPalLandingType                   LandingType;                                       // 0x8(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EPhysicalSurface                  PhysicalSurface;                                   // 0x9(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2BF5[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               Location;                                          // 0x10(0x18)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                              Rotation;                                          // 0x28(0x18)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	class UPalStaticCharacterParameterComponent* StaticParam;                                       // 0x40(0x8)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x48 (0x48 - 0x0)
// Function Pal.PalAnimNotify_FootStep.SpawnFootStepDecal
struct UPalAnimNotify_FootStep_SpawnFootStepDecal_Params
{
public:
	class AActor*                                Owner;                                             // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EPhysicalSurface                  PhysicalSurface;                                   // 0x8(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EPalFootType                      FootType;                                          // 0x9(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2BF7[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               Location;                                          // 0x10(0x18)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                               CurrentNormal;                                     // 0x28(0x18)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        LifeSpan;                                          // 0x40(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        FadeTime;                                          // 0x44(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x160 (0x160 - 0x0)
// Function Pal.PalAnimNotify_FootStep.GetFloorPosition
struct UPalAnimNotify_FootStep_GetFloorPosition_Params
{
public:
	class AActor*                                Owner;                                             // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2BF9[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FTransform                            FootTransform;                                     // 0x10(0x60)(Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FHitResult                            HitResult;                                         // 0x70(0xE8)(Parm, OutParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x158(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2BFA[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x10 (0x10 - 0x0)
// Function Pal.PalAnimNotify_RequestRideShakeAnimation.OnEndMotion
struct UPalAnimNotify_RequestRideShakeAnimation_OnEndMotion_Params
{
public:
	class UAnimMontage*                          Montage;                                           // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bInterrupted;                                      // 0x8(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2C15[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x8 (0x8 - 0x0)
// Function Pal.PalHitFilter.UnbindPrimitiveComponent
struct UPalHitFilter_UnbindPrimitiveComponent_Params
{
public:
	class UPrimitiveComponent*                   Component;                                         // 0x0(0x8)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function Pal.PalHitFilter.SetIntersectionNum
struct UPalHitFilter_SetIntersectionNum_Params
{
public:
	int32                                        Num;                                               // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Pal.PalHitFilter.SetAttacker
struct UPalHitFilter_SetAttacker_Params
{
public:
	class AActor*                                Attacker;                                          // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// DelegateFunction Pal.PalHitFilter.OverlapEndDelegate__DelegateSignature
struct UPalHitFilter_OverlapEndDelegate__DelegateSignature_Params
{
public:
	class UPrimitiveComponent*                   MyHitComponent;                                    // 0x0(0x8)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                OtherHitActor;                                     // 0x8(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                   OtherHitComponent;                                 // 0x10(0x8)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x48 (0x48 - 0x0)
// DelegateFunction Pal.PalHitFilter.OnHitDelegate__DelegateSignature
struct UPalHitFilter_OnHitDelegate__DelegateSignature_Params
{
public:
	class UPrimitiveComponent*                   MyHitComponent;                                    // 0x0(0x8)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                OtherHitActor;                                     // 0x8(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                   OtherHitComponent;                                 // 0x10(0x8)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<int32>                                FoliageIndex;                                      // 0x18(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	struct FVector                               HitLocation;                                       // 0x28(0x18)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        HitCount;                                          // 0x40(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2C3C[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x20 (0x20 - 0x0)
// Function Pal.PalHitFilter.OnEndOverlap
struct UPalHitFilter_OnEndOverlap_Params
{
public:
	class UPrimitiveComponent*                   OverlappedComp;                                    // 0x0(0x8)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                Other;                                             // 0x8(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                   OtherComp;                                         // 0x10(0x8)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        OtherBodyIndex;                                    // 0x18(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2C43[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x108 (0x108 - 0x0)
// Function Pal.PalHitFilter.OnBeginOverlap
struct UPalHitFilter_OnBeginOverlap_Params
{
public:
	class UPrimitiveComponent*                   HitComp;                                           // 0x0(0x8)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                OtherActor;                                        // 0x8(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                   OtherComp;                                         // 0x10(0x8)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        OtherBodyIndex;                                    // 0x18(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bFromSweep;                                        // 0x1C(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2C47[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FHitResult                            Hit;                                               // 0x20(0xE8)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Pal.PalHitFilter.BindPrimitiveComponent
struct UPalHitFilter_BindPrimitiveComponent_Params
{
public:
	class UPrimitiveComponent*                   Component;                                         // 0x0(0x8)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function Pal.PalAudioSettingSystem.Tick_BP
struct UPalAudioSettingSystem_Tick_BP_Params
{
public:
	float                                        DeltaTime;                                         // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x3 (0x3 - 0x0)
// Function Pal.PalAudioSettingSystem.StartAudioFade
struct UPalAudioSettingSystem_StartAudioFade_Params
{
public:
	enum class EPalAudioBus                      AudioBus;                                          // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EPalAudioFadeType                 FadeType;                                          // 0x1(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bImmediately;                                      // 0x2(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Pal.PalAudioSettingSystem.SetAudioBusVolume
struct UPalAudioSettingSystem_SetAudioBusVolume_Params
{
public:
	enum class EPalAudioBus                      AudioBus;                                          // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2C6A[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FName                                  Key;                                               // 0x4(0x8)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        Volume;                                            // 0xC(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x2 (0x2 - 0x0)
// Function Pal.PalAudioSettingSystem.SetAudioBusMute
struct UPalAudioSettingSystem_SetAudioBusMute_Params
{
public:
	enum class EPalAudioBus                      AudioBus;                                          // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         IsMute;                                            // 0x1(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function Pal.PalAudioSettingSystem.PalAudioBusToString
struct UPalAudioSettingSystem_PalAudioBusToString_Params
{
public:
	enum class EPalAudioBus                      AudioBus;                                          // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2C72[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FString                                ReturnValue;                                       // 0x8(0x10)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x2 (0x2 - 0x0)
// Function Pal.PalAudioSettingSystem.IsAudioBusMute
struct UPalAudioSettingSystem_IsAudioBusMute_Params
{
public:
	enum class EPalAudioBus                      AudioBus;                                          // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x1(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Pal.PalAudioSettingSystem.GetAudioBusVolume
struct UPalAudioSettingSystem_GetAudioBusVolume_Params
{
public:
	enum class EPalAudioBus                      AudioBus;                                          // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2C7F[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        ReturnValue;                                       // 0x4(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function Pal.PalAudioUtility.OnPlayerExitSpot
struct UPalAudioUtility_OnPlayerExitSpot_Params
{
public:
	class UObject*                               WorldContextObject;                                // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class APalPlayerCharacter*                   Player;                                            // 0x8(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class APalSpotAreaBase*                      SpotArea;                                          // 0x10(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function Pal.PalAudioUtility.OnPlayerExitBaseCamp
struct UPalAudioUtility_OnPlayerExitBaseCamp_Params
{
public:
	class UObject*                               WorldContextObject;                                // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class APalPlayerCharacter*                   Player;                                            // 0x8(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPalBaseCampModel*                     BaseCampModel;                                     // 0x10(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function Pal.PalAudioUtility.OnPlayerExitAmbientArea
struct UPalAudioUtility_OnPlayerExitAmbientArea_Params
{
public:
	class UObject*                               WorldContextObject;                                // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class APalPlayerCharacter*                   Player;                                            // 0x8(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class APalAmbientSoundAreaBase*              SpotArea;                                          // 0x10(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function Pal.PalAudioUtility.OnPlayerEnterSpot
struct UPalAudioUtility_OnPlayerEnterSpot_Params
{
public:
	class UObject*                               WorldContextObject;                                // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class APalPlayerCharacter*                   Player;                                            // 0x8(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class APalSpotAreaBase*                      SpotArea;                                          // 0x10(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function Pal.PalAudioUtility.OnPlayerEnterBaseCamp
struct UPalAudioUtility_OnPlayerEnterBaseCamp_Params
{
public:
	class UObject*                               WorldContextObject;                                // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class APalPlayerCharacter*                   Player;                                            // 0x8(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPalBaseCampModel*                     BaseCampModel;                                     // 0x10(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function Pal.PalAudioUtility.OnPlayerEnterAmbientArea
struct UPalAudioUtility_OnPlayerEnterAmbientArea_Params
{
public:
	class UObject*                               WorldContextObject;                                // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class APalPlayerCharacter*                   Player;                                            // 0x8(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class APalAmbientSoundAreaBase*              SpotArea;                                          // 0x10(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function Pal.PalAudioWorldSubsystem.Tick_BP
struct UPalAudioWorldSubsystem_Tick_BP_Params
{
public:
	float                                        DeltaTime;                                         // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// Function Pal.PalAudioWorldSubsystem.SetSwitch
struct UPalAudioWorldSubsystem_SetSwitch_Params
{
public:
	class FString                                SwitchGroup;                                       // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                SwitchState;                                       // 0x10(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0xC (0xC - 0x0)
// Function Pal.PalAudioWorldSubsystem.SetStateFlagByName
struct UPalAudioWorldSubsystem_SetStateFlagByName_Params
{
public:
	class FName                                  StateGroup;                                        // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         Flg;                                               // 0x8(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2CAA[0x3];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x2 (0x2 - 0x0)
// Function Pal.PalAudioWorldSubsystem.SetStateFlagByEnum
struct UPalAudioWorldSubsystem_SetStateFlagByEnum_Params
{
public:
	enum class EPalAudioStateGroup               StateGroup;                                        // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         Flg;                                               // 0x1(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Pal.PalAudioWorldSubsystem.SetStateByName
struct UPalAudioWorldSubsystem_SetStateByName_Params
{
public:
	class FName                                  StateGroup;                                        // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  State;                                             // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x2 (0x2 - 0x0)
// Function Pal.PalAudioWorldSubsystem.SetStateByEnum
struct UPalAudioWorldSubsystem_SetStateByEnum_Params
{
public:
	enum class EPalAudioStateGroup               StateGroup;                                        // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EPalAudioState                    State;                                             // 0x1(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function Pal.PalAudioWorldSubsystem.SetSoundPlayerLocation
struct UPalAudioWorldSubsystem_SetSoundPlayerLocation_Params
{
public:
	struct FVector                               Location;                                          // 0x0(0x18)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Pal.PalAudioWorldSubsystem.SetRTPCValueByName
struct UPalAudioWorldSubsystem_SetRTPCValueByName_Params
{
public:
	class FName                                  Name;                                              // 0x0(0x8)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        Value;                                             // 0x8(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        InterpolSec;                                       // 0xC(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0xC (0xC - 0x0)
// Function Pal.PalAudioWorldSubsystem.SetRTPCValueByEnum
struct UPalAudioWorldSubsystem_SetRTPCValueByEnum_Params
{
public:
	enum class EPalAudioRTPC                     RTPC;                                              // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2CB8[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        Value;                                             // 0x4(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        InterpolSec;                                       // 0x8(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function Pal.PalAudioWorldSubsystem.SetOutputBusVolume
struct UPalAudioWorldSubsystem_SetOutputBusVolume_Params
{
public:
	float                                        Volume;                                            // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Pal.PalAudioWorldSubsystem.PostTriggerByString
struct UPalAudioWorldSubsystem_PostTriggerByString_Params
{
public:
	class FString                                Trigger;                                           // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function Pal.PalAudioWorldSubsystem.PostTriggerByEnum
struct UPalAudioWorldSubsystem_PostTriggerByEnum_Params
{
public:
	enum class EPalAudioTrigger                  Trigger;                                           // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Pal.PalAudioWorldSubsystem.PlaySound
struct UPalAudioWorldSubsystem_PlaySound_Params
{
public:
	class UAkAudioEvent*                         AudioEvent;                                        // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPalSoundOptions                      Options;                                           // 0x8(0x4)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	int32                                        ReturnValue;                                       // 0xC(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Pal.PalAudioWorldSubsystem.OnSpawnedLocalPlayerCharacter
struct UPalAudioWorldSubsystem_OnSpawnedLocalPlayerCharacter_Params
{
public:
	class APawn*                                 Pawn;                                              // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AController*                           Controller;                                        // 0x8(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Pal.PalAudioWorldSubsystem.OnPlayerExitSpotArea
struct UPalAudioWorldSubsystem_OnPlayerExitSpotArea_Params
{
public:
	class APalPlayerCharacter*                   Player;                                            // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class APalSpotAreaBase*                      SpotArea;                                          // 0x8(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Pal.PalAudioWorldSubsystem.OnPlayerExitBaseCamp
struct UPalAudioWorldSubsystem_OnPlayerExitBaseCamp_Params
{
public:
	class APalPlayerCharacter*                   Player;                                            // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPalBaseCampModel*                     BaseCampModel;                                     // 0x8(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Pal.PalAudioWorldSubsystem.OnPlayerExitAmbientArea
struct UPalAudioWorldSubsystem_OnPlayerExitAmbientArea_Params
{
public:
	class APalPlayerCharacter*                   Player;                                            // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class APalAmbientSoundAreaBase*              AmbientSoundArea;                                  // 0x8(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Pal.PalAudioWorldSubsystem.OnPlayerEnterSpotArea
struct UPalAudioWorldSubsystem_OnPlayerEnterSpotArea_Params
{
public:
	class APalPlayerCharacter*                   Player;                                            // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class APalSpotAreaBase*                      SpotArea;                                          // 0x8(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Pal.PalAudioWorldSubsystem.OnPlayerEnterBaseCamp
struct UPalAudioWorldSubsystem_OnPlayerEnterBaseCamp_Params
{
public:
	class APalPlayerCharacter*                   Player;                                            // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPalBaseCampModel*                     BaseCampModel;                                     // 0x8(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Pal.PalAudioWorldSubsystem.OnPlayerEnterAmbientArea
struct UPalAudioWorldSubsystem_OnPlayerEnterAmbientArea_Params
{
public:
	class APalPlayerCharacter*                   Player;                                            // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class APalAmbientSoundAreaBase*              AmbientSoundArea;                                  // 0x8(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Pal.PalAudioWorldSubsystem.OnAkPostEventCallback
struct UPalAudioWorldSubsystem_OnAkPostEventCallback_Params
{
public:
	enum class EAkCallbackType                   CallbackType;                                      // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2CE4[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UAkCallbackInfo*                       CallbackInfo;                                      // 0x8(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Pal.PalAudioWorldSubsystem.InitializeSystem
struct UPalAudioWorldSubsystem_InitializeSystem_Params
{
public:
	class AActor*                                AkOwnerActor;                                      // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function Pal.PalAudioWorldSubsystem.GetSoundPlayerLocation
struct UPalAudioWorldSubsystem_GetSoundPlayerLocation_Params
{
public:
	struct FVector                               OutLocation;                                       // 0x0(0x18)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function Pal.PalAudioWorldSubsystem.FadeOutByPlayingId
struct UPalAudioWorldSubsystem_FadeOutByPlayingId_Params
{
public:
	int32                                        PlayingID;                                         // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Pal.PalAutoDestroyActorHolder.AddActor
struct UPalAutoDestroyActorHolder_AddActor_Params
{
public:
	class AActor*                                TargetActor;                                       // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Pal.PalBaseCampAssignableObjectInterface.ToMapObjectModel
struct IPalBaseCampAssignableObjectInterface_ToMapObjectModel_Params
{
public:
	TScriptInterface<class IPalMapObjectModelInterface> ReturnValue;                                       // 0x0(0x10)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function Pal.PalBaseCampAssignableObjectInterface.GetAssignType
struct IPalBaseCampAssignableObjectInterface_GetAssignType_Params
{
public:
	enum class EPalBaseCampAssignType            ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Pal.PalBaseCampEnemyObserver.OnEndPlayEnemy
struct UPalBaseCampEnemyObserver_OnEndPlayEnemy_Params
{
public:
	class AActor*                                Actor;                                             // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EEndPlayReason                    EndPlayReason;                                     // 0x8(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2D2B[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x50 (0x50 - 0x0)
// Function Pal.PalBaseCampEnemyObserver.OnDeadEnemy
struct UPalBaseCampEnemyObserver_OnDeadEnemy_Params
{
public:
	struct FPalDeadInfo                          DeadInfo;                                          // 0x0(0x50)(Parm, NoDestructor, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function Pal.PalBaseCampEnemyObserver.IsBattleMode
struct UPalBaseCampEnemyObserver_IsBattleMode_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// Function Pal.PalBaseCampManager.TryGetModel
struct UPalBaseCampManager_TryGetModel_Params
{
public:
	struct FGuid                                 BaseCampId;                                        // 0x0(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPalBaseCampModel*                     OutModel;                                          // 0x10(0x8)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x18(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2D55[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x10 (0x10 - 0x0)
// Function Pal.PalBaseCampManager.RequestDismantalDistanceBaseCamp
struct UPalBaseCampManager_RequestDismantalDistanceBaseCamp_Params
{
public:
	struct FGuid                                 InstanceId;                                        // 0x0(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Pal.PalBaseCampManager.OnUpdateLocationWork_ServerInternal
struct UPalBaseCampManager_OnUpdateLocationWork_ServerInternal_Params
{
public:
	class UPalWorkBase*                          Work;                                              // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Pal.PalBaseCampManager.OnUnregisteredWork_ServerInternal
struct UPalBaseCampManager_OnUnregisteredWork_ServerInternal_Params
{
public:
	class UPalWorkBase*                          Work;                                              // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Pal.PalBaseCampManager.OnRegisteredNewWork_ServerInternal
struct UPalBaseCampManager_OnRegisteredNewWork_ServerInternal_Params
{
public:
	class UPalWorkBase*                          Work;                                              // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// Function Pal.PalBaseCampManager.OnCreateMapObjectModelInServer
struct UPalBaseCampManager_OnCreateMapObjectModelInServer_Params
{
public:
	class UPalMapObjectModel*                    CreatedModel;                                      // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                               Location;                                          // 0x8(0x18)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// Function Pal.PalBaseCampManager.GetNearestBaseCamp
struct UPalBaseCampManager_GetNearestBaseCamp_Params
{
public:
	struct FVector                               Location;                                          // 0x0(0x18)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPalBaseCampModel*                     ReturnValue;                                       // 0x18(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x28 (0x28 - 0x0)
// Function Pal.PalBaseCampManager.GetInRangedBaseCamp
struct UPalBaseCampManager_GetInRangedBaseCamp_Params
{
public:
	struct FVector                               Location;                                          // 0x0(0x18)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        Margin;                                            // 0x18(0x4)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2D90[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UPalBaseCampModel*                     ReturnValue;                                       // 0x20(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Pal.PalBaseCampManager.GetBaseCampIds
struct UPalBaseCampManager_GetBaseCampIds_Params
{
public:
	TArray<struct FGuid>                         OutIds;                                            // 0x0(0x10)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Pal.PalBaseCampMapObjectCollection.OnNotAvailableConcreteModel
struct UPalBaseCampMapObjectCollection_OnNotAvailableConcreteModel_Params
{
public:
	class UPalMapObjectConcreteModelBase*        Model;                                             // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function Pal.PalBaseCampMapObjectCollection.OnDisposeMapObject
struct UPalBaseCampMapObjectCollection_OnDisposeMapObject_Params
{
public:
	class UPalMapObjectModel*                    Model;                                             // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPalMapObjectDisposeOptions           Options;                                           // 0x8(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Pal.PalBaseCampMapObjectCollection.OnAvailableConcreteModel
struct UPalBaseCampMapObjectCollection_OnAvailableConcreteModel_Params
{
public:
	class UPalMapObjectConcreteModelBase*        Model;                                             // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// DelegateFunction Pal.PalBaseCampMapObjectCollection.MapObjectInstanceDelegate__DelegateSignature
struct UPalBaseCampMapObjectCollection_MapObjectInstanceDelegate__DelegateSignature_Params
{
public:
	class UPalMapObjectModel*                    Model;                                             // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// DelegateFunction Pal.PalBaseCampMapObjectCollection.MapObjectConcreteModelDelegate__DelegateSignature
struct UPalBaseCampMapObjectCollection_MapObjectConcreteModelDelegate__DelegateSignature_Params
{
public:
	class UPalMapObjectConcreteModelBase*        Model;                                             // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Pal.PalBaseCampModel.UpdateLevel_ServerInternal
struct UPalBaseCampModel_UpdateLevel_ServerInternal_Params
{
public:
	int32                                        PlayerId;                                          // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        NewLevel;                                          // 0x4(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x40 (0x40 - 0x0)
// Function Pal.PalBaseCampModel.TryGetRandomPositionInside
struct UPalBaseCampModel_TryGetRandomPositionInside_Params
{
public:
	struct FVector                               Origin;                                            // 0x0(0x18)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        Radius;                                            // 0x18(0x4)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2DCA[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               ToLocation;                                        // 0x20(0x18)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x38(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2DD7[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x8 (0x8 - 0x0)
// DelegateFunction Pal.PalBaseCampModel.SimpleDelegate__DelegateSignature
struct UPalBaseCampModel_SimpleDelegate__DelegateSignature_Params
{
public:
	class UPalBaseCampModel*                     Model;                                             // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function Pal.PalBaseCampModel.ReflectLevel_InGuildProperty_Internal
struct UPalBaseCampModel_ReflectLevel_InGuildProperty_Internal_Params
{
public:
	int32                                        NewLevel;                                          // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function Pal.PalBaseCampModel.OnRep_Level_InGuildProperty
struct UPalBaseCampModel_OnRep_Level_InGuildProperty_Params
{
public:
	int32                                        OldLevel;                                          // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x50 (0x50 - 0x0)
// Function Pal.PalBaseCampModel.OnDamageInCampActor
struct UPalBaseCampModel_OnDamageInCampActor_Params
{
public:
	struct FPalDamageResult                      DamageResult;                                      // 0x0(0x50)(Parm, NoDestructor, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Pal.PalBaseCampModel.OnAddNewWorker
struct UPalBaseCampModel_OnAddNewWorker_Params
{
public:
	class UPalIndividualCharacterHandle*         AddCharacterHandle;                                // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Pal.PalBaseCampModel.GetWorkCollection
struct UPalBaseCampModel_GetWorkCollection_Params
{
public:
	class UPalBaseCampWorkCollection*            ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x60 (0x60 - 0x0)
// Function Pal.PalBaseCampModel.GetTransform
struct UPalBaseCampModel_GetTransform_Params
{
public:
	struct FTransform                            ReturnValue;                                       // 0x0(0x60)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function Pal.PalBaseCampModel.GetState
struct UPalBaseCampModel_GetState_Params
{
public:
	enum class EPalBaseCampState                 ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function Pal.PalBaseCampModel.GetRange
struct UPalBaseCampModel_GetRange_Params
{
public:
	float                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Pal.PalBaseCampModel.GetOwnerMapObjectInstanceId
struct UPalBaseCampModel_GetOwnerMapObjectInstanceId_Params
{
public:
	struct FGuid                                 ReturnValue;                                       // 0x0(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function Pal.PalBaseCampModel.GetLevel
struct UPalBaseCampModel_GetLevel_Params
{
public:
	int32                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Pal.PalBaseCampModel.GetId
struct UPalBaseCampModel_GetId_Params
{
public:
	struct FGuid                                 ReturnValue;                                       // 0x0(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Pal.PalBaseCampModel.GetGroupIdBelongTo
struct UPalBaseCampModel_GetGroupIdBelongTo_Params
{
public:
	struct FGuid                                 ReturnValue;                                       // 0x0(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Pal.PalBaseCampModel.GetEnemyObserver
struct UPalBaseCampModel_GetEnemyObserver_Params
{
public:
	class UPalBaseCampEnemyObserver*             ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Pal.PalBaseCampModel.GetBaseCampName
struct UPalBaseCampModel_GetBaseCampName_Params
{
public:
	class FString                                ReturnValue;                                       // 0x0(0x10)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x30 (0x30 - 0x0)
// Function Pal.PalBaseCampModel.FindWorkAssignableObject
struct UPalBaseCampModel_FindWorkAssignableObject_Params
{
public:
	class UPalIndividualCharacterHandle*         AssignIndividualHandle;                            // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                 WorkId;                                            // 0x8(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bFixedAssign;                                      // 0x18(0x1)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2E11[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UPalWorkBase*                          FoundObject;                                       // 0x20(0x8)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x28(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2E12[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x90 (0x90 - 0x0)
// Function Pal.PalBaseCampModel.FindNearestAssignableObject
struct UPalBaseCampModel_FindNearestAssignableObject_Params
{
public:
	class UPalIndividualCharacterHandle*         AssignIndividualHandle;                            // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2E2A[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FTransform                            Origin;                                            // 0x10(0x60)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        Range;                                             // 0x70(0x4)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bFixedAssign;                                      // 0x74(0x1)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2E2C[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TScriptInterface<class IPalBaseCampAssignableObjectInterface> FoundObject;                                       // 0x78(0x10)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x88(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2E2D[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Pal.PalBaseCampModel.BaseCampGuildPalStorageUpdateDelegate__DelegateSignature
struct UPalBaseCampModel_BaseCampGuildPalStorageUpdateDelegate__DelegateSignature_Params
{
public:
	class UPalBaseCampModel*                     Model;                                             // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPalGuildPalStorage*                   GuildPalStorage;                                   // 0x8(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// DelegateFunction Pal.PalBaseCampModuleEnergy_FunctionBase.UpdateEnergyAmountDelegate__DelegateSignature
struct UPalBaseCampModuleEnergy_FunctionBase_UpdateEnergyAmountDelegate__DelegateSignature_Params
{
public:
	class UPalBaseCampModuleEnergy_FunctionBase* Function;                                          // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Pal.PalBaseCampModuleEnergy_FunctionBase.InvokeOnUpdateEnergyAmount
struct UPalBaseCampModuleEnergy_FunctionBase_InvokeOnUpdateEnergyAmount_Params
{
public:
	class UPalMapObjectGenerateEnergyModel*      Model;                                             // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Pal.PalBaseCampModuleFacilityReservation.OnStartUseFacility_ServerInternal
struct UPalBaseCampModuleFacilityReservation_OnStartUseFacility_ServerInternal_Params
{
public:
	class UPalMapObjectConcreteModelBase*        Model;                                             // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPalIndividualCharacterHandle*         IndividualHandle;                                  // 0x8(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Pal.PalBaseCampModuleFacilityReservation.OnNotAvailableMapObjectInServer
struct UPalBaseCampModuleFacilityReservation_OnNotAvailableMapObjectInServer_Params
{
public:
	class UPalMapObjectConcreteModelBase*        ConcreteModel;                                     // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Pal.PalBaseCampModuleFacilityReservation.OnFinishUseFacility_ServerInternal
struct UPalBaseCampModuleFacilityReservation_OnFinishUseFacility_ServerInternal_Params
{
public:
	class UPalMapObjectConcreteModelBase*        Model;                                             // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Pal.PalBaseCampModuleFacilityReservation.OnAvailableMapObjectInServer
struct UPalBaseCampModuleFacilityReservation_OnAvailableMapObjectInServer_Params
{
public:
	class UPalMapObjectConcreteModelBase*        ConcreteModel;                                     // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Pal.PalBaseCampModuleItemStorage.OnUpdateItemContainer
struct UPalBaseCampModuleItemStorage_OnUpdateItemContainer_Params
{
public:
	class UPalMapObjectItemContainerModule*      ItemContainerModule;                               // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Pal.PalBaseCampModuleItemStorage.OnNotAvailableConcreteModel
struct UPalBaseCampModuleItemStorage_OnNotAvailableConcreteModel_Params
{
public:
	class UPalMapObjectConcreteModelBase*        ConcreteModel;                                     // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Pal.PalBaseCampModuleItemStorage.OnAvailableConcreteModel
struct UPalBaseCampModuleItemStorage_OnAvailableConcreteModel_Params
{
public:
	class UPalMapObjectConcreteModelBase*        ConcreteModel;                                     // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Pal.PalBaseCampModuleItemStorage.MulticastReturnSelfAndUpdatedContainerDelegate__DelegateSignature
struct UPalBaseCampModuleItemStorage_MulticastReturnSelfAndUpdatedContainerDelegate__DelegateSignature_Params
{
public:
	class UPalBaseCampModuleItemStorage*         Self;                                              // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPalItemContainer*                     UpdatedContainer;                                  // 0x8(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Pal.PalBaseCampModuleItemStorage.GetContainerIds
struct UPalBaseCampModuleItemStorage_GetContainerIds_Params
{
public:
	TArray<struct FPalContainerId>               OutContainerIds;                                   // 0x0(0x10)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Pal.PalBaseCampModuleMedical.OnReviveCharacter_ServerInternal
struct UPalBaseCampModuleMedical_OnReviveCharacter_ServerInternal_Params
{
public:
	class UPalIndividualCharacterParameter*      IndividualParameter;                               // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Pal.PalBaseCampModuleMedical.OnRemovedWorkerInServer
struct UPalBaseCampModuleMedical_OnRemovedWorkerInServer_Params
{
public:
	class UPalIndividualCharacterHandle*         IndividualHandle;                                  // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Pal.PalBaseCampModuleObjectMaintenance.OnRegisteredMapObject_ServerInternal
struct UPalBaseCampModuleObjectMaintenance_OnRegisteredMapObject_ServerInternal_Params
{
public:
	class UPalMapObjectModel*                    Model;                                             // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Pal.PalBaseCampModuleObjectMaintenance.OnGrantedEffectToMapObject_ServerInternal
struct UPalBaseCampModuleObjectMaintenance_OnGrantedEffectToMapObject_ServerInternal_Params
{
public:
	class UPalMapObjectModel*                    Model;                                             // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPalMapObjectModelEffectBase*          Effect;                                            // 0x8(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function Pal.PalBaseCampModuleObjectMaintenance.OnDisposeMapObject_ServerInternal
struct UPalBaseCampModuleObjectMaintenance_OnDisposeMapObject_ServerInternal_Params
{
public:
	class UPalMapObjectModel*                    Model;                                             // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPalMapObjectDisposeOptions           Options;                                           // 0x8(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Pal.PalBaseCampModuleObjectMaintenance_ExtinguishFire.OnTriggerByReachAccumulateTriggerValue
struct UPalBaseCampModuleObjectMaintenance_ExtinguishFire_OnTriggerByReachAccumulateTriggerValue_Params
{
public:
	class UPalMapObjectModelEffect_AccumulateTrigger* Effect_AccumulateTrigger;                          // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPalMapObjectModel*                    OwnerModel;                                        // 0x8(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Pal.PalBaseCampModulePassiveEffect.OnNotAvailableMapObjectInServer
struct UPalBaseCampModulePassiveEffect_OnNotAvailableMapObjectInServer_Params
{
public:
	class UPalMapObjectConcreteModelBase*        Model;                                             // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Pal.PalBaseCampModulePassiveEffect.OnAvailableMapObjectInServer
struct UPalBaseCampModulePassiveEffect_OnAvailableMapObjectInServer_Params
{
public:
	class UPalMapObjectConcreteModelBase*        Model;                                             // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// DelegateFunction Pal.PalBaseCampPassiveEffect_WorkHard.ReturnSelfDelegate__DelegateSignature
struct UPalBaseCampPassiveEffect_WorkHard_ReturnSelfDelegate__DelegateSignature_Params
{
public:
	class UPalBaseCampPassiveEffect_WorkHard*    Self;                                              // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function Pal.PalBaseCampPassiveEffect_WorkHard.GetWorkHardType
struct UPalBaseCampPassiveEffect_WorkHard_GetWorkHardType_Params
{
public:
	enum class EPalBaseCampPassiveEffectWorkHardType ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Pal.PalBaseCampModuleResourceCollector.OnRegisteredMapObjectModel
struct UPalBaseCampModuleResourceCollector_OnRegisteredMapObjectModel_Params
{
public:
	class UPalMapObjectModel*                    Model;                                             // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Pal.PalBaseCampModuleResourceCollector.OnRegisteredFoliageModel_ServerInternal
struct UPalBaseCampModuleResourceCollector_OnRegisteredFoliageModel_ServerInternal_Params
{
public:
	class UPalFoliageInstance*                   Instance;                                          // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function Pal.PalBaseCampModuleResourceCollector.OnDestroyedMapObjectModel
struct UPalBaseCampModuleResourceCollector_OnDestroyedMapObjectModel_Params
{
public:
	class UPalMapObjectModel*                    Model;                                             // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPalMapObjectDisposeOptions           Options;                                           // 0x8(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Pal.PalBaseCampModuleResourceCollector.OnDestroyedFoliageInstance
struct UPalBaseCampModuleResourceCollector_OnDestroyedFoliageInstance_Params
{
public:
	class UPalFoliageInstance*                   Instance;                                          // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Pal.PalBaseCampModuleTransportItemDirector.OnUpdateMapObjectContainer
struct UPalBaseCampModuleTransportItemDirector_OnUpdateMapObjectContainer_Params
{
public:
	class UPalMapObjectItemContainerModule*      ContainerModule;                                   // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x38 (0x38 - 0x0)
// Function Pal.PalBaseCampModuleTransportItemDirector.OnUnassignWorkTransportItemTarget
struct UPalBaseCampModuleTransportItemDirector_OnUnassignWorkTransportItemTarget_Params
{
public:
	class UPalWorkBase*                          Work;                                              // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPalInstanceID                        IndividualId;                                      // 0x8(0x30)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x38 (0x38 - 0x0)
// Function Pal.PalBaseCampModuleTransportItemDirector.OnUnassignWorkRequirement
struct UPalBaseCampModuleTransportItemDirector_OnUnassignWorkRequirement_Params
{
public:
	class UPalWorkBase*                          Work;                                              // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPalInstanceID                        IndividualId;                                      // 0x8(0x30)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Pal.PalBaseCampModuleTransportItemDirector.OnNotAvailableMapObjectConcreteModel
struct UPalBaseCampModuleTransportItemDirector_OnNotAvailableMapObjectConcreteModel_Params
{
public:
	class UPalMapObjectConcreteModelBase*        ConcreteModel;                                     // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Pal.PalBaseCampModuleTransportItemDirector.OnAvailableMapObjectConcreteModel
struct UPalBaseCampModuleTransportItemDirector_OnAvailableMapObjectConcreteModel_Params
{
public:
	class UPalMapObjectConcreteModelBase*        ConcreteModel;                                     // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x38 (0x38 - 0x0)
// Function Pal.PalBaseCampModuleTransportItemDirector.OnAssignWorkTransportItemTarget
struct UPalBaseCampModuleTransportItemDirector_OnAssignWorkTransportItemTarget_Params
{
public:
	class UPalWorkBase*                          Work;                                              // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPalInstanceID                        IndividualId;                                      // 0x8(0x30)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x38 (0x38 - 0x0)
// Function Pal.PalBaseCampModuleTransportItemDirector.OnAssignWorkRequirement
struct UPalBaseCampModuleTransportItemDirector_OnAssignWorkRequirement_Params
{
public:
	class UPalWorkBase*                          Work;                                              // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPalInstanceID                        IndividualId;                                      // 0x8(0x30)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x38 (0x38 - 0x0)
// DelegateFunction Pal.PalBaseCampWorkCollection.WorkAssignUpdateDelegate__DelegateSignature
struct UPalBaseCampWorkCollection_WorkAssignUpdateDelegate__DelegateSignature_Params
{
public:
	class UPalWorkBase*                          Work;                                              // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPalInstanceID                        IndividualId;                                      // 0x8(0x30)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// DelegateFunction Pal.PalBaseCampWorkCollection.WorkAssignRequirementDelegate__DelegateSignature
struct UPalBaseCampWorkCollection_WorkAssignRequirementDelegate__DelegateSignature_Params
{
public:
	class UPalWorkBase*                          Work;                                              // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPalWorkAssignRequirementParameter    RequirementParameter;                              // 0x8(0x18)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x38 (0x38 - 0x0)
// Function Pal.PalBaseCampWorkCollection.OnUnassignWork_ServerInternal
struct UPalBaseCampWorkCollection_OnUnassignWork_ServerInternal_Params
{
public:
	class UPalWorkBase*                          Work;                                              // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPalInstanceID                        IndividualId;                                      // 0x8(0x30)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// Function Pal.PalBaseCampWorkCollection.OnRequiredAssign_ServerInternal
struct UPalBaseCampWorkCollection_OnRequiredAssign_ServerInternal_Params
{
public:
	class UPalWorkBase*                          Work;                                              // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPalWorkAssignRequirementParameter    RequirementParameter;                              // 0x8(0x18)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// DelegateFunction Pal.PalBaseCampWorkerDirector.RemovedWorkerDelegate__DelegateSignature
struct UPalBaseCampWorkerDirector_RemovedWorkerDelegate__DelegateSignature_Params
{
public:
	class UPalIndividualCharacterHandle*         IndividualHandle;                                  // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function Pal.PalBaseCampWorkerDirector.OrderCommand
struct UPalBaseCampWorkerDirector_OrderCommand_Params
{
public:
	enum class EPalMapBaseCampWorkerOrderType    OrderType;                                         // 0x0(0x1)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Pal.PalBaseCampWorkerDirector.OnUpdateOwnerBaseCampStatus_ServerInternal
struct UPalBaseCampWorkerDirector_OnUpdateOwnerBaseCampStatus_ServerInternal_Params
{
public:
	class UPalBaseCampModel*                     OwnerBaseCamp;                                     // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x30 (0x30 - 0x0)
// Function Pal.PalBaseCampWorkerDirector.OnSpawnedCharacterInServer
struct UPalBaseCampWorkerDirector_OnSpawnedCharacterInServer_Params
{
public:
	struct FPalInstanceID                        IndividualId;                                      // 0x0(0x30)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// Function Pal.PalBaseCampWorkerDirector.OnRequiredAssignWork_ServerInternal
struct UPalBaseCampWorkerDirector_OnRequiredAssignWork_ServerInternal_Params
{
public:
	class UPalWorkBase*                          Work;                                              // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPalWorkAssignRequirementParameter    RequirementParameter;                              // 0x8(0x18)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x30 (0x30 - 0x0)
// Function Pal.PalBaseCampWorkerDirector.OnRemovedNewCharacterInServer
struct UPalBaseCampWorkerDirector_OnRemovedNewCharacterInServer_Params
{
public:
	struct FPalInstanceID                        IndividualId;                                      // 0x0(0x30)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x38 (0x38 - 0x0)
// Function Pal.PalBaseCampWorkerDirector.OnRaisedPhantomCharacterInServer
struct UPalBaseCampWorkerDirector_OnRaisedPhantomCharacterInServer_Params
{
public:
	struct FPalInstanceID                        IndividualId;                                      // 0x0(0x30)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        PhantomId;                                         // 0x30(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2F54[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x38 (0x38 - 0x0)
// Function Pal.PalBaseCampWorkerDirector.OnNotifiedUnassignWork_ServerInternal
struct UPalBaseCampWorkerDirector_OnNotifiedUnassignWork_ServerInternal_Params
{
public:
	class UPalWorkBase*                          Work;                                              // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPalInstanceID                        IndividualId;                                      // 0x8(0x30)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Pal.PalBaseCampWorkerDirector.OnDeadWorkerInServer_Internal
struct UPalBaseCampWorkerDirector_OnDeadWorkerInServer_Internal_Params
{
public:
	class APalCharacter*                         DeadCharacter;                                     // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x50 (0x50 - 0x0)
// Function Pal.PalBaseCampWorkerDirector.OnDeadWorkerInServer
struct UPalBaseCampWorkerDirector_OnDeadWorkerInServer_Params
{
public:
	struct FPalDeadInfo                          Info;                                              // 0x0(0x50)(ConstParm, Parm, NoDestructor, NativeAccessSpecifierPublic)
};

// 0x250 (0x250 - 0x0)
// Function Pal.PalBaseCampWorkerDirector.OnChangeWorldSettings_ServerInternal
struct UPalBaseCampWorkerDirector_OnChangeWorldSettings_ServerInternal_Params
{
public:
	struct FPalOptionWorldSettings               PrevSettings;                                      // 0x0(0x128)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FPalOptionWorldSettings               NewSettings;                                       // 0x128(0x128)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x30 (0x30 - 0x0)
// Function Pal.PalBaseCampWorkerDirector.OnAddedNewCharacterInServer
struct UPalBaseCampWorkerDirector_OnAddedNewCharacterInServer_Params
{
public:
	struct FPalInstanceID                        IndividualId;                                      // 0x0(0x30)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Pal.PalBaseCampWorkerDirector.GetCharacterHandleSlots
struct UPalBaseCampWorkerDirector_GetCharacterHandleSlots_Params
{
public:
	TArray<class UPalIndividualCharacterSlot*>   OutSlots;                                          // 0x0(0x10)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Pal.PalBaseCampWorkerDirector.FindSlotByHandle
struct UPalBaseCampWorkerDirector_FindSlotByHandle_Params
{
public:
	class UPalIndividualCharacterHandle*         Handle;                                            // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPalIndividualCharacterSlot*           ReturnValue;                                       // 0x8(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// DelegateFunction Pal.PalBaseCampWorkerDirector.AddNewWorkerDelegate__DelegateSignature
struct UPalBaseCampWorkerDirector_AddNewWorkerDelegate__DelegateSignature_Params
{
public:
	class UPalIndividualCharacterHandle*         NewCharacter;                                      // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Pal.PalBaseCampWorkerEventBase.IsTriggerEventBySanity
struct UPalBaseCampWorkerEventBase_IsTriggerEventBySanity_Params
{
public:
	float                                        SanityValue;                                       // 0x0(0x4)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x4(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2F8E[0x3];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x10 (0x10 - 0x0)
// Function Pal.PalBaseCampWorkerEventBase.IsTriggerEventByCharacter
struct UPalBaseCampWorkerEventBase_IsTriggerEventByCharacter_Params
{
public:
	class APalCharacter*                         Character;                                         // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x8(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2F90[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x10 (0x10 - 0x0)
// Function Pal.PalBaseCampWorkerEventBase.Debug_CreateTextTriggerEventSanity
struct UPalBaseCampWorkerEventBase_Debug_CreateTextTriggerEventSanity_Params
{
public:
	class FString                                ReturnValue;                                       // 0x0(0x10)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x38 (0x38 - 0x0)
// Function Pal.PalBaseCampWorkerEventBase.CreateNotifyMessageText
struct UPalBaseCampWorkerEventBase_CreateNotifyMessageText_Params
{
public:
	class FText                                  LocalizedFormatText;                               // 0x0(0x18)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class APalCharacter*                         Character;                                         // 0x18(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                  ReturnValue;                                       // 0x20(0x18)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Pal.PalBaseCampWorkerTask_IgnitionTorchAtNight.OnNotAvailableMapObjectInServer
struct UPalBaseCampWorkerTask_IgnitionTorchAtNight_OnNotAvailableMapObjectInServer_Params
{
public:
	class UPalMapObjectConcreteModelBase*        ConcreteModel;                                     // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Pal.PalBaseCampWorkerTask_IgnitionTorchAtNight.OnAvailableMapObjectInServer
struct UPalBaseCampWorkerTask_IgnitionTorchAtNight_OnAvailableMapObjectInServer_Params
{
public:
	class UPalMapObjectConcreteModelBase*        ConcreteModel;                                     // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Pal.PalBattleManager.TargetIsPlayerOrPlayersOtomoPal
struct UPalBattleManager_TargetIsPlayerOrPlayersOtomoPal_Params
{
public:
	class AActor*                                TargetCharacter;                                   // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x8(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2FBC[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x8 (0x8 - 0x0)
// Function Pal.PalBattleManager.SoundReactionStart
struct UPalBattleManager_SoundReactionStart_Params
{
public:
	class APalCharacter*                         SelfCharacter;                                     // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Pal.PalBattleManager.SetUpPlayerMap
struct UPalBattleManager_SetUpPlayerMap_Params
{
public:
	class AActor*                                Player;                                            // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Pal.PalBattleManager.RemovePlayerMap
struct UPalBattleManager_RemovePlayerMap_Params
{
public:
	class AActor*                                Player;                                            // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Pal.PalBattleManager.RemoveEnemyActor_AllPlayer
struct UPalBattleManager_RemoveEnemyActor_AllPlayer_Params
{
public:
	class AActor*                                Enemy;                                             // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EPalPlayerBattleFinishType        FinishType;                                        // 0x8(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2FE2[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x18 (0x18 - 0x0)
// Function Pal.PalBattleManager.RemoveEnemyActor
struct UPalBattleManager_RemoveEnemyActor_Params
{
public:
	class AActor*                                Player;                                            // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                Enemy;                                             // 0x8(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EPalPlayerBattleFinishType        FinishType;                                        // 0x10(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2FE9[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x8 (0x8 - 0x0)
// DelegateFunction Pal.PalBattleManager.QuestionMarkDelegate__DelegateSignature
struct UPalBattleManager_QuestionMarkDelegate__DelegateSignature_Params
{
public:
	class APalCharacter*                         TargetCharacter;                                   // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function Pal.PalBattleManager.IsBattleModeAnyPlayer
struct UPalBattleManager_IsBattleModeAnyPlayer_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function Pal.PalBattleManager.GetRandomActor
struct UPalBattleManager_GetRandomActor_Params
{
public:
	TArray<class AActor*>                        TargetList;                                        // 0x0(0x10)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	class AActor*                                ReturnValue;                                       // 0x10(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x30 (0x30 - 0x0)
// Function Pal.PalBattleManager.GetNearestActor
struct UPalBattleManager_GetNearestActor_Params
{
public:
	TArray<class AActor*>                        TargetList;                                        // 0x0(0x10)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FVector                               Location;                                          // 0x10(0x18)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                ReturnValue;                                       // 0x28(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// Function Pal.PalBattleManager.GetConflictEnemies
struct UPalBattleManager_GetConflictEnemies_Params
{
public:
	class AActor*                                Player;                                            // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class AActor*>                        OutEnemyes;                                        // 0x8(0x10)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                         IgnoreOtomoStopByBall;                             // 0x18(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x19(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2FFC[0x6];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x20 (0x20 - 0x0)
// Function Pal.PalBattleManager.GetAllPlayerAndOtomo_ForEnemySelf
struct UPalBattleManager_GetAllPlayerAndOtomo_ForEnemySelf_Params
{
public:
	TArray<class AActor*>                        TargetPlayers;                                     // 0x0(0x10)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class AActor*>                        OutCharacters;                                     // 0x10(0x10)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// DelegateFunction Pal.PalBattleManager.ExclamationMarkDelegate__DelegateSignature
struct UPalBattleManager_ExclamationMarkDelegate__DelegateSignature_Params
{
public:
	class APalCharacter*                         TargetCharacter;                                   // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Pal.PalBattleManager.EnemyNearPlayerListUpdate
struct UPalBattleManager_EnemyNearPlayerListUpdate_Params
{
public:
	class AActor*                                Enemy;                                             // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        Distance;                                          // 0x8(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3005[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x4 (0x4 - 0x0)
// DelegateFunction Pal.PalBattleManager.EmitSoundOnlyPalmiDelegate__DelegateSignature
struct UPalBattleManager_EmitSoundOnlyPalmiDelegate__DelegateSignature_Params
{
public:
	int32                                        SoundLevel;                                        // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x28 (0x28 - 0x0)
// DelegateFunction Pal.PalBattleManager.EmitSoundDelegate__DelegateSignature
struct UPalBattleManager_EmitSoundDelegate__DelegateSignature_Params
{
public:
	int32                                        SoundRadius;                                       // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_300A[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               EmitLocation;                                      // 0x8(0x18)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                Emitter;                                           // 0x20(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x30 (0x30 - 0x0)
// Function Pal.PalBattleManager.EmitSound
struct UPalBattleManager_EmitSound_Params
{
public:
	class FName                                  SoundRowName;                                      // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                Emitter;                                           // 0x8(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                               EmitLocation;                                      // 0x10(0x18)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        VolumeRate;                                        // 0x28(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_300F[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x10 (0x10 - 0x0)
// Function Pal.PalBattleManager.AddEnemyActor_PlayerOrOtomo
struct UPalBattleManager_AddEnemyActor_PlayerOrOtomo_Params
{
public:
	class AActor*                                PlayerOrOtomo;                                     // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                Enemy;                                             // 0x8(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Pal.PalBattleManager.ActionMenaceStart
struct UPalBattleManager_ActionMenaceStart_Params
{
public:
	class APalCharacter*                         SelfCharacter;                                     // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Pal.PalBiomeAreaTriggerBase.OnOverlap
struct APalBiomeAreaTriggerBase_OnOverlap_Params
{
public:
	class AActor*                                OtherActor;                                        // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EPalBiomeType                     BiomeType;                                         // 0x8(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3024[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x10 (0x10 - 0x0)
// Function Pal.PalBiomeAreaTriggerBase.OnEndOverlap
struct APalBiomeAreaTriggerBase_OnEndOverlap_Params
{
public:
	class AActor*                                OtherActor;                                        // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
