#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0xA68 (0xCF8 - 0x290)
// BlueprintGeneratedClass PPSkyCreator_ControllerExample.PPSkyCreator_ControllerExample_C
class APPSkyCreator_ControllerExample_C : public AActor
{
public:
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0x290(0x8)(ZeroConstructor, Transient, DuplicateTransient)
	class UAudioComponent*                       SoundRain;                                         // 0x298(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UTextRenderComponent*                  TextRender;                                        // 0x2A0(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                       DefaultSceneRoot;                                  // 0x2A8(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class APPSkyCreator*                         SkyCreatorTarget;                                  // 0x2B0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                         bRealtimeTimeOfDay;                                // 0x2B8(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4E13[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	double                                       RealtimeTimeOfDayStart;                            // 0x2C0(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       RealtimeTimeOfDayDuration;                         // 0x2C8(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         bRealtimeWeatherChange;                            // 0x2D0(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4E14[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	double                                       ChangeIntervalTimeMin;                             // 0x2D8(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       ChangeIntervalTimeMax;                             // 0x2E0(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPPSkyCreatorWeatherPreset*            StartWeatherPreset;                                // 0x2E8(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                       InterpolateDurationTimeMin;                        // 0x2F0(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       InterpolateDurationTimeMax;                        // 0x2F8(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UPPSkyCreatorWeatherPreset*>    RandomWeatherPresets;                              // 0x300(0x10)(Edit, BlueprintVisible)
	bool                                         DrawDebugMessages;                                 // 0x310(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4E15[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class USoundCue*                             Rain;                                              // 0x318(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPPSkyCreatorWeatherPreset*            NextWeatherPreset;                                 // 0x320(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FPPSkyCreatorWeatherSettings          CurrentWeatherSettings;                            // 0x328(0x458)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FPPSkyCreatorWeatherSettings          NextWeatherSettings;                               // 0x780(0x458)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	double                                       WeatherInterpolateDuration;                        // 0xBD8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       InterpolateDurationAlpha;                          // 0xBE0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       CurrentChangeInterval;                             // 0xBE8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                          Timer_WeatherInterpolateDuration;                  // 0xBF0(0x8)(Edit, BlueprintVisible, Net, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                          Timer_WeatherChangeInterval;                       // 0xBF8(0x8)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                         bEnableRandomWind;                                 // 0xC00(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4E16[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	double                                       CloudWindSpeedMin;                                 // 0xC08(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       CloudWindSpeedMax;                                 // 0xC10(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPPSkyCreatorWindSettings             CurrentWindSettings;                               // 0xC18(0x1C)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FPPSkyCreatorWindSettings             NextWindSettings;                                  // 0xC34(0x1C)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	double                                       CurrentWindDirection;                              // 0xC50(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       CurrentWindSpeed;                                  // 0xC58(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       WetnessAccumulateDuration;                         // 0xC60(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       WetnessDryDuration;                                // 0xC68(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       PuddlesAccumulateDuration;                         // 0xC70(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       PuddlesDryDuration;                                // 0xC78(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       SnowAccumulateDuration;                            // 0xC80(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       SnowMeltDuration;                                  // 0xC88(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                          WetnessAccumulationTimer;                          // 0xC90(0x8)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                          WetnessDryTimer;                                   // 0xC98(0x8)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                          PuddlesAccumulationTimer;                          // 0xCA0(0x8)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                          PuddlesDryTimer;                                   // 0xCA8(0x8)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                          SnowAccumulationTimer;                             // 0xCB0(0x8)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                          SnowMeltTimer;                                     // 0xCB8(0x8)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                       CurrentWetnessAmount;                              // 0xCC0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       NextWetnessAmount;                                 // 0xCC8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       CurrentPuddlesAmount;                              // 0xCD0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       NextPuddlesAmount;                                 // 0xCD8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       CurrentSnowAmount;                                 // 0xCE0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       NextSnowAmount;                                    // 0xCE8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                            Lightnings;                                        // 0xCF0(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)

	static class UClass* StaticClass();
	static class APPSkyCreator_ControllerExample_C* GetDefaultObj();

	void SetRainVolume(const struct FPPSkyCreatorWeatherFXSettings& CallFunc_GetWeatherFXSettings_ReturnValue);
	void WeatherMaterialFX_Interpolation(double CallFunc_GetWorldDeltaSeconds_ReturnValue, float CallFunc_K2_GetTimerRemainingTimeHandle_ReturnValue, const class FString& CallFunc_Conv_DoubleToString_ReturnValue, const class FString& CallFunc_Concat_StrStr_ReturnValue, float CallFunc_K2_GetTimerElapsedTimeHandle_ReturnValue, double CallFunc_MapRangeClamped_ReturnValue, bool CallFunc_K2_IsTimerActiveHandle_ReturnValue, double CallFunc_GetWorldDeltaSeconds_ReturnValue_1, float CallFunc_K2_GetTimerRemainingTimeHandle_ReturnValue_1, const class FString& CallFunc_Conv_DoubleToString_ReturnValue_1, const class FString& CallFunc_Concat_StrStr_ReturnValue_1, float CallFunc_K2_GetTimerElapsedTimeHandle_ReturnValue_1, double CallFunc_MapRangeClamped_ReturnValue_1, bool CallFunc_K2_IsTimerActiveHandle_ReturnValue_1, double CallFunc_GetWorldDeltaSeconds_ReturnValue_2, float CallFunc_K2_GetTimerRemainingTimeHandle_ReturnValue_2, const class FString& CallFunc_Conv_DoubleToString_ReturnValue_2, const class FString& CallFunc_Concat_StrStr_ReturnValue_2, float CallFunc_K2_GetTimerElapsedTimeHandle_ReturnValue_2, double CallFunc_MapRangeClamped_ReturnValue_2, bool CallFunc_K2_IsTimerActiveHandle_ReturnValue_2, double CallFunc_GetWorldDeltaSeconds_ReturnValue_3, float CallFunc_K2_GetTimerRemainingTimeHandle_ReturnValue_3, const class FString& CallFunc_Conv_DoubleToString_ReturnValue_3, const class FString& CallFunc_Concat_StrStr_ReturnValue_3, float CallFunc_K2_GetTimerElapsedTimeHandle_ReturnValue_3, double CallFunc_MapRangeClamped_ReturnValue_3, bool CallFunc_K2_IsTimerActiveHandle_ReturnValue_3, double CallFunc_GetWorldDeltaSeconds_ReturnValue_4, float CallFunc_K2_GetTimerRemainingTimeHandle_ReturnValue_4, const class FString& CallFunc_Conv_DoubleToString_ReturnValue_4, const class FString& CallFunc_Concat_StrStr_ReturnValue_4, float CallFunc_K2_GetTimerElapsedTimeHandle_ReturnValue_4, double CallFunc_MapRangeClamped_ReturnValue_4, bool CallFunc_K2_IsTimerActiveHandle_ReturnValue_4, double CallFunc_GetWorldDeltaSeconds_ReturnValue_5, float CallFunc_K2_GetTimerRemainingTimeHandle_ReturnValue_5, const class FString& CallFunc_Conv_DoubleToString_ReturnValue_5, const class FString& CallFunc_Concat_StrStr_ReturnValue_5, float CallFunc_K2_GetTimerElapsedTimeHandle_ReturnValue_5, double CallFunc_MapRangeClamped_ReturnValue_5, bool CallFunc_K2_IsTimerActiveHandle_ReturnValue_5, float CallFunc_LerpSnowAmount_SnowAmountA_ImplicitCast, float CallFunc_PrintString_Duration_ImplicitCast, double CallFunc_Conv_DoubleToString_InDouble_ImplicitCast, double CallFunc_MapRangeClamped_Value_ImplicitCast, float CallFunc_LerpSnowAmount_Alpha_ImplicitCast, float CallFunc_LerpSnowAmount_SnowAmountB_ImplicitCast, float CallFunc_LerpSnowAmount_SnowAmountA_ImplicitCast_1, float CallFunc_PrintString_Duration_ImplicitCast_1, double CallFunc_Conv_DoubleToString_InDouble_ImplicitCast_1, double CallFunc_MapRangeClamped_Value_ImplicitCast_1, float CallFunc_LerpSnowAmount_Alpha_ImplicitCast_1, float CallFunc_LerpSnowAmount_SnowAmountB_ImplicitCast_1, float CallFunc_LerpPuddlesAmount_PuddlesAmountB_ImplicitCast, float CallFunc_LerpPuddlesAmount_PuddlesAmountA_ImplicitCast, float CallFunc_PrintString_Duration_ImplicitCast_2, double CallFunc_Conv_DoubleToString_InDouble_ImplicitCast_2, double CallFunc_MapRangeClamped_Value_ImplicitCast_2, float CallFunc_LerpPuddlesAmount_Alpha_ImplicitCast, float CallFunc_LerpPuddlesAmount_PuddlesAmountB_ImplicitCast_1, float CallFunc_LerpPuddlesAmount_PuddlesAmountA_ImplicitCast_1, float CallFunc_PrintString_Duration_ImplicitCast_3, double CallFunc_Conv_DoubleToString_InDouble_ImplicitCast_3, double CallFunc_MapRangeClamped_Value_ImplicitCast_3, float CallFunc_LerpPuddlesAmount_Alpha_ImplicitCast_1, float CallFunc_LerpWetnessAmount_WetnessAmountB_ImplicitCast, float CallFunc_LerpWetnessAmount_WetnessAmountA_ImplicitCast, float CallFunc_PrintString_Duration_ImplicitCast_4, double CallFunc_Conv_DoubleToString_InDouble_ImplicitCast_4, double CallFunc_MapRangeClamped_Value_ImplicitCast_4, float CallFunc_LerpWetnessAmount_Alpha_ImplicitCast, float CallFunc_LerpWetnessAmount_WetnessAmountB_ImplicitCast_1, float CallFunc_LerpWetnessAmount_WetnessAmountA_ImplicitCast_1, float CallFunc_PrintString_Duration_ImplicitCast_5, double CallFunc_Conv_DoubleToString_InDouble_ImplicitCast_5, double CallFunc_MapRangeClamped_Value_ImplicitCast_5, float CallFunc_LerpWetnessAmount_Alpha_ImplicitCast_1);
	void UserConstructionScript(class APPSkyCreator* CallFunc_GetActorOfClass_ReturnValue);
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);
	void Start_WeatherInterpolation();
	void Finish_WeatherInterpolation();
	void Start_WeatherChangeInterval();
	void Finish_WeatherChangeInterval();
	void Finish_PuddlesAccumulation();
	void Finish_WetnessAccumulation();
	void Finish_WetnessDry();
	void Finish_PuddlesDry();
	void Start_WetnessAccumulate();
	void Start_WetnessDry();
	void Start_PuddlesAccumulate();
	void Start_PuddlesDry();
	void Start_SnowAccumulate();
	void Start_SnowMelt();
	void Finish_SnowAccumulate();
	void Finish_SnowDry();
	void LightningStrike(const struct FVector& LightningPosition);
	void ExecuteUbergraph_PPSkyCreator_ControllerExample(int32 EntryPoint, bool CallFunc_HasAuthority_ReturnValue, bool CallFunc_HasAuthority_ReturnValue_1, float K2Node_Event_DeltaSeconds, const struct FPPSkyCreatorWeatherSettings& CallFunc_GetWeatherPresetSettings_ReturnValue, float CallFunc_K2_GetTimerElapsedTimeHandle_ReturnValue, bool CallFunc_K2_IsTimerActiveHandle_ReturnValue, double CallFunc_MapRangeClamped_ReturnValue, double CallFunc_GetWorldDeltaSeconds_ReturnValue, double CallFunc_GetWorldDeltaSeconds_ReturnValue_1, double CallFunc_GetWorldDeltaSeconds_ReturnValue_2, float CallFunc_K2_GetTimerRemainingTimeHandle_ReturnValue, const class FString& CallFunc_Conv_DoubleToString_ReturnValue, float CallFunc_GetTime_ReturnValue, const class FString& CallFunc_Concat_StrStr_ReturnValue, const class FString& CallFunc_Conv_DoubleToString_ReturnValue_1, int32 CallFunc_Array_Length_ReturnValue, int32 CallFunc_Subtract_IntInt_ReturnValue, int32 CallFunc_RandomIntegerInRange_ReturnValue, const struct FPPSkyCreatorWeatherSettings& CallFunc_GetWeatherSettings_ReturnValue, class UPPSkyCreatorWeatherPreset* CallFunc_Array_Get_Item, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate, double CallFunc_RandomFloatInRange_ReturnValue, const struct FTimerHandle& CallFunc_K2_SetTimerDelegate_ReturnValue, bool CallFunc_K2_IsTimerActiveHandle_ReturnValue_1, const struct FPPSkyCreatorWeatherSettings& CallFunc_GetWeatherPresetSettings_ReturnValue_1, bool CallFunc_Not_PreBool_ReturnValue, const class FString& CallFunc_GetDisplayName_ReturnValue, const class FString& CallFunc_Concat_StrStr_ReturnValue_1, bool CallFunc_HasAuthority_ReturnValue_2, bool CallFunc_HasAuthority_ReturnValue_3, double CallFunc_RandomFloatInRange_ReturnValue_1, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_1, const struct FTimerHandle& CallFunc_K2_SetTimerDelegate_ReturnValue_1, double CallFunc_RandomFloatInRange_ReturnValue_2, double CallFunc_RandomFloatInRange_ReturnValue_3, const struct FPPSkyCreatorWindSettings& K2Node_MakeStruct_PPSkyCreatorWindSettings, bool CallFunc_HasAuthority_ReturnValue_4, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_2, const struct FTimerHandle& CallFunc_K2_SetTimerDelegate_ReturnValue_2, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_3, const struct FTimerHandle& CallFunc_K2_SetTimerDelegate_ReturnValue_3, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_4, bool CallFunc_HasAuthority_ReturnValue_5, const struct FTimerHandle& CallFunc_K2_SetTimerDelegate_ReturnValue_4, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_5, const struct FTimerHandle& CallFunc_K2_SetTimerDelegate_ReturnValue_5, bool CallFunc_HasAuthority_ReturnValue_6, bool CallFunc_HasAuthority_ReturnValue_7, bool CallFunc_Less_DoubleDouble_ReturnValue, bool CallFunc_EqualEqual_DoubleDouble_ReturnValue, bool CallFunc_Less_DoubleDouble_ReturnValue_1, bool CallFunc_EqualEqual_DoubleDouble_ReturnValue_1, bool CallFunc_NotEqual_DoubleDouble_ReturnValue, bool CallFunc_NotEqual_DoubleDouble_ReturnValue_1, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_6, const struct FTimerHandle& CallFunc_K2_SetTimerDelegate_ReturnValue_6, bool CallFunc_HasAuthority_ReturnValue_8, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_7, const struct FTimerHandle& CallFunc_K2_SetTimerDelegate_ReturnValue_7, bool CallFunc_Less_DoubleDouble_ReturnValue_2, bool CallFunc_EqualEqual_DoubleDouble_ReturnValue_2, bool CallFunc_NotEqual_DoubleDouble_ReturnValue_2, bool CallFunc_HasAuthority_ReturnValue_9, bool CallFunc_IsDedicatedServer_ReturnValue, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_8, const struct FVector& K2Node_CustomEvent_LightningPosition, class UAudioComponent* CallFunc_SpawnSound2D_ReturnValue, float CallFunc_SetTime_InTime_ImplicitCast, float CallFunc_RealtimeTimeOfDay_DayCycleDuration_ImplicitCast, double CallFunc_MapRangeClamped_Value_ImplicitCast, float CallFunc_LerpWeatherSettings_Alpha_ImplicitCast, float CallFunc_RealtimeTimeOfDay_DeltaSeconds_ImplicitCast, float CallFunc_PrintString_Duration_ImplicitCast, float CallFunc_PrintString_Duration_ImplicitCast_1, double CallFunc_Conv_DoubleToString_InDouble_ImplicitCast, double CallFunc_Conv_DoubleToString_InDouble_ImplicitCast_1, float CallFunc_K2_SetTimerDelegate_Time_ImplicitCast, float CallFunc_K2_SetTimerDelegate_Time_ImplicitCast_1, float CallFunc_LerpWindIndependentSettings_Alpha_ImplicitCast, float K2Node_MakeStruct_CloudWindDirection_ImplicitCast, float K2Node_MakeStruct_CloudWindSpeed_ImplicitCast, float K2Node_MakeStruct_PrecipitationWindDirection_ImplicitCast, float K2Node_MakeStruct_PrecipitationWindSpeed_ImplicitCast, float CallFunc_K2_SetTimerDelegate_Time_ImplicitCast_2, float CallFunc_K2_SetTimerDelegate_Time_ImplicitCast_3, float CallFunc_K2_SetTimerDelegate_Time_ImplicitCast_4, float CallFunc_K2_SetTimerDelegate_Time_ImplicitCast_5, double K2Node_VariableSet_CurrentWetnessAmount_ImplicitCast, double K2Node_VariableSet_NextWetnessAmount_ImplicitCast, double K2Node_VariableSet_CurrentPuddlesAmount_ImplicitCast, double K2Node_VariableSet_NextPuddlesAmount_ImplicitCast, float CallFunc_K2_SetTimerDelegate_Time_ImplicitCast_6, float CallFunc_K2_SetTimerDelegate_Time_ImplicitCast_7, double K2Node_VariableSet_CurrentSnowAmount_ImplicitCast, double K2Node_VariableSet_NextSnowAmount_ImplicitCast);
};

}


