#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// ENUMS
//---------------------------------------------------------------------------------------------------------------------


//---------------------------------------------------------------------------------------------------------------------
// STRUCTS
//---------------------------------------------------------------------------------------------------------------------

// 0x6B (0x6B - 0x0)
// UserDefinedStruct SplineAttachment.SplineAttachment
struct FSplineAttachment
{
public:
	class UStaticMesh*                           StaticMesh_47_3E26B9A843F1DD460A8E648EA4512EF1;    // 0x0(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                Actor_43_55DB51C74ADB81AE8B3C67B1E701AC70;         // 0x8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	float                                        Spacing_16_A1850B9941C9F1CE594A6D8E4D2B6C72;       // 0x10(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_5036[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               Scale_17_0FF21A994C9965DF5D70EB8E0B857472;         // 0x18(0x18)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                               Offset_18_04ECFFEB41DE1C636D2E66B03104C5E7;        // 0x30(0x18)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        SplineOffset_52_C731D9EB439A6A122EE274AC46F153E8;  // 0x48(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_5037[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FRotator                              Rotation_19_8934B08D49E62A953A970696627EBA95;      // 0x50(0x18)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         OrientToSpline_45_8AE90114466411B69A364A9ACC68D82F; // 0x68(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Enabled_54_28B292F644AD049F1C817E98CAE7E1A8;       // 0x69(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         InterpolateSplineScale_63_795808994F00156B5CE473897E183DE4; // 0x6A(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}


